Repository: binary-com/mobile
Catalog: www/translation/*.po
Languages: id

source: Have questions? Email customer support at
id: Ada pertanyaan? Email customer support di

source: and create a token. Then simply copy and paste it into the top box.
id: dan buat token. Kemudian masukkan pada kotak dihalaman pertama tadi.

source: Please visit
id: Pastikan Anda sudah login kedalam akun Anda kemudian kunjungi

# .help.back
source: Back
id: Kembali

# .help.need_help
source: Need Help?
id: Memerlukan Bantuan?

source: To access a third party application, such as a mobile app, you are required to generate an API Token.
id: Untuk mengakses aplikasi pihak ketiga, seperti mobile app, Anda diperlukan untuk membuat Token API.

source: this page
id: halaman ini

source: Exit
id: Keluar

source: Connection Error
id: Koneksi Error

source: There is no internet connection!
id: Tidak ada koneksi internet!

source: Are you sure you want to exit?
id: Apa Anda yakin ingin keluar?

source: Installing update
id: Menginstal pembaruan

source: The update was installed successfully.
id: Pembaruan berhasil diinstal.

source: The application is up to date.
id: Aplikasi ini sudah diperbarui.

source: Checking for update.
id: Memeriksa pembaruan.

source: An error occured while checking for updates
id: Terjadi error saat mengecek pembaruan

# .trade.payout
source: Payout
id: Hasil

source: Net Profit
id: Laba Bersih

source: BUY
id: BELI

source: Buy Again
id: Beli Lagi

source: Loss
id: Rugi

source: Total Cost
id: Total Biaya

source: This contract won
id: Kontrak ini untung

source: Price
id: Harga

# .trade.stake
source: Stake
id: Modal

# .trade.back
source: Back
id: Kembali

source: Account Balance
id: Saldo Akun

source: Buy Price
id: Harga Beli

source: This contract lost
id: Kontrak ini rugi

source: Profit
id: Untung

source: Potential Profit
id: Potensi Untung

source: Final Price
id: Harga Akhir

source: Potential Payout
id: Potensi Hasil

source: Balance
id: Saldo

source: Transaction Reference
id: Referensi Transaksi

source: Add Account
id: Gunakan Akun

source: Sign in
id: Masuk

source: Language
id: Bahasa

source: Paste your token here
id: Masukkan token Anda disini

source: Or sign in with a token
id: Atau masuk menggunakan token

source: Next
id: Berikutnya

source: How to get a Token?
id: Bagaimanakah cara memperoleh Token?

# .signin.need_help
source: Need Help?
id: Perlu Bantuan?

source: Manage Accounts
id: Mengelola Akun

source: Default
id: Setelan

# .accounts.account
source: Account
id: Akun

source: You don't have permission to trade!
id: Anda tidak memiliki izin untuk bertrading!

source: Add
id: Tambah

source: Remove All Accounts & Sign Out
id: Hapus Semua Akun & Keluar

source: Add a new token
id: Tambahkan token baru

source: Delete
id: Hapus

source: Set as default
id: Pasang sebagai setelan

source: Are you sure you want to remove this token?
id: Apakah Anda yakin ingin menghapus token ini?

source: Removing All Tokens
id: Hapus Semua Token

source: It must be a number.
id: Harus berupa angka.

source: Removing a Token
id: Menghapus Token

source: Please select another underlying, The underlying you've selected doesn't support ticks.
id: Pilih pasar inti lainnya, pasar inti yang Anda pilih tidak tersedia dalam pilihan tik.

source: It must be between 0.70 and 100000.
id: Harus antara 0.70 dan 100000.

source: You've already added this account.
id: Anda telah menambahkan akun ini.

source: Warning
id: Peringatan

source: Sorry, we couldn't authenticate you.
id: Maaf, kami tidak dapat mengotentikasi Anda.

source: There is no underlying for this market. Please try another market.
id: Tidak tersedia pilihan pasar inti untuk pasar ini. Silahkan coba pasar lain.

source: Contract not available, please try again.
id: Kontrak tidak tersedia, silahkan coba lagi.

source: This field is required.
id: Bagian ini diperlukan.

source: Please enter a valid token.
id: Masukkan token yang berlaku.

source: Are you sure you want to remove all tokens and sign out?
id: Apakah Anda yakin ingin menghapus semua token dan keluar?

source: Volatility Indices
id: Indeks Volatilitas

source: Select Amount
id: Pilih Jumlah

source: Underlying
id: Pasar Inti

source: Markets
id: Pilihan Pasar

source: Payout Type
id: Jenis Hasil

# .options.stake
source: Stake
id: Modal

source: SAVE
id: SIMPAN

source: Trade Types
id: Jenis Kontrak

source: Matches
id: Digit Match

source: Number of Ticks
id: Jumlah Tik

source: Let's trade!
id: Ayo trade!

source: Last Digit Prediction
id: Analisa Digit Terakhir

# .options.payout
source: Payout
id: Hasil

# .options.account
source: Account
id: Akun
