Repository: binary-com/mobile
Catalog: */00a_preface.po
Languages: it_it, ja_jp, ru_ru

source: So Debian is quite unique. Are we the only ones noticing this? Definitely not. According to <ulink url="http://distrowatch.com/">DistroWatch</ulink> there are about 300 active Free Software distributions around. Half of that (about 140) are Debian <emphasis>derivatives</emphasis>. That means that they start from Debian, adapt it to fit the needs of their users — usually by adding, modifying, and rebuilding packages — and release the resulting product. In essence, derivatives apply the Free Software granted freedoms of modifying and redistributing copies not only to individual pieces of software, but to a distribution as a whole. The potential of reaching out to new Free Software users and contributors by the means of derivative distributions is huge. We believe that it is mainly thanks to that thriving ecosystem that Free Software is nowadays finally rivaling with proprietary software in fields which were historically considered hard to conquer, such as large desktop deployments. Debian sits at the root of the largest ecosystem of Free Software distributions in existence: even if you are not using Debian directly, and even if your distributor has not told you, chances are that you are benefiting right now from the work of the Debian community.
it_it: Debian è perciò piuttosto unica. Siamo i soli a notarlo? Decisamente no. Secondo <ulink url="http://distrowatch.com/">DistroWatch</ulink> ci sono circa 300 distribuzioni di software libero attive in giro. La metà di esse (circa 140) sono <emphasis>derivate</emphasis> da Debian. Ciò significa che partono da Debian, la cambiano per adattarla alle necessità dei propri utenti, solitamente aggiungendo, modificando e ricompilando pacchetti, e rilasciano il prodotto risultante. In sostanza le derivate applicano le libertà garantite dal software libero di modifica e ridistribuzione di copie non solo ai singoli pezzi di software, ma a una distribuzione nel suo complesso. Il potenziale di raggiungere nuovi utenti e contributori del software libero attraverso le distribuzioni derivate è enorme. Crediamo che sia principalmente grazie a quell'ecosistema in fermento che il software libero è oggi finalmente in grado di rivaleggiare con il software proprietario in campi che erano storicamente considerati difficili da conquistare, come grandi installazioni desktop. Debian sta alla radice del più vasto ecosistema di distribuzioni di software libero esistente: anche se non si usa Debian direttamente, e anche se il proprio distributore non lo ha comunicato, è probabile che si stia traendo beneficio in questo stesso istante dal lavoro della comunità Debian.
ja_jp: そんなわけで Debian はとても独特です。これに気が付いているのは我々だけでしょうか? そんな訳がありません。<ulink url="http://distrowatch.com/">DistroWatch</ulink> によれば、世界には約 300 の活発なフリーソフトウェアディストリビューションがあります。そのうちの半分 (約 140) は Debian <emphasis>派生物</emphasis>です。これは、それらのディストリビューションが Debian を基にして、ユーザの必要性に合わせた改変 (通常はパッケージの追加、改変、再構築) を行い、その成果物をリリースしていることを意味しています。要するに派生物は、一つ一つのソフトウェアだけでなくディストリビューション全体としてコピーを改変したり再配布する自由が保障されているフリーソフトウェアを利用しているのです。派生ディストリビューションを通じて、新たなフリーソフトウェアのユーザと貢献者に働きかける潜在的可能性は大きなものです。今日、フリーソフトウェアは歴史的に見て乗り越えることが難しいと考えられている、たとえば大きなデスクトップ環境などの、分野においてもプロプライエタリソフトウェアとようやく張り合うことができるようになっています。これは主にに繁栄しているエコシステムのおかげだと考えられています。Debian は存在するフリーソフトウェアディストリビューションでは最大のエコシステムの根幹に位置しています: 直接 Debian を使っていなかったとしても、ディストリビュータが言わなかったとしても、今現在あなたは Debian コミュニティによる業績の恩恵を受けている可能性があります。
ru_ru: Итак, Debian весьма уникален. Только ли мы это видим? Определённо нет. В соответствии с <ulink url="http://distrowatch.com/">DistroWatch</ulink> существует около 300 активных дистрибутивов Свободного ПО. Половина из них (примерно 140) — <emphasis>производные</emphasis> Debian. Это значит, что они начались с Debian, адаптировали его для нужд своих пользователей — обычно путём добавления, модификации и пересборки пакетов — и выпустили получившийся продукт. По существу, производные применилидарованные Свободным ПО свободы модификации и распространения копий не только отдельных программ, но и всего дистрибутива как целого. Потенциал привлечения новых пользователей Свободного Программного Обеспечения и участников через посредничество производных дистрибутивов огромен. Мы верим, что во многом именно благодаря этой разрастающейся экосистеме Свободное ПО сегодня наконец конкурирует с собственническим в тех областях, которые исторически считались трудными для покорения, таких как большие развёртывания на настольных ПК. Debian находится в корне крупнейшей из существующих экосистем дистрибутивов Свободного ПО: даже если вы не используете Debian непосредственно, и даже если ваш поставщик не сказал вам, по всей вероятности вы прямо сейчас извлекаете пользу из работы сообщества Debian.

source: But Debian's uniqueness sometimes comes with unexpected consequences. A consequence of Debian's vision on digital freedoms has been the need of redefining what we mean by <emphasis>software</emphasis>. The Debian Project has since long realized that, as part of an operating system, you need to distribute a lot of non-software material: music, images, documentation, raw data, firmware, etc. But how do you apply <emphasis>software</emphasis> freedoms to that material? Should we have different requirements or should all material be held up to the same high standard of freedom? The Debian Project has decided for the latter: all material shipped as part of Debian should offer the same freedoms to its users. Such a radical philosophical position has far reaching effects. It means we cannot distribute non-free firmware, or artwork not meant to be used in commercial settings, or books that cannot be modified in order to avoid tarnishing (as book publishers folklore goes) the author/publisher reputation.
it_it: Ma l'unicità di Debian a volte porta a conseguenze inaspettate. Una delle conseguenze del punto di vista di Debian sulle libertà digitali è stata la necessità di ridefinire ciò che viene indicato con <emphasis>software</emphasis>. Il progetto Debian ha da lungo tempo realizzato che, come parte di un sistema operativo, è necessario distribuire molto materiale non-software: musica, immagini, documentazione, dati grezzi, firmware, ecc. Ma come applicare le libertà del <emphasis>software</emphasis> a tale materiale? Dobbiamo avere requisiti diversi o tutto il materiale deve conformarsi al medesimo alto standard di libertà? Il progetto Debian ha scelto la seconda possibilità: tutto il materiale fornito come parte di Debian deve offrire le stesse libertà ai suoi utenti. Una posizione filosofica così radicale ha effetti di grande portata. Significa che non possiamo distribuire firmware non libero oppure lavori artistici non pensati per essere usati in ambito commerciale, o libri che non possono essere modificati allo scopo di evitare di macchiare (come sostiene il folclore degli editori di libri) la reputazione dell'autore o editore.
ja_jp: しかし Debian の独自性は時に思いもよらない結果を招くことがあります。デジタルフリーダムに関する Debian の構想の結果、<emphasis>ソフトウェア</emphasis>の意味を再定義する必要性が出てきました。Debian プロジェクトはずっと以前から、オペレーティングシステムの一部として数多くのソフトウェアではない作品 (音楽、画像、文書、生データ、ファームウェアなど) を配布する必要がある、ということに気が付いていました。しかし、これらの作品に対してどのように<emphasis>ソフトウェア</emphasis>フリーダムを適用すればよいのでしょうか。個々の作品が独自の要件を設定するべきでしょうか、それともすべての作品に単一で高い水準の自由を求めるべきなのでしょうか? Debian プロジェクトは後者を選ぶことに決めました: Debian の一部として配布されるすべての作品はユーザに対して単一の自由を提供するべきである。このような徹底的な哲学的姿勢は広範囲に影響を与えました。この姿勢は、フリーでないファームウェア、商業的環境で利用される事を許可していないアートワーク、(本の出版社が変わらない限り) 著者と出版社の評判を下げることを回避するために改変できない本などは配布できないということを意味しています。
ru_ru: Но у уникальности Debian есть некоторые неожиданные следствия. Следствие взгляда Debian на цифровые свободы привело к переопределению того, что мы подразумеваем под <emphasis>программным обеспечением</emphasis>. Проект Debian со временем осознал, что в составе операционной системы должны распространяться и непрограммные материалы: музыка, изображения, документация, необработанные данные, «прошивки» и т. д. Но как применять свободы <emphasis>программного обеспечения</emphasis> к этим материалам? Следует ли нам предъявлять другие требования, или все материалы должны придерживаться одних и тех же высоких стандартов свободы? Проект Debian решил в пользу второго варианта: все материалы, поставляемые как часть Debian, должны предоставлять те же самые свободы своим пользователям. Такая радикальная философская позиция имела далеко идущие эффекты. Это значит, что мы не можем распространять несвободные «прошивки», или художественные произведения, не предназначенные для коммерческого использования, или книги, которые нельзя модифицировать, чтобы не запятнать (в соответствии с мифологией книгоиздателей) репутацию автора/издателя.

source: The book you have in your hands is different. It's a <emphasis>free as in freedom</emphasis> book, a book which is up to Debian freedom standards for every aspects of your digital life. For a very long time, the scarce availability of books like this one has been a significant shortcoming of Debian. It meant that that there was little reading material that help spreading Debian and its values, while at the same time embodying those values and showing off their advantages. But it also meant, ironically, that we had little such material that we could distribute as part of Debian itself. This is the first reputable book to address this shortcoming. You can <command>apt-get install</command> this book, you can redistribute it, you can fork this book or, better, submit bug reports and patches for it, so that other in the future can benefit from your contributions. The “maintainers” of this book — who are also its authors — are longstanding members of the Debian Project, who grok the freedom ethos that permeates every aspect of Debian and know first-hand what it means to take on the responsibility for important parts of Debian. By releasing this Free book they are doing, once more, such a wonderful service to the Debian community.
it_it: Il libro che avete tra le mani è differente. È un libro <emphasis>libero</emphasis>, un libro che è conforme agli standard di libertà di Debian per ogni aspetto della vita digitale. Per moltissimo tempo la scarsa disponibilità di libri come questo è stata una grande carenza di Debian. Ha significato la presenza di poco materiale di lettura che aiutasse a diffondere Debian e i suoi valori, allo stesso tempo incarnandoli e mostrando i loro vantaggi. Ma ha anche ironicamente significato che avevamo poco materiale di questo tipo che poteva essere distribuito come parte di Debian stessa. Questo è il primo libro degno di nota ad affrontare questa carenza. Si può installare questo libro con <command>apt-get install</command>, ridistribuirlo, farne un fork o, meglio, inviare segnalazioni di bug e patch per esso, in modo che altri in futuro possano trarre beneficio dai propri contributi. I «manutentori» di questo libro, che sono anche i suoi autori, sono membri veterani del progetto Debian, che padroneggiano il carattere di libertà che permea ogni aspetto di Debian e sanno in prima persona cosa significhi prendersi la responsabilità di parti importanti di Debian. Rilasciando questo libro libero stanno facendo, ancora una volta, un magnifico servizio alla comunità Debian.
ja_jp: あなたの手元にあるこの本は違います。この本は <emphasis>free as in freedom</emphasis> な本です。つまりこの本の利用にはデジタルライフのあらゆる側面で Debian の標準的なフリーダムに従うことが求められています。とても長い間、この本のような本が少ないことが Debian の重大な欠点でした。これは、Debian とその価値を広く伝え、同時にそれらの価値を具体化してそれらの利点をはっきりさせるための読み物が少なかったことを意味しています。しかし皮肉なことに、これはまた Debian それ自身の一部として配布することができる読み物が少なかったことも意味しています。この本は初めてその欠点に取り組んだ信頼できる本です。あなたはこの本を <command>apt-get install</command> したり、再配布したりできます。さらに将来他の人があなたの貢献の恩恵を受けることができるように、フォークして改善し、バグレポートやパッチを投稿することもできるのです。この本の「メンテナ」(著者でもあります) は Debian プロジェクトにメンバーとして長い間かかわっています。彼らは Debian のすべての側面に浸透しているフリーダムの精神に共感し、Debian の重要な部分に関する責任を負うことがどのような意味を持っているかを直接的に知っています。このようなフリーな本をリリースすることによって、彼らは Debian コミュニティに素晴らしい貢献をしているのです。
ru_ru: Книга, которую вы держите в руках, иная. Это <emphasis>свободная</emphasis> книга, книга, соответствующая стандартам свободы Debian для всех проявлений вашей цифровой жизни. На протяжении долгого времени нехватка книг, подобных этой, была существенным недостатком Debian. Это означало, чбыло мало письменных материалов, помогающих распространению Debian и его ценностей, и в то же время воплощающих эти ценности и демонстрирующих их преимущества. И, как ни парадоксально, это также означало, что у нас было мало таких материалов, которые мы могли распространять как часть Debian. Это первое авторитетное издание, устраняющее этот изъян. Вы можете установить эту книгу с помощью <command>apt-get install</command>, вы можете распространять её, вы можете создавать ответвления этой книги или, лучше, отправлять сообщения об ошибках и заплаты для неё, так что другие в будущем могут получить пользу от вашего вклада. «Сопровождающие» этой книги — и по совместительству её авторы — давние участники Проекта Debian, глубоко чувствующие дух свободы, пронизывающий каждую составляющую Debian, и знающие не понаслышке, что значит нести ответственность за важные части Debian. Выпуская эту книгу, они служат ещё одну, столь прекрасную, службу сообществу Debian.

source: We hope you will enjoy this cornerstone of Debian reading Freedom as much as we did.
it_it: Speriamo che vi godrete questa pietra miliare della libertà di lettura in Debian tanto quanto abbiamo fatto noi.
ja_jp: この Debian に関するフリーな読み物の基礎が皆さんにとって楽しいものであることを強く望んでいます。
ru_ru: Надеемся, вы получите не меньшее удовольствие от этого краеугольного камня Свободы чтения Debian, чем мы.

source: November 2013
it_it: Novembre 2013
ja_jp: 2013 年 11 月
ru_ru: Ноябрь 2013

source: Stefano Zacchiroli (Debian Project Leader 2010-2013) and Lucas Nussbaum (Debian Project Leader 2013-incumbent)
it_it: Stefano Zacchiroli (Debian Project Leader 2010-2013) e Lucas Nussbaum (Debian Project Leader 2013-oggi)
ja_jp: Stefano Zacchiroli (Debian プロジェクトリーダー 2010-2013) と Lucas Nussbaum (Debian プロジェクトリーダー 2013-現職)
ru_ru: Стефано Закироли (Лидер Проекта Debian в 2010-2013) и Лукас Нуссбаум (Лидер Проекта Debian с 2013 по настоящее время)
