Repository: binary-com/mobile
Catalog: */00a_preface.po
Languages: it_it, ja_jp, ru_ru

source: Preface
it_it: Prefazione
ja_jp: 序文
ru_ru: Предисловие

source: Debian is a very successful operating system, which is pervasive in our digital lives more than people often imagine or are aware of. A few data points will suffice to make this clear. At the time of writing Debian is the most popular GNU/Linux variant among web servers: according to <ulink url="http://w3techs.com/">W3Techs</ulink>, more than 10% of the web is Debian-powered. Think about it: how many web sites would have you missed today without Debian? Onto more fascinating deployments, Debian is the operating system of choice on the International Space Station. Have you been following the work of ISS astronauts, maybe via the social network presence of NASA or other international organizations? Both the work in itself and the posts about it have been made possible by Debian. Countless companies, universities, and public administrations rely on Debian daily for their operations, delivering services to millions of users around the world... and its orbit!
it_it: Debian è un sistema operativo di grande successo, la cui presenza nella vita digitale di ognuno di noi è maggiore di quanto spesso ci si immagini o si conosca. Per chiarire questo punto basta dire alcuni dati. Al momento della stesura di questo documento Debian è la variante GNU/Linux più popolare tra i server web: secondo <ulink url="http://w3techs.com/">W3Techs</ulink>, più del 10% del web è basato su Debian. Pensiamo a questo: quanti siti web oggi ci saremmo persi senza Debian? Riguardo utilizzi più affascinanti, Debian è il sistema operativo prescelto nella Stazione Spaziale Internazionale (ISS). Avete seguito il lavoro degli astronauti dell'ISS, magari attraverso la presenza della NASA o di qualche altra organizzazione internazionale nei social network? Sia il lavoro stesso, sia la sua comunicazione sono stati resi possibili da Debian. Innumerevoli aziende, università e amministrazioni pubbliche si basano su Debian per il loro funzionamento quotidiano, fornendo servizi a milioni di utenti in tutto il mondo... e nella sua orbita!
ja_jp: Debian は大きな成功を収めたオペレーティングシステムで、人々が想像したり気付いているよりも広くデジタルライフの至る所に浸透しています。これを明らかにするためにいくつかの例を挙げてみましょう。本書の執筆時点では、Debian は web サーバ用途で最も人気のある GNU/Linux 派生物です: <ulink url="http://w3techs.com/">W3Techs</ulink> によれば、10% を超える web サーバが Debian で運用されています。考えてみてください: 今もし Debian が無かったら、いくつの web サイトが無くなってしまうのでしょうか? より興味深い展開として、Debian は 国際宇宙ステーションで使われるオペレーティングシステムに選ばれています。ソーシャルネットワークにある NASA や他の国際的組織のアカウントなどを通して、国際宇宙ステーションの宇宙飛行士の仕事に注目したことがありますか? Debian を使うことで彼らは業務を遂行したり、業務に関して投稿したりすることが可能になっています。数え切れないほど多くの企業、大学、行政機関は、業務を遂行したり世界中と軌道上にいる何百万のユーザに対するサービスを供給するために、日常的に Debian を利用しています。
ru_ru: Debian — очень успешная операционная система, участвующая в нашей цифровой жизни в гораздо большей степени, чем многие часто предполагают или знают. На момент написания Debian — самый популярный вариант GNU/Linux на серверах: согласно <ulink url="http://w3techs.com/">W3Techs</ulink>, более 10% всемирной паутины работает на Debian. Задумайтесь об этом: скольких веб-сайтов вы бы недосчитались сегодня без Debian? Среди наиболее впечатляющих применений — использование Debian на Международной Космической Станции. ССледили ли вы за работой астронавтов на МКС, скажем через статус в социальной сети NASA или других международных организаций? И сама работа, и сообщения о ней возможны благодаря Debian. Бесчисленные компании, университеты и государственные учреждения полагаются на Debian в своей повседневной работе, доставляя услуги миллионам пользователей по всему миру... и даже на орбиту!

source: But Debian is much more than an operating system, no matter how complex, featureful, and reliable such a system could be. Debian is a vision of the freedoms that people should enjoy in a world where more and more of our daily activities depend on software. Debian is born from the cardinal Free Software idea that people should be in control of their computers, and not the other way around. People with enough software knowledge should be able to dismantle, modify, reassemble and share with others all the software that matters to them. It doesn't matter if the software is used for frivolous activities like posting pictures of kittens on the Web, or for potentially life-threatening tasks such as driving our cars and powering the medical devices which cure us; you should control it. People without in-depth software knowledge, them too, should enjoy those freedom: they should be put in condition to delegate to people of their choice, people they trust, the audit or modification of software-based devices on their behalf.
it_it: Debian è però molto di più di un sistema operativo, per quanto complesso, ricco di funzionalità e affidabile possa essere. Debian è un'immagine delle libertà di cui le persone dovrebbero godere in un mondo in cui sempre più attività quotidiane dipendono dal software. Debian è nata dall'idea cardine del software libero che le persone dovrebbero essere al comando dei propri computer e non viceversa. Le persone con sufficienti conoscenze informatiche dovrebbero essere in grado di smontare, modificare, riassemblare e condividere con altri tutto il software a cui sono interessati. Non importa se il software viene usato per attività frivole come l'invio di fotografie di gattini sul Web o per compiti potenzialmente con importanza letteralmente vitale come guidare le automobili e far funzionare i dispositivi medici che ci curano; l'utente dovrebbe controllarlo. Anche le persone senza conoscenze informatiche approfondite dovrebbero godere di queste libertà: dovrebbero essere messe in condizione di delegare ad altre persone di loro scelta, persone fidate, il controllo o la modifica per conto loro dei dispositivi basati su software.
ja_jp: Debian は複雑で多機能で高い信頼性を要求するシステムのオペレーティングシステムですが、それだけではありません。Debian は、日常生活においてソフトウェアに対する依存度がどんどん高まっているこの世界で人々はソフトウェアを自由に選択できるようになるべきである、という構想を持っています。Debian は、人々は自分のコンピュータを己の支配下におくべきでありコンピュータに支配されるべきではない、という基本的なフリーソフトウェア構想から生まれました。ソフトウェアに関して十分な知識を持っている人々は、彼らにとって重要な全てのソフトウェアを分解、改変、再構築してそれらを他の人と共有するべきです。ソフトウェアが、子猫の写真を Web に投稿するような取るに足らない作業に使われているかどうか、車の制御や治療に使われる医療機器への電力供給などの潜在的に命にかかわるような目的に使われているかどうか、それは重要ではないのです。ソフトウェアに関して深い知識を持っていない人々も同じで、彼らもまたソフトウェアを自由に選択するべきです: そのような人々は自分たちの代わりに、ソフトウェアによって制御される機器の監査や改良を、自分たちが選んだ信頼できる人に委託するべきです。
ru_ru: Но Debian — гораздо больше, чем операционная система, какой бы сложной, многофункциональной и надёжной ни могла быть такая система. Debian — это виˊдение свобод, которыми должны быть наделены люди в мире, где всё больше и больше наших повседневных занятий зависят от программного обеспечения. Debian родился из главной идеи Свободного Программного Обеспечения, что люди должны контролировать свои компьютеры, а не наоборот. Люди, достаточно разбирающиеся в программном обеспечении, должны иметь возможность разобрать по винтикам, модифицировать, собрать заново и поделиться с другими всем программным обеспечением, которое важно для них. Не важно, используется программное обеспечение для пустяковых занятий вроде публикации фотографий с котятами в сети или для задач, от которых могут зависеть жизни людей, таких как управление нашими автомобилями или обеспечение работы медицинских приборов, лечащих нас; вы должны контролировать его. Луди без глубоких познаний в программном обеспечении также должны обладать этой свободой: им следует обеспечить право уполномочить выбранных ими людей, которым они доверяют, произвести аудит или модификацию программируемых устройств в своих интересах.

source: In the quest for the control of people over machines, Free operating systems play a fundamental role: you cannot be in full control of a computer device if you do not control its operating system. This is where Debian's main ambition comes from: producing the best, entirely Free operating system. For more than 20 years now, Debian has both developed a Free operating system and promoted a vision of Free Software around it. In so doing, Debian has set a very high bar for software freedom advocates around the world. Debian's decisions on matters of software licensing, for example, are routinely looked up to by international standard organizations, governments, and other Free Software projects, when deciding if something should be considered “free enough” or not.
it_it: Nella ricerca del controllo delle persone sulle macchine, i sistemi operativi liberi giocano un ruolo fondamentale: non si può avere il pieno controllo su un computer se non si ha il controllo del suo sistema operativo. È da qui che deriva la principale ambizione di Debian: produrre il migliore sistema operativo interamente libero. Da oltre 20 anni Debian ha sia sviluppato un sistema operativo libero, sia promosso intorno ad esso una visione del software libero. Nel fare ciò, Debian ha creato uno standard di riferimento molto alto per i sostenitori della libertà del software di tutto il mondo. Le decisioni di Debian su questioni che riguardano le licenze del software, ad esempio, vengono costantemente prese a riferimento da organizzazioni internazionali per gli standard, governi e altri progetti di software libero quando si stratta di decidere se qualcosa debba essere considerato «abbastanza libero» o no.
ja_jp: 人々がマシンを掌握できるようにする上で、オペレーティングシステムがフリーであることは根本的な役割を担っています: コンピュータデバイスを完全に掌握するには、オペレーティングシステムを掌握しなければいけません。最高で完全にフリーなオペレーティングシステムを作成するという Debian の中心的な目標はここから来ています。20 年以上もの間、Debian はフリーオペレーティングシステムを開発し、周囲のフリーソフトウェア構想を推進してきました。その際に Debian は世界中のソフトウェアフリーダム支持者に対して非常に高いハードルを設定し続けています。例えば、国際的標準機構、政府、その他のフリーソフトウェアプロジェクトがあるものを「十分にフリー」と考えるべきか否かを決定する際には、ソフトウェア使用許諾に関する Debian の決定を基準にしています。
ru_ru: В постоянном стремлении к контролю человека над машинами Свободные операционные системы играют фундаментальную роль: вы не можете полностью контролировать вычислительное устройство, если вы не контролируете его операционную систему. Отсюда главное стремление Debian — сделать лучшую, полностью Свободную операционную систему. Уже больше 20 лет Debian не только разрабатывает Свободную операционную систему, но и продвигает сопутствующие идеи Свободного Программного Обеспечения. В этом процессе Debian установил очень высокую планку для сторонников свободы ПО во всём мире. Решения Debian по вопросам лицензирования программного обеспечения, например, регулярно просматриваются международными организациями по стандартизации, правительствами и другими Свободными Программными проектами при принятии решения, является ли нечто «достаточно свободным».

source: But this political vision is not yet enough to explain Debian's uniqueness. Debian is also a very peculiar social experiment, strongly attached to its independence. Think for a moment of other mainstream Free Software distributions, or even of popular <emphasis>proprietary</emphasis> operating systems. Chances are that you can associate each of them with a large company that is either the main development force behind the project, or at the very least the steward of all its non-development activities. Debian is different. Within the Debian Project volunteers pick on themselves the responsibilities of all the activities that are needed to keep Debian alive and kicking. The variety of those activities is stunning: from translations to system administration, from marketing to management, from conference organization to artwork design, from bookkeeping to legal issues, ... not to mention software packaging and development! Debian contributors take care of all of these.
it_it: Ma questa visione politica non è ancora sufficiente a spiegare l'unicità di Debian. Debian è anche un esperimento sociale molto particolare, fortemente attaccato alla propria indipendenza. Pensiamo per un momento alle altre popolari distribuzioni di software libero, o anche a popolari sistemi operativi <emphasis>proprietari</emphasis>. Probabilmente si può riuscire ad associare ciascuno di essi con una grande azienda che è la forza principale dietro lo sviluppo del progetto o, come minimo, la guida di tutte le sue attività non di sviluppo. Debian è differente. All'interno del progetto Debian dei volontari si assumono la responsabilità di tutte le attività che sono richieste per mantenere Debian viva e vegeta. La varietà di queste attività è impressionante: dalle traduzioni all'amministrazione dei sistemi, dal marketing alla gestione, dall'organizzazione di conferenze alla creazione di grafica artistica, dalla contabilità ai problemi legali, ... per non parlare dalla pacchettizzazione e dello sviluppo di software! Coloro che contribuiscono a Debian si occupano di tutto questo.
ja_jp: しかしこの政治的な観点は Debian の独自性を説明するのには十分ではありません。Debian はその独立性に強く付随する非常に独特な社会実験でもあります。他の主要なフリーソフトウェアディストリビューションや人気のある<emphasis>プロプライエタリ</emphasis>オペレーティングシステムについてちょっと考えてみましょう。おそらくそれらは、プロジェクトの裏で開発を主に推し進めているかまたは控え目に言っても開発に無関係の全ての活動を請け負っている大企業と結びつけることができるでしょう。Debian は違います。Debian プロジェクトでは、ボランティアは自分自身に Debian が維持され素晴らしいものであり続けるために必要な全ての活動に対する責任を課しています。ボランティア活動の範囲は驚くほど広いものです: 翻訳からシステム管理、マーケティングから経営、カンファレンス組織からアートワークデザイン、簿記から法的問題、ソフトウェアのパッケージ化と開発はいうまでもありません! Debian 開発者はこれら全ての面倒を見ているのです。
ru_ru: Но этой политической точки зрения недостаточно, чтобы объяснить всю уникальность Debian. Debian — это ещё и очень своеобразный социальный эксперимент, строго привязанный к своей независимости. Задумайтесь на момент о других ведущих дистрибутивах Свободного Программного Обеспечения, или даже о популярных <emphasis>собственнических</emphasis> операционных системах. Скорее всего каждый из них ассоциируется у вас с большой компанией, или являющейся основной силой разработки, стоящей за проектом, или по крайней мере управляющей всеми не относящимися к разработке делами. Не таков Debian. Внутри проекта Debian добровольцы сами берут на себя обязанности по всем направлениям, необходимым для поддержания Debian живым и здоровым. Разнообразие этих направлений ошеломляюще: от переводов до системного администрирования, от маркетинга до руководства, от организации конференций до графического дизайна, от бухгалтерии до юридических вопросов, ... не говоря об упаковке программ и разработке! Участники Debian заботятся обо всём этом.

source: As a first consequence of this radical form of independence, Debian needs and relies on a very diverse community of volunteers. Any skill in any of the above areas, or others you can imagine, can be invested into Debian and will be used to improve the project. A second consequence of Debian independence is that Debian's choices can be trusted not to be driven by the commercial interests of specific companies — interests that we have no guarantee will always be aligned with the goal of promoting people's control over machines, as too many recent examples in the tech news testify.
it_it: Come prima conseguenza di questa forma radicale di indipendenza, Debian ha bisogno e si basa su una comunità molto eterogenea di volontari. Qualsiasi competenza in una qualsiasi delle aree elencate, o in ogni altra che si possa immaginare, può essere investita in Debian e verrà usata per migliorare il progetto. Una seconda conseguenza dell'indipendenza di Debian è che si può stare certi che le scelte di Debian non siano guidate da interessi commerciali di specifiche aziende: interessi per i quali non c'è alcuna garanzia che siano allineati con l'obiettivo di promuovere il controllo delle persone sulle macchine, come testimoniano troppi esempi recenti nelle notizie che riguardano il mondo tecnologico.
ja_jp: 独立性を徹底的に守ることがもたらす 1 番目の結果は、Debian は非常に多様なボランティアコミュニティを必要としておりそれに依存しているということです。上に挙げたりスキルや考えられうるスキルを使って Debian に貢献したり、プロジェクトを改善することができるでしょう。Debian の独立性がもたらす 2 番目の結果は、Debian の方向性は特定企業の商業的興味によって決定されたものではないことが保障されているということです。テクニカルニュースによって検証された数多くの最近の例の通り、Debian の興味は何も保証されておらず、その興味は常に人々がマシンを掌握できるという目標に向けられています。
ru_ru: Как первое следствие этой крайней формы независимости, Debian полагается на очень разнородное сообщество добровольцев и зависит от него. Любые способности в любой из вышеперечисленных областей или других, какие вы только можете себе представить, могут найти приложение в Debian и будут использованы для улучшения проекта. Второе следствие из независимости Debian заключается в том, что решения Debian наверняка не будут зависеть от коммерческих интересов каких-то компаний — интересов, которые не обязательно всегда будут совпадать с целью поддержки контроля людей над машинами, что подтверждается множеством недавних примеров из технических новостей.

source: One last aspect contributes to Debian's uniqueness: the way in which the social experiment is run. Despite the folklore of being bureaucratic, decision making in Debian is in fact highly unstructured, almost anarchic. There exist clearly defined areas of responsibility within the project. People in charge of those areas are free to drive their own boat. As long as they keep up with the quality requirements agreed upon by the community, no one can tell them what to do or how to do their job. If you want to have a say on how something is done in Debian, you need to put yourself on the line and be ready to take the job on your shoulders. This peculiar form of meritocracy — which we sometimes call <emphasis>do-ocracy</emphasis> — is very empowering for contributors. Anyone with enough skills, time, and motivation can have a real impact on the direction the project is taking. This is testified by a population of about 1 000 official members of the Debian Project, and several thousands of contributors world-wide. It is no wonder that Debian is often credited as the largest community-driven Free Software project in existence.
it_it: Un ultimo aspetto contribuisce all'unicità di Debian: il modo in cui viene condotto questo esperimento sociale. Nonostante il folclore che lo descrive come pieno di burocrazia, il processo decisionale in Debian è di fatto altamente non strutturato, quasi anarchico. Esistono aree di responsabilità chiaramente definite all'interno del progetto. Le persone a capo di queste aree sono libere di guidarle come credono. Fintanto che mantengono i requisiti di qualità condivisi dalla comunità, nessuno può dire loro cosa fare o come fare il proprio lavoro. Se si vuole avere voce in capitolo su come qualcosa viene fatto in Debian, è necessario mettersi in gioco ed essere pronti a farsi carico del lavoro da fare. Questa particolare forma di meritocrazia, che a volte chiamiamo <emphasis>democrazia del fare</emphasis>, dà un grande potere ai contributori. Chiunque abbia abbastanza capacità, tempo e motivazione può avere un impatto reale sulla direzione presa dal progetto. Ciò è testimoniato da una popolazione di circa 1000 membri ufficiali del progetto Debian e da diverse migliaia di contributori in tutto il mondo. Non meraviglia il fatto che Debian venga spesso considerata come il più grande progetto di software libero esistente guidato da una comunità.
ja_jp: Debian の独自性に対する貢献の最後の側面: どのようにして社会的実験が行われているか。お役所的だと伝えられているにもかかわらず、実際のところは Debian の意思決定は全く体系化されておらず、ほとんど無秩序といえます。プロジェクトにおける責任の範囲は明確に定義されています。責任者は自身の責任が及ぶ範囲で自由に仕事を行うことができます。責任者はコミュニティが取り決める品質保証を守っている限り、責任者は仕事の内容ややり方に文句を言われることはありません。もしあなたが Debian のやり方に口を出したいのなら、あなた自身が主導して仕事を引き受ける心構えがなければいけません。このような能力主義の特異な形、時折これは <emphasis>do-ocracy</emphasis> と呼ばれます、は貢献者に強い力を与えます。十分な能力、時間、意欲を持っている人は誰でも、プロジェクトの方向性に大きな影響を及ぼすことができるのです。Debian プロジェクトに参加している千人あまりの公式メンバーと世界中の数千の貢献者がこの点について証言しています。Debian が存在する内で最大のコミュニティ主導フリーソフトウェアプロジェクトと認められているのも少しも不思議なことではないのです。
ru_ru: Последнее проявление уникальности Debian — способ осуществления социального эксперимента. Вопреки мифу о бюрократизированности, решения в Debian принимаются фактически бессистемно, почти анархически. Внутри проекта чётко определены области ответственности. Люди, занятые в этих областях, вольны сами рулить своим кораблём. До тех пор, пока они соответствуют требованиям качества, принятым в сообществе, никто не может указывать им, что делать или как выполнять их работу. Если вы хотите высказаться по поводу того, как что-то сделано в Debian, вам нужно лечь на рельсы и быть готовым взвалить работу на свои плечи. Эта своеобразная форма меритократии — которую мы иногда называем <emphasis>делократией</emphasis> — наделяет участников большими правами. Любой, обладающий достаточными способностями, временем и мотивацией, может оказать влияние на путь развития проекта. Свидетели тому — контингент из примерно 1 000 официальных членов Проекта Debian и несколько тысяч участников во всём мире. Неудивительно, что Debian часто называют крупнейшим из существующих проектов Свободного ПО, управляемых сообществом.
