Repository: binary-com/mobile
Catalog: */00b_foreword.po
Languages: it_it, ru_ru

source: Special thanks to those who opted to give 25€ more than the value of their reward. Your faith in this project is highly appreciated. Thank you Adrien Guionie, Adrien Ollier, Adrien Roger, Agileo Automation, Alban Duval, Alex Viala, Alexandre Dupas, Alexandre Roman, Alexis Bienvenüe, Anthony Renoux, Aurélien Beaujean, Baptiste Darthenay, Basile Deplante, Benjamin Cama, Benjamin Guillaume, Benoit Duchene, Benoît Sibaud, Bornet, Brett Ellis, Brice Sevat, Bruno Le Goff, Bruno Marmier, Cédric Briner, Cédric Charlet, Cédrik Bernard, Celia Redondo, Cengiz Ünlü, Charles Flèche, Christian Bayle, Christophe Antoine, Christophe Bliard, Christophe Carré, Christophe De Saint Leger, Christophe Perrot, Christophe Robert, Christophe Schockaert, Damien Escoffier, David Dellier, David Trolle, Davy Hubert, Decio Valeri, Denis Marcq, Denis Soriano, Didier Hénaux, Dirk Linnerkamp, Edouard Postel, Eric Coquard, Eric Lemesre, Eric Parthuisot, Eric Vernichon, Érik Le Blanc, Fabian Culot, Fabien Givors, Florent Bories, Florent Machen, Florestan Fournier, Florian Dumas, François Ducrocq, Francois Lepoittevin, François-Régis Vuillemin, Frédéric Boiteux, Frédéric Guélen, Frédéric Keigler, Frédéric Lietart, Gabriel Moreau, Gian-Maria Daffré, Grégory Lèche, Grégory Valentin, Guillaume Boulaton, Guillaume Chevillot, Guillaume Delvit, Guillaume Michon, Hervé Guimbretiere, Iván Alemán, Jacques Bompas, Jannine Koch, Jean-Baptiste Roulier, Jean-Christophe Becquet, Jean-François Bilger, Jean-Michel Grare, Jean-Sébastien Lebacq, Jérôme Ballot, Jerome Pellois, Johan Roussel, Jonathan Gallon, Joris Dedieu, Julien Gilles, Julien Groselle, Kevin Messer, Laurent Espitallier, Laurent Fuentes, Le Goût Du Libre, Ludovic Poux, Marc Gasnot, Marc Verprat, Marc-Henri Primault, Martin Bourdoiseau, Mathieu Chapounet, Mathieu Emering, Matthieu Joly, Melvyn Leroy, Michel Casabona, Michel Kapel, Mickael Tonneau, Mikaël Marcaud, Nicolas Bertaina, Nicolas Bonnet, Nicolas Dandrimont, Nicolas Dick, Nicolas Hicher, Nicolas Karolak, Nicolas Schont, Olivier Gosset, Olivier Langella, Patrick Francelle, Patrick Nomblot, Philippe Gaillard, Philippe Le Naour, Philippe Martin, Philippe Moniez, Philippe Teuwen, Pierre Brun, Pierre Gambarotto, Pierre-Dominique Perrier, Quentin Fait, Raphaël Enrici — Root 42, Rémi Vanicat, Rhydwen Volsik, RyXéo SARL, Samuel Boulier, Sandrine D'hooge, Sébasiten Piguet, Sébastien Bollingh, Sébastien Kalt, Sébastien Lardière, Sébastien Poher, Sébastien Prosper, Sébastien Raison, Simon Folco, Société Téïcée, Stéphane Leibovitsch, Stéphane Paillet, Steve-David Marguet, Sylvain Desveaux, Tamatoa Davio, Thibault Taillandier, Thibaut Girka, Thibaut Poullain, Thierry Jaouen, Thomas Etcheverria, Thomas Vidal, Thomas Vincent, Vincent Avez, Vincent Merlet, Xavier Alt, Xavier Bensemhoun, Xavier Devlamynck, Xavier Guillot, Xavier Jacquelin, Xavier Neys, Yannick Britis, Yannick Guérin, and Yves Martin.
it_it: Un ringraziamento speciale a chi ha scelto di dare 25 € in più del valore della ricompensa ottenuta. La vostra fede in questo progetto è molto apprezzata. Grazie a Adrien Guionie, Adrien Ollier, Adrien Roger, Agileo Automation, Alban Duval, Alex Viala, Alexandre Dupas, Alexandre Roman, Alexis Bienvenüe, Anthony Renoux, Aurélien Beaujean, Baptiste Darthenay, Basile Deplante, Benjamin Cama, Benjamin Guillaume, Benoit Duchene, Benoît Sibaud, Bornet, Brett Ellis, Brice Sevat, Bruno Le Goff, Bruno Marmier, Cédric Briner, Cédric Charlet, Cédrik Bernard, Celia Redondo, Cengiz Ünlü, Charles Flèche, Christian Bayle, Christophe Antoine, Christophe Bliard, Christophe Carré, Christophe De Saint Leger, Christophe Perrot, Christophe Robert, Christophe Schockaert, Damien Escoffier, David Dellier, David Trolle, Davy Hubert, Decio Valeri, Denis Marcq, Denis Soriano, Didier Hénaux, Dirk Linnerkamp, Edouard Postel, Eric Coquard, Eric Lemesre, Eric Parthuisot, Eric Vernichon, Érik Le Blanc, Fabian Culot, Fabien Givors, Florent Bories, Florent Machen, Florestan Fournier, Florian Dumas, François Ducrocq, Francois Lepoittevin, François-Régis Vuillemin, Frédéric Boiteux, Frédéric Guélen, Frédéric Keigler, Frédéric Lietart, Gabriel Moreau, Gian-Maria Daffré, Grégory Lèche, Grégory Valentin, Guillaume Boulaton, Guillaume Chevillot, Guillaume Delvit, Guillaume Michon, Hervé Guimbretiere, Iván Alemán, Jacques Bompas, Jannine Koch, Jean-Baptiste Roulier, Jean-Christophe Becquet, Jean-François Bilger, Jean-Michel Grare, Jean-Sébastien Lebacq, Jérôme Ballot, Jerome Pellois, Johan Roussel, Jonathan Gallon, Joris Dedieu, Julien Gilles, Julien Groselle, Kevin Messer, Laurent Espitallier, Laurent Fuentes, Le Goût Du Libre, Ludovic Poux, Marc Gasnot, Marc Verprat, Marc-Henri Primault, Martin Bourdoiseau, Mathieu Chapounet, Mathieu Emering, Matthieu Joly, Melvyn Leroy, Michel Casabona, Michel Kapel, Mickael Tonneau, Mikaël Marcaud, Nicolas Bertaina, Nicolas Bonnet, Nicolas Dandrimont, Nicolas Dick, Nicolas Hicher, Nicolas Karolak, Nicolas Schont, Olivier Gosset, Olivier Langella, Patrick Francelle, Patrick Nomblot, Philippe Gaillard, Philippe Le Naour, Philippe Martin, Philippe Moniez, Philippe Teuwen, Pierre Brun, Pierre Gambarotto, Pierre-Dominique Perrier, Quentin Fait, Raphaël Enrici — Root 42, Rémi Vanicat, Rhydwen Volsik, RyXéo SARL, Samuel Boulier, Sandrine D'hooge, Sébasiten Piguet, Sébastien Bollingh, Sébastien Kalt, Sébastien Lardière, Sébastien Poher, Sébastien Prosper, Sébastien Raison, Simon Folco, Société Téïcée, Stéphane Leibovitsch, Stéphane Paillet, Steve-David Marguet, Sylvain Desveaux, Tamatoa Davio, Thibault Taillandier, Thibaut Girka, Thibaut Poullain, Thierry Jaouen, Thomas Etcheverria, Thomas Vidal, Thomas Vincent, Vincent Avez, Vincent Merlet, Xavier Alt, Xavier Bensemhoun, Xavier Devlamynck, Xavier Guillot, Xavier Jacquelin, Xavier Neys, Yannick Britis, Yannick Guérin e Yves Martin.
ru_ru: Особая благодарность тем, кто заплатил на 25 евро больше стоимости их вознаграждения. Мы высоко ценим вашу веру в этот проект. Спасибо вам, Адриен Жиони, Адриен Олие, Адриен Роже, Ажиле Атомасьон, Альбан Дюваль, Алекс Виала, Александр Дюпа, Александр Рома, Алексис Бенвеню, Антони Рену, Орельен Божен, Батист Дартена, Базиль Деплан, Бенжамин Кама, Бенжамин Гийом, Бенуа Дюшен, Бенуа Сибо, Борне, Брет Эллис, Бри Сева, Бруно Ле Гоф, Бруно Мармье, Седрик Брине, Седрик Шарле, Седрик Бернар, Сель Редондо, Ченгиз Унлу, Шарль Флеш, Кристиан Бейль, Кристоф Антуан, Кристоф Блиард, Кристоф Карре, Кристоф Де Сен Лежер, Кристоф Перро, Кристоф Робер, Кристоф Шокер, Дамьен Эскофье, Давид Делье, Давид Тролле, Дави Хабер, Десьо Валери, Дени Марк, Дени Сорьано, Дидье Хено, Дирк Линнеркамп, Эдуард Постель, Эрик Кокар, Эрик Лемеср, Эрик Партисо, Эрик Вернишо, Эрик Ле Блан, Фабьен Кюло, Фабьен Живор, Флорен Борье, Флорен Машен, Флорестан Фурнье, Флориан Дюма, Франсуа Дюрок, Франсуа Лепоттеви, Франсуа-Режи Вюллеми, Фредерик Бото, Фредерик Желен, Фредерик Кегле, Фредерик Летар, Габриэль Моро, Жан-Мари Даффре, Грегори Леш, Грегори Валентин, Гийом Булятон, Гийом Шевило, Гийом Дельви, Гийом Мишо, Эрве Гимбертьер, Иван Алеман, Жак Бомпа, Жанин Кох, Жан-Батист Рулье, Жан-Кристоф Беке, Жан-Франсуа Бильже, Жан-Мишель Грар, Жан-Себастьян Лебак, Жером Балло, Жером Пеллуа, Йохан Руссе, Джонатан Галло, Жори Дедье, Жюльен Жиль, Жюльен Грассель, Кевин Мессер, Лоран Эспиталье, Лоран Фонте, Le Goût Du Libre, Людовик По, Марк Гасно, Марк Верпра, Марк-Генри Примо, Мартин Бурдуасо, Матье Шапуне, Матье Эмерин, Матье Жоли, Мелвин Лерой, Мишель Касабона, Мишель Капель, Микаэль Тонно, Микаэл Марко, Николя Бертен, Николя Бонне, Николя Дандримо, Николя Дик, Николя Ише, Николя Каролак, Николя Шон, Оливье Госсе, Оливье Лангеля, Патрик Франсель, Патрик Номбло, Филипп Жиляр, Филипп Ле Но, Филипп Мартен, Филипп Монье, Филипп Туве, Пьер Брюн, Пьер Гамбаротто, Пьер-Доминик Перье, Квентин Файт, Рафаэль Энрики — Root 42, Реми Ванисе, Ридвен Вольсик, RyXéo SARL, Самюэль Булье, Сандрин Д'уг, Себастьен Пижо, Себастьен Болин, Себастьен Каль, Себастьен Лардье, Себастьен Поэ, Себастьен Проспер, Себастьен Резо, Симон Фолько, Société Téïcée, Стефан Лейбовиц, Стефан Пило, Стив-Давид Марго, Сильвен Дюсо, Таматоа Давио, Тибольт Теландье, Тибо Гирка, Тибо Пулен, Тьери Жоэн, Тома Эчеверриа, Тома Видаль, Тома Винсент, Винсент Аве, Винсент Мерле, Ксавье Аль, Ксавье Бенсему, Ксавье Девлямин, Ксавье Гийо, Ксавье Жаклин, Ксавье Ней, Янник Брити, Янник Гери и Ив Мартен.

source: Special Thanks to Contributors
it_it: Un ringraziamento speciale ai collaboratori
ru_ru: Особая благодарность участникам

source: This book would not be what it is without the contributions of several persons who each played an important role during the translation phase and beyond. We would like to thank Marilyne Brun, who helped us to translate the sample chapter and who worked with us to define some common translation rules. She also revised several chapters which were desperately in need of supplementary work. Thank you to Anthony Baldwin (of Baldwin Linguas) who translated several chapters for us.
it_it: Questo libro non sarebbe stato quello che è senza il contributo di diverse persone che hanno avuto un ruolo importante durante la fase di traduzione e oltre. Vorremmo ringraziare Marilyne Brun, che ci ha aiutato a tradurre il capitolo di esempio e ha lavorato con noi per definire alcune comuni regole di traduzione. Ha inoltre revisionato diversi capitoli che avevano un disperato bisogno di lavoro supplementare. Grazie ad Anthony Baldwin (di Baldwin Linguas) che ci ha tradotto diversi capitoli.
ru_ru: Эта книга не была бы именно такой без участия нескольких людей, каждый из которых играл очень важную роль на этапе перевода и не только. Мы хотели бы поблагодарить Мерилин Брун, которая помогала нам переводить пробную главу и работала с нами над общими правилами перевода. Она также корректировала несколько глав, которые крайне нуждались в дополнительной доработке. Спасибо Энтони Болдуину (из Baldwin Linguas), который перевёл несколько глав для нас.

source: We benefited from the generous help of proofreaders: Daniel Phillips, Gerold Rupprecht, Gordon Dey, Jacob Owens, and Tom Syroid. They each reviewed many chapters. Thank you very much!
it_it: Abbiamo beneficiato del generoso aiuto dei correttori di bozze: Daniel Phillips, Gerold Rupprecht, Gordon Dey, Jacob Owens e Tom Syroid. Ognuno di loro ha revisionato molti capitoli. Veramente grazie!
ru_ru: Мы так же благодарны нашим корректорам: Дениелу Филлипсу, Джеролду Рупрехту, Гордону Дею, Якобу Оуэнсу и Тому Сайройду. Каждый из них проверил множество глав. Спасибо вам большое!

source: Then, once the English version was liberated, of course we got plenty of feedback and suggestions and fixes from the readers, and even more from the many teams who undertook to translate this book into other languages. Thanks!
it_it: Poi, una volta liberata la versione inglese, abbiamo naturalmente ricevuto moltissimi riscontri, suggerimenti e correzioni dai lettori e ancora di più dai molti gruppi che hanno intrapreso il compito di tradurre questo libro in altre lingue. Grazie!
ru_ru: Далее, когда англоязычная версия была освобождена, мы, конечно, получили множество отзывов и предложений от читателей и, более того, от многих команд, взявших на себя перевод книги на другие языки. Спасибо!

source: We would also like to thank the readers of the French book who provided us some nice quotes to confirm that the book was really worth being translated: thank you Christian Perrier, David Bercot, Étienne Liétart, and Gilles Roussi. Stefano Zacchiroli — who was Debian Project Leader during the crowdfunding campaign — also deserves a big thank you, he kindly endorsed the project with a quote explaining that free (as in freedom) books were more than needed.
it_it: Vogliamo anche ringraziare i lettori della versione francese che con i loro commenti ci hanno confermato sarebbe veramente stato importante tradurlo in inglese: grazie a voi Christian Perrier, David Bercot, Étienne Liétart e Gilles Roussi. Stefano Zacchiroli, che era Project Leader di Debian durante la campagna di finanziamento, merita un grande ringraziamento, ha avallato il progetto con una dichiarazione spiegando come libri liberi (come in libertà) erano più che necessari.
ru_ru: Мы также хотели бы поблагодарить читателей французского издания, представивших положительные отзывы в подтверждение того, что книга действительно достойна быть переведённой: спасибо вам, Кристиан Перье, Девид Беркот, Этьен Литар и Жиль Русси. Стефано Закироли, бывший лидером проекта Debian во время кампании по сбору средств, также заслужил большой благодарности. Он любезно предоставил отзыв, в котором разъяснил, что свободные книги более чем необходимы.

source: If you have the pleasure to read these lines in a paperback copy of the book, then you should join us to thank Benoît Guillon, Jean-Côme Charpentier, and Sébastien Mengin who worked on the interior book design. Benoît is the upstream author of <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> — the tool we used to convert DocBook into LaTeX (and then PDF). Sébastien is the designer who created this nice book layout and Jean-Côme is the LaTeX expert who implemented it as a stylesheet usable with dblatex. Thank you guys for all the hard work!
it_it: Chi ha il piacere di leggere queste righe in una copia tascabile del libro, dovrebbe unirsi a noi per ringraziare Benoît Guillon, Jean-Côme Charpentier e Sébastien Mengin che hanno lavorato al design interno del libro. Benoît è l'autore di <ulink url="http://dblatex.sourceforge.net">dblatex</ulink>: lo strumento che ci ha permesso di convertire il testo in Latex (e poi in PDF). Sébastien è il designer che ha creato l'impaginazione di questo bel libro e Jean-Côme è l'esperto di LaTeX che la ha implementata come foglio di stile usabile con dblatex. Grazie ragazzi per tutto il duro lavoro!
ru_ru: Если вы имеете удовольствие читать эти строки в бумажной копии книги, то вам стоит прислединиться к нашим благодарностям Бенуа Гийьону, Жан-Кому Шарпентье и Себастьяну Менжену. Они работали над дизайном книги. Бенуа так же является автором <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> — инструмента для конвертирования DocBook в LaTeX (а затем в PDF). Себастьян — дизайнер, разработавший вёрстку книги, а Жан-Ком - эксперт LaTeX, воплотивший её в виде стилей, совместимых с dblatex. Спасибо вам, ребята, за ваш тяжёлый труд!

source: Finally, thank you to Thierry Stempfel for the nice pictures introducing each chapter, and thank you to Doru Patrascu for the beautiful book cover.
it_it: Infine, grazie a Thierry Stempfel per le belle immagini che introducono ogni capitolo e grazie a Doru Patrascu per la bellissima copertina.
ru_ru: Наконец, спасибо Тьерри Стемпфелю за прекрасные изображения перед началом каждой главы и Дору Патраску за великолепную обложку книги.

source: Personal Acknowledgments from Raphaël
it_it: Ringraziamenti personali di Raphaël
ru_ru: Персональные благодарности от Рафаэля

source: First off, I would like to thank Nat Makarévitch, who offered me the possibility to write this book and who provided strong guidance during the year it took to get it done. Thank you also to the fine team at Eyrolles, and Muriel Shan Sei Fan in particular. She has been very patient with me and I learned a lot with her.
it_it: Prima di tutto, vorrei ringraziare Nat Makarévitch, che mi ha offerto la possibilità di scrivere questo libro e mi ha guidato durante l'anno che è stato necessario per scriverlo. Grazie anche alla bella squadra di Eyrolles e a Muriel Shan Sei Fan in particolare che è stata molto paziente e mi ha insegnato molte cose.
ru_ru: Прежде всего я бы хотел поблагодарить Ната Макаревича, предоставившего мне возможность написать эту книгу и бывшего моим наставником в течение года, пока она не была закончена. Также спасибо отличной команде Eyrolles и Мюриэл Шан Сей Фан в частности. Она была очень терпеливой со мной, и я многому у неё научился.

source: The period of the Ulule campaigns were very demanding for me but I would like to thank everybody who helped to make them a success, and in particular the Ulule team who reacted very quickly to my many requests. Thank you also to everybody who promoted the operations. I don't have any exhaustive list (and if I had it would probably be too long) but I would like to thank a few people who were in touch with me: Joey-Elijah Sneddon and Benjamin Humphrey of OMG! Ubuntu, Florent Zara of LinuxFr.org, Manu of Korben.info, Frédéric Couchet of April.org, Jake Edge of Linux Weekly News, Clement Lefebvre of Linux Mint, Ladislav Bodnar of Distrowatch, Steve Kemp of Debian-Administration.org, Christian Pfeiffer Jensen of Debian-News.net, Artem Nosulchik of LinuxScrew.com, Stephan Ramoin of Gandi.net, Matthew Bloch of Bytemark.co.uk, the team at Divergence FM, Rikki Kite of Linux New Media, Jono Bacon, the marketing team at Eyrolles, and numerous others that I have forgotten (sorry about that).
it_it: Il periodo delle campagne Ulule per me è stato molto impegnativo, ma vorrei ringraziare tutti coloro che hanno contribuito a renderle un successo, in particolare il team di Ulule che ha reagito molto velocemente alle mie numerose richieste. Grazie anche a tutti coloro che hanno promosso l'operazione. Non ho un elenco completo (e se lo avessi probabilmente sarebbe troppo lungo), ma vorrei ringraziare alcune delle persone che erano in contatto con me: Joey-Elijah Sneddon e Benjamin Humphrey di OMG! Ubuntu, Florent Zara di LinuxFr.org, Manu di Korben.info, Frédéric Couchet di April.org, Jake Edge di Linux Weekly News, Clement Lefebvre di Linux Mint, Ladislav Bodnar di Distrowatch, Steve Kemp di Debian-Administration.org, Christian Pfeiffer Jensen di Debian-News.net, Artem Nosulchik di LinuxScrew.com, Stephan Ramoin di Gandi.net, Matthew Bloch di Bytemark.co.uk, il team a Divergence FM, Rikki Kite di Linux New Media, Jono Bacon, il team marketing di Eyrolles e molti altri che potrei aver dimenticato (scusatemi per questo).
ru_ru: Кампания на Ulule была очень тяжела для меня, но я хочу поблагодарить всех, кто помог ей прийти к успеху, и в частности команду Ulule, которая очень оперативно откликались на множество моих обращений. Также я хочу выразить благодарность всем, кто содействовал в этом проекте. У меня нет полного списка (а если бы и был, то он был бы невероятно длинным), но я хочу поблагодарить нескольких людей, которые контактировали со мной: Джоуи-Элийю Снеддон и Бенжамина Хамфри из OMG! Ubuntu, Флорана Зара из LinuxFr.org, Ману из Korben.info, Федерика Куше из April.org, Джейка Иджа из Linux Weekly News, Клемена Лефевра из Linux Mint, Ладислава Боднара из Distrowatch, Стива Кемпа из Debian-Administration.org, Кристиана Пфейфера Йенсена из Debian-News.net, Артёма Носульчика из LinuxScrew.com, Стефана Рамуана из Gandi.net, Меттью Блоха из Bytemark.co.uk, команду Divergence FM, Рикки Кайта из Linux New Media, Джоно Бэкона, рекламный отдел Eyrolles и всех остальных, кого я забыл (прошу прощения за это).

source: I would like to address a special thanks to Roland Mas, my co-author. We have been collaborating on this book since the start and he has always been up to the challenge. And I must say that completing the Debian Administrator's Handbook has been a lot of work…
it_it: Voglio indirizzare un ringraziamento speciale a Roland Mas, mio co-autore. Abbiamo collaborato a questo libro sin dall'inizio e lui è sempre stato all'altezza della sfida, devo anche dire che il completamento del Debian Administrator's Handbook ha comportato un sacco di lavoro…
ru_ru: Ещё я хотел бы выразить особую благодарность Ролану Ма, моему соавтору. Мы работали вместе над этой книгой с самого начала и он всегда был на высоте. И я должен сказать, что для написания Настольной книги администратора Debian было приложено немало усилий…

source: Last but not least, thank you to my wife, Sophie. She has been very supportive of my work on this book and on Debian in general. There have been too many days (and nights) when I left her alone with our 2 sons to make some progress on the book. I am grateful for her support and know how lucky I am to have her.
it_it: Ultimo, ma non meno importante grazie a mia moglie Sophie. Mi ha sostenuto molto nel lavoro a questo libro e a Debian in generale. L'ho lasciata sola troppi giorni (e notti) con i nostri 2 bimbi per portare avanti il lavoro sul libro. Le sono grato per il suo sostegno e so quanto sono fortunato di averla a mio fianco.
ru_ru: Последнее, но не менее важное: спасибо моей жене Софи. Она очень поддерживала меня в период работы над книгой и вообще в работе над Debian. Было слишком много дней (и ночей), когда мне приходилось оставлять её одну с нашими двумя сыновьями, чтобы немного поработать над книгой. Я очень признателен ей за поддержку. Мне повезло, что она у меня есть.

source: Personal Acknowledgments from Roland
it_it: Ringraziamenti personali di Roland
ru_ru: Персональные благодарности от Ролана

source: Well, Raphaël preempted most of my “external” thank-yous already. I am still going to emphasize my personal gratitude to the good folks at Eyrolles, with whom collaboration has always been pleasant and smooth. Hopefully the results of their excellent advice hasn't been lost in translation.
it_it: Beh, Raphaël ha già anticipato anche la maggior parte dei miei ringraziamenti «esterni». Vorrei comunque sottolineare la mia gratitudine al personale di Eyrolles con il quale la collaborazione è sempre stata piacevole e senza contrasti. Si spera che i risultati dei loro ottimi consigli non si siano persi nella traduzione.
ru_ru: Рафаэль уже успел поблагодарить многих людей с которыми работал и я. Но я всё же выражу мою персональную благодарность замечательным людям из Eyrolles, сотрудничать с которыми всегда было очень приятно. Надеюсь, их плоды их ценных советов не потерялись в процессе перевода.

source: I am extremely grateful to Raphaël for taking on the administrative part of this English edition. From organizing the funding campaign to the last details of the book layout, producing a translated book is so much more than just translating and proofreading, and Raphaël did (or delegated and supervised) it all. So thanks.
it_it: Sono estremamente grato a Raphaël per aver seguito la parte amministrativa di questa edizione inglese. Dall'aver organizzato la campagna di finanziamento agli ultimi dettagli dell'impaginazione del libro, produrre un libro tradotto è molto più di una semplice traduzione e correzione di bozze, e Raphaël ha fatto (o delegato e supervisionato) tutto. Quindi grazie.
ru_ru: Я безмерно благодарен Рафаэлю за принятие управленческой части выпуска английского издания на себя. От организации сбора денег до последних деталей вёрстки, выпуск переведённой книги — много больше, чем просто перевод и корректура, и Рафаэль делал это всё. Спасибо за это!

source: Thanks also to all who more or less directly contributed to this book, by providing clarifications or explanations, or translating advice. They are too many to mention, but most of them can usually be found on various #debian-* IRC channels.
it_it: Grazie anche a tutti coloro che più o meno direttamente hanno contribuito a questo libro, fornendo chiarimenti o spiegazioni e consigli sulla traduzione. Sono troppi da citare, ma la maggior parte di loro di solito può essere trovata nei diversi canali IRC #debian-*.
ru_ru: Также спасибо всем, кто в большей или меньшей степени помогал в работе над книгой уточнениями, разъяснениями или советом по переводу. Их очень много, но большинство из них можно найти на различных IRC каналах #debian-*
