Repository: binary-com/mobile
Catalog: */00b_foreword.po
Languages: it_it, ru_ru

source: There is of course some overlap with the previous set of people, but specific thanks are still in order for the people who actually do Debian. There wouldn't be much of a book without them, and I am still amazed at what the Debian project as a whole produces and makes available to any and all.
it_it: C'è una certa sovrapposizione con il precedente insieme di persone, ma un ringraziamento particolare va alle persone che contribuiscono effettivamente a Debian. Non ci sarebbe questo libro senza di loro, e sono ancora stupito di quello che il progetto Debian nel suo complesso mette a disposizione di tutti.
ru_ru: Конечно многие их этих людей уже были упомянуты ранее, но всё же особая благодарность тем, кто разрабатывает Debian. Без них не было бы этой книги, и я до сих пор изумляюсь, как проект Debian разрабатывается и доступен всем и каждому.

source: More personal thanks go to my friends and my clients, for their understanding when I was less responsive because I was working on this book, and also for their constant support, encouragement and egging on. You know who you are; thanks.
it_it: Un ringraziamento più personale va ai miei amici ed ai miei clienti, per la loro comprensione quando ero meno scattante alle loro richieste perché ero impegnato alla stesura di questo libro, e anche per il loro costante supporto e incoraggiamento. Voi sapete chi siete, grazie
ru_ru: Также персональные благодарности я выражаю всем моим друзьям и клиентам за их понимание, когда я был недостаточно отзывчив, потому что был занят работой над книгой, а также за их поддержку, воодушевление и подстрекание. Вы сами знаете, что это вы. Спасибо!

source: And finally; I am sure they would be surprised by being mentioned here, but I would like to extend my gratitude to Terry Pratchett, Jasper Fforde, Tom Holt, William Gibson, Neal Stephenson, and of course the late Douglas Adams. The countless hours I spent enjoying their books are directly responsible for my being able to take part in translating one first and writing new parts later.
it_it: E infine, sono sicuro che sarebbero sorpresi di essere menzionati qui, ma vorrei estendere la mia gratitudine a Terry Pratchett, Jasper Fforde, Tom Holt, William Gibson, Neal Stephenson e naturalmente al compianto Douglas Adams. Le innumerevoli ore che ho trascorso godendo dei loro libri sono direttamente responsabili per il mio essere in grado di prendere parte, prima, alla traduzione di un libro e, in seguito, alla scrittura di nuove parti.
ru_ru: И наконец — они наверняка удивятся, что упомянуты здесь, но я бы хотел распространить мои благодарности и на Терри Пратчета, Джаспера Ффорда, Тома Хольта, Уильяма Гибсона, Нила Стивенсона и, конечно же, покойного Дугласа Адамса. Благодаря бесчисленным часам, которые я провёл за чтением их книг, я стал способен принять участие сначала в переводе этой, а потом и в написании новых частей.
