Repository: binary-com/mobile
Catalog: */00b_foreword.po
Languages: it_it, ru_ru

source: <emphasis role="strong">Chapter 7</emphasis> will be an important parenthesis; it describes workflows to efficiently use documentation and to quickly gain an understanding of problems in order to solve them.
it_it: Il <emphasis role="strong">capitolo 7</emphasis> rappresenta un'importante parentesi, che descrive le modalità per utilizzare in modo efficiente la documentazione in modo da comprendere rapidamente i problemi incontrati e trovarne la soluzione.
ru_ru: <emphasis role="strong">Глава 7</emphasis> будет важной интермедией. В ней описаны процессы эффективной работы с документацией и быстрого понимания проблемы для её решения.

source: The next chapters will be a more detailed tour of the system, starting with basic infrastructure and services (<emphasis role="strong">chapters 8 to 10</emphasis>) and going progressively up the stack to reach the user applications in <emphasis>chapter 13</emphasis>. <emphasis role="strong">Chapter 12</emphasis> deals with more advanced subjects that will most directly concern administrators of large sets of computers (including servers), while <emphasis role="strong">chapter 14</emphasis> is a brief introduction to the wider subject of computer security and gives a few keys to avoid most problems.
it_it: I capitoli seguenti saranno un dettagliato tour del sistema, iniziando con la infrastruttura di base ed i servizi (<emphasis role="strong">capitoli da 8 a 10</emphasis>) avanzando fino a raggiungere le applicazioni utente, nel <emphasis>capitolo 13</emphasis>. Il <emphasis role="strong">capitolo 12</emphasis> si occupa di argomenti più avanzati che riguardano più direttamente gli amministratori di grandi insiemi di computer (tra cui i server), mentre il <emphasis role="strong">capitolo 14</emphasis> è una breve introduzione al tema più ampio della sicurezza informatica e fornisce alcune indicazioni per evitare la maggior parte di questo tipo di problemi.
ru_ru: В следующих главах будет более детальный обзор системы, начиная с базовой инфраструктуры и сервисов (<emphasis role="strong">главы с 8 по 10</emphasis>) и вверх по стеку вплоть до пользовательских приложений в <emphasis>главе 13</emphasis>. <emphasis role="strong">Глава 12</emphasis> описывает углублённые предметы, которые главным образом касаются администраторов большого количества компьютеров (включая серверы), а <emphasis role="strong">глава 14</emphasis> является кратким введением в более широкую тему компьютерной безопасности и указывает пути избежания основных проблем.

source: <emphasis role="strong">Chapter 15</emphasis> is for administrators who want to go further and create their own Debian packages.
it_it: Il <emphasis role="strong">capitolo 15</emphasis> è per quegli amministratori che voglio andare oltre e crearsi i propri pacchetti Debian.
ru_ru: <emphasis role="strong">Глава 15</emphasis> предназначена для администраторов, желающих углубиться ещё больше и создавать собственные пакеты Debian.

source: <emphasis>VOCABULARY</emphasis> Debian package
it_it: <emphasis>VOCABOLARIO</emphasis> Pacchetto Debian
ru_ru: <emphasis>СЛОВАРЬ</emphasis> Пакет Debian

source: <primary>package</primary><secondary>Debian package</secondary>
it_it: <primary>pacchetto</primary><secondary>pacchetto Debian</secondary>
ru_ru: <primary>пакет</primary><secondary>пакет Debian</secondary>

source: <primary>package</primary><secondary>binary package</secondary>
it_it: <primary>pacchetto</primary><secondary>pacchetto binario</secondary>
ru_ru: <primary>пакет</primary><secondary>двоичный пакет</secondary>

source: <primary>package</primary><secondary>source package</secondary>
it_it: <primary>pacchetto</primary><secondary>pacchetto sorgente</secondary>
ru_ru: <primary>пакет</primary><secondary>исходный пакет</secondary>

source: <primary>source</primary><secondary>package</secondary>
it_it: <primary>sorgente</primary><secondary>pacchetto</secondary>
ru_ru: <primary>пакет</primary><secondary>исходный пакет</secondary>

source: A Debian package is an archive containing all the files required to install a piece of software. It is generally a file with a <filename>.deb</filename> extension, and it can be handled with the <command>dpkg</command> command. Also called <emphasis>binary package</emphasis>, it contains files that can be directly used (such as programs or documentation). On the other hand, a <emphasis>source package</emphasis> contains the source code for the software and the instructions required for building the binary package.
it_it: Un pacchetto Debian consiste in un archivio contenente tutti i file necessari per installare un software. É generalmente un file con estensione <filename>.deb</filename> e può essere gestito dal comando <command>dpkg</command>. Chiamato anche <emphasis>pacchetto binario</emphasis>, contiene file che possono essere utilizzati direttamente (come programmi eseguibili o documentazione). Un <emphasis>pacchetto sorgente</emphasis> invece contiene il codice sorgente del software e le istruzioni necessarie per costruire il pacchetto binario.
ru_ru: Пакет Debian — это архив, содержащий все файлы, необходимые для установки программного обеспечения. В общем случае это файл с расширением <filename>.deb</filename>, и он может быть обработан командой <command>dpkg</command>. Так называемый <emphasis>двоичный пакет</emphasis> содержит файлы, которые могут быть использованы напрямую (такие как программы или документация). С другой стороны <emphasis>исходный пакет</emphasis> содержит исходный код программного обеспечения и инструкции, необходимые для создания двоичного пакета.

source: The present version is the first written primarily for English, and the second one available in English; the previous one was based on the fifth edition of the French book. This edition covers version 7 of Debian, code-named <emphasis role="distribution">Wheezy</emphasis>. Among the changes, Debian now sports two new architectures — <emphasis>s390x</emphasis> as a replacement for <emphasis>s390</emphasis>, for IBM System Z mainframe computers, and <emphasis>armhf</emphasis> for ARM processors with a hardware floating point arithmetic unit. Speaking of architectures, Debian's package manager is now multi-architecture, and can handle installation of different architectures of the same package at the same time. All included packages have obviously been updated, including the GNOME desktop, which is now included in its version 3.4.
it_it: La versione attuale è la prima scritta principalmente per la lingua inglese e la seconda disponibile in tale lingua; quella precedente era basata sulla quinta edizione del libro in francese. Questa edizione riguarda la versione 7 di Debian, nome in codice <emphasis role="distribution">Wheezy</emphasis>. Tra i cambiamenti, Debian vanta ora due nuove architetture: <emphasis>s390x</emphasis>, come sostituto di <emphasis>s390</emphasis> per i computer mainframe IBM System Z, e <emphasis>armhf</emphasis> per i processori ARM con un'unità aritmetica hardware in virgola mobile. Parlando di architetture, il gestore di pacchetti di Debian è ora multi-architettura e può gestire installazioni contemporanee di diverse architetture dello stesso pacchetto. Tutti i pacchetti inclusi sono stati ovviamente aggiornati, incluso il desktop GNOME di cui è inclusa ora la versione 3.4.
ru_ru: Настоящая версия является первой, написанной изначально на английском языке, и второй, доступной на английском; предыдущая базировалась на пятом издании французской книги. Данное издание освещает 7 версию Debian с кодовым названием <emphasis role="distribution">Wheezy</emphasis>. Помимо прочих изменений Debian теперь щеголяет двумя новыми архитектурами — <emphasis>s390x</emphasis> как заменой <emphasis>s390</emphasis> для мейнфреймов IBM System Z и <emphasis>armhf</emphasis> для процессоров ARM с аппаратным модулем арифметики с плавающей запятой. Кстати, об архитектурах: менеджер пакетов Debian теперь многоархитектурный и способен устанавливать разные архитектуры одного и того же пакета одновременно. Все входящие в дистрибутив пакеты, безусловно, были обновлены, включая рабочий стол GNOME, версия которого увеличилась до 3.4.

source: We have added some notes and remarks in sidebars. They have a variety of roles: they can draw attention to a difficult point, complete a notion of the case study, define some terms, or serve as reminders. Here is a list of the most common of these sidebars:
it_it: Abbiamo aggiunto alcune note e osservazioni nei riquadri. Queste assolvono a svariati compiti: risaltare punti particolarmente difficili, completare una nozione del caso di studio, definire alcuni termini o servire da promemoria. Questa è un lista delle tipologie più comuni:
ru_ru: Мы добавили некоторые заметки и ремарки во врезках. У них разные роли: они могут обратить внимание на трудные моменты, дополнить решение из учебного примера, определить термин или служить напоминанием. Вот список основных таких врезок:

source: BACK TO BASICS: a reminder for some information that is supposed to be known;
it_it: FONDAMENTALI: un promemoria per alcune informazioni che si suppone siano già note;
ru_ru: К ОСНОВАМ: напоминание о информации, которая, как предполагается, уже известна;

source: VOCABULARY: defines a technical term, sometimes Debian specific;
it_it: VOCABOLARIO: definisce un termine tecnico, alle volte specifico di Debian;
ru_ru: СЛОВАРЬ: определяет технический термин, порой специфичный для Debian;

source: COMMUNITY: highlights important persons or roles within the project;
it_it: COMUNITÀ: evidenziano persone o ruoli importanti all'interno del progetto;
ru_ru: СООБЩЕСТВО: представляет важного человека или роли в проекте;

source: POLICY: a rule or recommendation from the Debian Policy. This document is essential within the project, and describes how to package software. The parts of policy highlighted in this book bring direct benefits to users (for example, knowing that the policy standardizes the location of documentation and examples makes it easy to find them even in a new package).
it_it: POLITICA: una regola o una raccomandazione delle Debian Policy. Questo documento è fondamentale all'interno del progetto, e descrive come realizzare un pacchetto software. Le parti delle specifiche evidenziate in questo libro portano benefici diretti agli utenti (ad esempio, sapere che le specifiche standardizzano la posizione della documentazione e degli esempi rende facile trovarli anche in un nuovo pacchetto).
ru_ru: ПОЛИТИКА: правило или рекомендация из Политики Debian. Этот документ — неотъемлемая часть проекта, он описывает как упаковывать программное обеспечение в пакеты. Части политики, подчёркнутые в этой книге, приносят прямую пользу и пользователям (например, знание, что политика устанавливает стандартное расположение документации и примеров, позволяет легко их найти даже в новых пакетах);

source: TOOL: presents a relevant tool or service;
it_it: STRUMENTO: presenta uno strumento o un servizio importante;
ru_ru: ИНСТРУМЕНТ: представляет полезный инструмент или сервис;

source: IN PRACTICE: theory and practice do not always match; these sidebars contain advice resulting from our experience. They can also give detailed and concrete examples;
it_it: IN PRATICA: teoria e pratica non sempre coincidono; questi riquadri contengono consigli pratici derivanti dalla nostra esperienza. Possono anche fornire esempi dettagliati e concreti;
ru_ru: НА ПРАКТИКЕ: теория и практика не всегда соответствуют друг другу; эти врезки содержат советы, основанные на нашем опыте. В них также даются подробные и конкретные примеры;

source: other more or less frequent sidebars are rather explicit: CULTURE, TIP, CAUTION, GOING FURTHER, SECURITY, and so on.
it_it: altri tipi di riquadri usati più o meno frequentemente hanno nomi piuttosto espliciti: CULTURA, SUGGERIMENTO, ATTENZIONE, APPROFONDIMENTI, SICUREZZA e così via.
ru_ru: назначение других более или менее часто встречающихся врезок вполне очевидно: КУЛЬТУРА, СОВЕТ, ОСТОРОЖНО, УГЛУБЛЯЕМСЯ, БЕЗОПАСНОСТЬ и так далее.

source: Acknowledgments
it_it: Ringraziamenti
ru_ru: Благодарности

source: A Bit of History
it_it: Un po' di storia
ru_ru: Немного истории

source: In 2003, Nat Makarévitch contacted Raphaël because he wanted to publish a book on Debian in the <foreignphrase>Cahier de l'Admin</foreignphrase> (Admin's Handbook) collection that he was managing for Eyrolles, a leading French editor of technical books. Raphaël immediately accepted to write it. The first edition came out on 14th October 2004 and was a huge success — it was sold out barely four months later.
it_it: Nel 2003, Nat Makarévitch mi contattò (Raphaël) perché aveva intenzione di pubblicare un libro su Debian nella raccolta <foreignphrase>Cahier de l'Admin</foreignphrase> (Manuale dell'amministratore) che gestiva per Eyrolles, un importante editore francese di testi tecnici. Accettai immediatamente di scrivere il libro. La prima edizione è stata pubblicata il 14 ottobre 2004 e fu un tale successo che appena quattro mesi dopo andò esaurita.
ru_ru: В 2003 Нат Макаревич связался с Рафаэлем, потому что хотел опубликовать книгу о Debian в серии <foreignphrase>Cahier de l'Admin</foreignphrase> (Настольная книга админа), которой он занимался для ведущего французского издателя технических книг Eyrolles. Рафаэль незамедлительно согласился написать её. Первое издание вышло 14 октября 2004 и имело огромный успех: оно было полностью распродано 4 месяца спустя.

source: Since then, we have released 5 other editions of the French book, one for each subsequent Debian release. Roland, who started working on the book as a proofreader, gradually became its co-author.
it_it: Da allora, sono state rilasciate altre 5 edizioni della versione francese, una per ogni successivo rilascio di Debian. Roland, che ha iniziato a lavorare al libro come correttore di bozze, a poco a poco divenne il co-autore.
ru_ru: С тех пор мы выпустили 5 других изданий французской книги, по одной на каждый следующий релиз Debian. Ролан, который начинал работать над книгой как корректор, постепенно стал её соавтором.

source: While we were obviously satisfied with the book's success, we always hoped that Eyrolles would convince an international editor to translate it into English. We had received numerous comments explaining how the book helped people to get started with Debian, and we were keen to have the book benefit more people in the same way.
it_it: Sebbene fossimo ovviamente soddisfatti del successo del libro, speravamo che Eyrolles riuscisse a convincere un editore internazionale a tradurlo in inglese. Avevamo ricevuto molte segnalazioni di come il libro avesse aiutato molte persone ad iniziare con Debian ed eravamo desiderosi di far sì che il libro potesse aiutare nello stesso modo molte altre persone.
ru_ru: Книга имела несомненный успех и мы всегда надеялись, что Eyrolles убедит международного издателя перевести её на английский. Мы получили многочисленные отзывы, рассказывающие, как книга помогла их авторам познакомиться с Debian, и мы хотели, чтобы книга точно так же принесла пользу ещё большему числу людей.

source: Alas, no English-speaking editor that we contacted was willing to take the risk of translating and publishing the book. Not put off by this small setback, we negotiated with our French editor Eyrolles and got back the necessary rights to translate the book into English and publish it ourselves. Thanks to a successful crowdfunding campaign, we worked on the translation between December 2011 and May 2012. The “Debian Administrator's Handbook” was born and it was published under a free-software license!
it_it: Purtroppo nessun editore inglese che contattammo era disposto a correre il rischio di tradurre e pubblicare il libro. Non lasciandoci scoraggiare da questo piccolo ostacolo, abbiamo negoziato con il nostro editore francese Eyrolles e abbiamo ottenuto i diritti necessari per tradurre il libro in inglese e pubblicarlo noi stessi. Grazie ad una campagna di crowdfunding di successo, abbiamo lavorato alla traduzione dal dicembre 2011 a maggio 2012. Era nato il «Debian Administrator's Handbook» ed era pubblicato con una licenza per software libero!
ru_ru: Увы, ни один англоязычный редактор, с которым мы связывались, не хотел брать риски по переводу и публикации книги. Не испугавшись этой небольшой неудачи, мы договорились с нашим французским редактором Eyrolles и получили обратно права, необходимые для перевода книги на английский с последующей публикацией собственными силами. Благодаря успешной кампании по совместному финансированию мы трудились над переводом с декабря 2011 по май 2012 года. «Настольная книга администратора Debian» родилась и вышла в свет под сободной лицензией!

source: While this was an important milestone, we already knew that the story would be not be over for us until we could contribute the French book as an official translation of the English book. This was not possible at that time because the French book was still distributed commercially under a non-free license by Eyrolles.
it_it: Sebbene questo fosse un passo importante, sapevamo già che la storia non poteva dirsi conclusa fino a che non potevamo fornire il libro in francese come traduzione ufficiale di quello in inglese. Ciò non era in quel momento possibile, perché il libro francese era ancora distribuito commercialmente da Eyrolles con una licenza non libera.
ru_ru: Хотя это было важной вехой, мы уже знали, что на этом дело для нас не кончится до тех пор, пока мы не сможем предоставить французскую книгу как официальный перевод английской. Это было невозможно, поскольку французская кника по-прежнему распространялась коммерчески под несвободной лицензией издательством Eyrolles.

source: In 2013, the release of Debian 7 gave us a good opportunity to discuss a new contract with Eyrolles. We convinced them that a license more in line with the Debian values would contribute to the book's success. That wasn't an easy deal to make, and we agreed to setup another crowdfunding campaign to cover some of the costs and reduce the risks involved. The operation was again a huge success and in July 2013, we added a French translation to the Debian Administrator's Handbook.
it_it: Nel 2013 il rilascio di Debian 7 ci diede una buona opportunità di discutere un nuovo contratto con Eyrolles. Siamo riusciti a convincerli che una licenza più in linea con i valori di Debian avrebbe contribuito al successo del libro. Non è stato un accordo facile da fare e abbiamo accettato di organizzare un'altra campagna di crowdfunding per coprire parti dei costi e ridurre i rischi correlati. Ancora una volta l'operazione fu un enorme successo e nel luglio 2013 abbiamo aggiunto una traduzione francese del Debian Administrator's Handbook.
ru_ru: В 2013 году выход Debian 7 дал нам хорошую возможность обсудить новый контракт с Eyrolles. Мы убедили их, что лицензия, более соответствующая ценностям Debian, будет способствовать успеху книги. Это было непростым делом, и мы согласились начать ещё одну кампанию по совместному финансированию, чтобы покрыть часть расходов и снизить сопутствующие риски. Процесс опять прошёл весьма успешно, и в июле 2013 года мы добавили французский перевод в «Настольную книгу администратора Debian».

source: The Birth of the English Book
it_it: La nascita del libro in inglese
ru_ru: Рождение английской книги

source: We are back in 2011 and we just got the required rights to make an English translation of our French book. We are looking into ways to make this happen.
it_it: Torniamo indietro al 2011 quando noi avevamo appena ottenuto i diritti necessari per fare una traduzione in inglese del nostro libro in francese e stavamo cercando un modo per farla diventare realtà.
ru_ru: Вернёмся в 2011 год, когда мы только получили необходимые права, чтобы выполнить перевод французской книги на английский язык. Мы рассматривали варианты, как это можно сделать.

source: Translating a book of 450 pages is a considerable effort that requires several months of work. Self-employed people like us had to ensure a minimum income to mobilize the time necessary to complete the project. So we set up a crowdfunding campaign on Ulule and asked people to pledge money towards the project. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />
it_it: Tradurre un libro di 450 pagine comporta uno sforzo notevole che richiede diversi mesi di lavoro. Come lavoratori autonomi, dovevamo garantirci un reddito minimo durante il tempo necessario al completamento del progetto. Così abbiamo avviato una campagna di finanziamento popolare su Ulule chiedendo alle persone di contribuire economicamente alla riuscita del progetto. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />
ru_ru: Перевод 450-страничной книги требует значительных усилий и нескольких месяцев работы. Работающие на себя люди вроде нас должны были обеспечить минимальный заработок, чтобы освободить время для завершения работы. Поэтому мы открыли кампанию на Ulule и попросили людей финансировать наш проект. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />

source: The campaign had two goals: raising €15,000 for the translation and completing a €25,000 liberation fund to get the resulting book published under a free license — that is, a license that fully follows the Debian Free Software Guidelines.
it_it: La campagna aveva 2 obiettivi: raccogliere 15.000 € per la traduzione e destinare un fondo di liberazione di 25.000 € per ottenere la pubblicazione del libro risultante sotto una licenza libera, cioè una licenza che segue pienamente le linee guida Debian per il software libero.
ru_ru: Кампания имела 2 цели: превысить порог в €15,000 для перевода и порог в €25,000 для выпуска результата под свободной лицензий, — да, эта лицензия полностью соответствует руководствам по свободному программному обеспечению Debian.

source: When the Ulule campaign ended, the first goal had been achieved with €24,345 raised. The liberation fund was not complete however, with only €14,935 raised. As initially announced, the liberation campaign continued independently from Ulule on the book's official website.
it_it: Terminata la campagna di Ulule, il primo obiettivo fu raggiunto con la raccolta di 24.345 €. Mentre non fu possibile completare il fondo per la pubblicazione libera in quanto vennero raccolti solo 14.935 €. Come annunciato inizialmente la campagna per la pubblicazione libera proseguì indipendentemente da Ulule sul sito ufficiale del libro.
ru_ru: Когда кампания на Ulule закончилась, для первой цели была достигнута отметка в €24,345. Однако бюджет на освобождение не был собран: для этого мы получили €14,935. Как было первоначально объявлено, кампания по освобождению продолжилась независимо от Ulule на официальном сайте книги.

source: While we were busy translating the book, donations towards the liberation continued to flow in… And in April 2012, the liberation fund was completed. You can thus benefit from this book under the terms of a free license.
it_it: Mentre eravamo impegnati a tradurre il libro, le donazioni dedicate alla pubblicazione libera hanno continuato ad arrivare… così ad aprile 2012, il fondo fu completato ed è perciò possibile beneficiare di questo libro sotto i termini di una licenza libera.
ru_ru: Пока мы были заняты переводом, пожертвования на освобождение продолжали поступать… В апреле 2012 бюджет на освобождение был собран, поэтому вы можете пользоваться этой книгой на условиях свободной лицензии.
