Repository: binary-com/mobile
Catalog: */00b_foreword.po
Languages: it_it, ru_ru

source: We would like to thank everybody who contributed to these fundraising campaigns, either by pledging some money or by passing the word around. We couldn't have done it without you.
it_it: Vorremmo ringraziare tutti coloro che hanno contribuito a queste campagne di raccolta fondi, sia con contributi in denaro che con il passaparola, senza di loro non ce l'avremmo fatta.
ru_ru: Мы хотели бы поблагодарить всех, кто принимал участие в этих кампаниях, пожертвовав деньги или распространяя информацию о них. Мы бы не смогли сделать этого без вас.

source: Supportive Companies and Organizations
it_it: Aziende e organizzazioni che ci hanno appoggiato
ru_ru: Поддержка компаний и организаций

source: We had the pleasure of getting significant contributions from many free software-friendly companies and organizations. Thank you to <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (the company behind <ulink url="http://www.kali.org">Kali Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL (Société Solidaire d'Informatique En Logiciels Libres), and <ulink url="http://www.syminet.com">Syminet</ulink>.
it_it: Abbiamo avuto il piacere di ottenere contributi significativi da molte aziende e organizzazioni amiche del software libero. Grazie a <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (l'azienda dietro <ulink url="http://www.kali.org">Kali Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL (Société Solidaire d'Informatique En Logiciels Libres) e <ulink url="http://www.syminet.com">Syminet</ulink>.
ru_ru: Мы были обрадованы значительным вкладом многих компаний и организаций, дружественных миру свободного программного обеспечения. Спасибо <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (компания, занимающаяся <ulink url="http://www.kali.org">Kali Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL (Société Solidaired'Informatique En Logiciels Libres) и <ulink url="http://www.syminet.com">Syminet</ulink>.

source: We would also like to thank <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> and <ulink url="http://www.april.org">April</ulink> for their help in promoting the operation.
it_it: Vorremmo anche ringraziare <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> e <ulink url="http://www.april.org">April</ulink> per il loro aiuto nel promuovere l'operazione.
ru_ru: Мы так же хотим поблагодарить <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> и <ulink url="http://www.april.org">April</ulink> за их помощь в продвижении этого проекта.

source: Individual Supporters
it_it: Sostenitori individuali
ru_ru: Частные жертвователи

source: With over 650 supporters in the initial fundraising, and several hundred more in the continued liberation campaign, it is thanks to people like you that this project has been possible. Thank you!
it_it: Gli oltre 650 sostenitori nella raccolta fondi iniziale e le altre svariate centinaia che hanno contribuito durante il proseguimento della campagna di liberazione: è grazie a persone come loro che questo progetto è stato possibile. Grazie!
ru_ru: Мы благодарим более 650 спонсоров, участвовавших в первоначальном сборе средств, и несколько сотен — в продолжившейся кампании по освобождению. Без таких людей, как вы, этот проект не состоялся бы. Спасибо!

source: We want to address our special thanks to those who contributed at least €35 (sometimes much more!) to the liberation fund. We are glad that there are so many people who share our values about freedom and yet recognize that we deserved a compensation for the work that we have put into this project.
it_it: Vogliamo indirizzare il nostro speciale ringraziamento a chi ha contribuito con almeno 35 € (a volte anche molto di più!) al fondo per la pubblicazione libera. Siamo lieti ci siano tante persone che condividano i nostri valori di libertà e tuttavia ci abbiano voluto riconoscere un compenso per il lavoro che abbiamo dedicato a questo progetto.
ru_ru: Мы хотим выразить отдельную благодарность людям, пожертвовавшим по меньшей мере €35 (а порой гораздо больше!) на выпуск книги под свободной лицензией. Мы очень рады, что так много людей разделяют наши взгляды на свободу и понимают, что мы заслуживаем компенсацию за наши труды, вложенные в этот проект.

source: So thank you Alain Coron, Alain Thabaud, Alan Milnes, Alastair Sherringham, Alban Dumerain, Alessio Spadaro, Alex King, Alexandre Dupas, Ambrose Andrews, Andre Klärner, Andreas Olsson, Andrej Ricnik, Andrew Alderwick, Anselm Lingnau, Antoine Emerit, Armin F. Gnosa, Avétis Kazarian, Bdale Garbee, Benoit Barthelet, Bernard Zijlstra, Carles Guadall Blancafort, Carlos Horowicz — Planisys S.A., Charles Brisset, Charlie Orford, Chris Sykes, Christian Bayle, Christian Leutloff, Christian Maier, Christian Perrier, Christophe Drevet, Christophe Schockaert (R3vLibre), Christopher Allan Webber, Colin Ameigh, Damien Dubédat, Dan Pettersson, Dave Lozier, David Bercot, David James, David Schmitt, David Tran Quang Ty, Elizabeth Young, Fabian Rodriguez, Ferenc Kiraly, Frédéric Perrenot — Intelligence Service 001, Fumihito Yoshida, Gian-Maria Daffré, Gilles Meier, Giorgio Cittadini, Héctor Orón Martínez, Henry, Herbert Kaminski, Hideki Yamane, Hoffmann Information Services GmbH, Holger Burkhardt, Horia Ardelean, Ivo Ugrina, Jan Dittberner, Jim Salter, Johannes Obermüller, Jonas Bofjäll, Jordi Fernandez Moledo, Jorg Willekens, Joshua, Kastrolis Imanta, Keisuke Nakao, Kévin Audebrand, Korbinian Preisler, Kristian Tizzard, Laurent Bruguière, Laurent Hamel, Leurent Sylvain, Loïc Revest, Luca Scarabello, Lukas Bai, Marc Singer, Marcelo Nicolas Manso, Marilyne et Thomas, Mark Janssen — Sig-I/O Automatisering, Mark Sheppard, Mark Symonds, Mathias Bocquet, Matteo Fulgheri, Michael Schaffner, Michele Baldessari, Mike Chaberski, Mike Linksvayer, Minh Ha Duong, Moreau Frédéric, Morphium, Nathael Pajani, Nathan Paul Simons, Nicholas Davidson, Nicola Chiapolini, Ole-Morten, Olivier Mondoloni, Paolo Innocenti, Pascal Cuoq, Patrick Camelin, Per Carlson, Philip Bolting, Philippe Gauthier, Philippe Teuwen, PJ King, Praveen Arimbrathodiyil (j4v4m4n), Ralf Zimmermann, Ray McCarthy, Rich, Rikard Westman, Robert Kosch, Sander Scheepens, Sébastien Picard, Stappers, Stavros Giannouris, Steve-David Marguet, T. Gerigk, Tanguy Ortolo, Thomas Hochstein, Thomas Müller, Thomas Pierson, Tigran Zakoyan, Tobias Gruetzmacher, Tournier Simon, Trans-IP Internet Services, Viktor Ekmark, Vincent Demeester, Vincent van Adrighem, Volker Schlecht, Werner Kuballa, Xavier Neys, and Yazid Cassam Sulliman.
it_it: Quindi grazie a: Alain Coron, Alain Thabaud, Alan Milnes, Alastair Sherringham, Alban Dumerain, Alessio Spadaro, Alex King, Alexandre Dupas, Ambrose Andrews, Andre Klärner, Andreas Olsson, Andrej Ricnik, Andrew Alderwick, Anselm Lingnau, Antoine Emerit, Armin F. Gnosa, Avétis Kazarian, Bdale Garbee, Benoit Barthelet, Bernard Zijlstra, Carles Guadall Blancafort, Carlos Horowicz — Planisys S.A., Charles Brisset, Charlie Orford, Chris Sykes, Christian Bayle, Christian Leutloff, Christian Maier, Christian Perrier, Christophe Drevet, Christophe Schockaert (R3vLibre), Christopher Allan Webber, Colin Ameigh, Damien Dubédat, Dan Pettersson, Dave Lozier, David Bercot, David James, David Schmitt, David Tran Quang Ty, Elizabeth Young, Fabian Rodriguez, Ferenc Kiraly, Frédéric Perrenot — Intelligence Service 001, Fumihito Yoshida, Gian-Maria Daffré, Gilles Meier, Giorgio Cittadini, Héctor Orón Martínez, Henry, Herbert Kaminski, Hideki Yamane, Hoffmann Information Services GmbH, Holger Burkhardt, Horia Ardelean, Ivo Ugrina, Jan Dittberner, Jim Salter, Johannes Obermüller, Jonas Bofjäll, Jordi Fernandez Moledo, Jorg Willekens, Joshua, Kastrolis Imanta, Keisuke Nakao, Kévin Audebrand, Korbinian Preisler, Kristian Tizzard, Laurent Bruguière, Laurent Hamel, Leurent Sylvain, Loïc Revest, Luca Scarabello, Lukas Bai, Marc Singer, Marcelo Nicolas Manso, Marilyne e Thomas, Mark Janssen — Sig-I/O Automatisering, Mark Sheppard, Mark Symonds, Mathias Bocquet, Matteo Fulgheri, Michael Schaffner, Michele Baldessari, Mike Chaberski, Mike Linksvayer, Minh Ha Duong, Moreau Frédéric, Morphium, Nathael Pajani, Nathan Paul Simons, Nicholas Davidson, Nicola Chiapolini, Ole-Morten, Olivier Mondoloni, Paolo Innocenti, Pascal Cuoq, Patrick Camelin, Per Carlson, Philip Bolting, Philippe Gauthier, Philippe Teuwen, PJ King, Praveen Arimbrathodiyil (j4v4m4n), Ralf Zimmermann, Ray McCarthy, Rich, Rikard Westman, Robert Kosch, Sander Scheepens, Sébastien Picard, Stappers, Stavros Giannouris, Steve-David Marguet, T. Gerigk, Tanguy Ortolo, Thomas Hochstein, Thomas Müller, Thomas Pierson, Tigran Zakoyan, Tobias Gruetzmacher, Tournier Simon, Trans-IP Internet Services, Viktor Ekmark, Vincent Demeester, Vincent van Adrighem, Volker Schlecht, Werner Kuballa, Xavier Neys e Yazid Cassam Sulliman.
ru_ru: Итак, наша особая благодарность следующим людям: Алайн Корон, Алайн Тобод, Алан Мильнс, Алестер Шерингхам, Албан Дамрейн, Алессио Спарадо, Алекс Кинг, Александр Дюпас, Амброс Андрюс, Андре Клярнер, Андреас Олссон, Андрей Рикник, Андрей Альдервик, Ансельм Лигно, Антуан Эмерит, Армин Ф. Гноса, Аветис Казариан, Бдаль Гарби, Бенуа Бартеле, Бернард Жильстра, Карл Годаль Бланкафорт, Карлос Хорович — Planisys S.A., Чарльз Бриссет, Чарли Орфорд, Крис Сайкс, Кристиан Бэйль, Кристиан Лейтлоф, Кристиан Майер, Кристиан Перье, Кристоф Древе, Кристов Шокарт (R3vLibre), Кристофер Аллан Веббер, Колин Ами, Дамьен Дюбеда, Дэн Петтерсон, Дэйв Лозьер, Дэвид Беркот, Дэвид Джеймс, Дэвид Шмит, Дэвид Тран Куанг Тай, Элизабет Янг, Фабьен Родригез, Ферекн Киралай, Фредерик Перрено — Intelligence Service 001, Фумито Йошида, Жан-Мариа Даффре, Жиль Майер, Жоржио Читтадини, Гектор Орон Мартинез, Генри, Гербрерт Камински, Хидеки Яман, Hoffmann Information Services GmbH, Хольгер Брукхарт, Хориа Арделин, Иво Угрина, Жан Диттебернер, Джим Сальтер, Йоханнес Обермюллер, Йонас Боржал, Жорди Фернандес Моледо, Йорг Виллекенс, Йошуа, Кастроллис Иманта, Кейсуке Накао, Кевин Одебранд, Корбиниан Прейслер, Кристиан Тиззард, Лорен Брюжер, Лорен Хамель, Лорен Сильвиан, Луик Ревест, Лука Скарабелло, Лукас Бай, Марк Сингер, Марчело Николас Мансо, Мэрилин Томас, Марк Йансен — Sig-I/O Automatisering, Марк Шеппард, Марк Саймондс, Матиас Боке, Матео Фальгери, Майкл Шаффнер, Мишель Болдессари, Майк Чаберски, Майк Линксвайер, Мин Ха Дон, Моро Фредерис, Морфиум, Натаел Пажани, Натан Пол Саймонс, Николя Давидсон, Николя Чиаполини, Оле-Мортен, Оливьер Мондолони, Паоло Иннокенти, Паскаль Сиок, Патрик Камелин, Пер Карлсон, Филип Болтинг, Филиппе Готьер, Филиппе Тейвень, ПЖ Кинг, Правин Арибратодил (j4v4m4n), Ральф Зимерман, Рэй Маккарти, Рик, Рикард Вестман, Роберт Коч, Сандер Шипенс, Себастьян Пикард, Стапперс, Ставрос Гинорис, Стив-Дэйвид Марго, Т. Грижк, Тангу Ортоло, Томас Хочстейн, Томас Мюллер, Томас Пирсон, Тигран Закоян, Тоби Грютмахер, Турне Симон, Trans-IP Internet Services, Виктор Экмарк, Винсент Демистер, Винсент ван Адригем, Волкер Члехт, Вернер Кубалла, Ксавьер Нис и Язид Гассам Сулейман.

source: The Liberation of the French Book
it_it: La liberazione del libro francese
ru_ru: Освобождение французской книги

source: After the publication of the English book under a free software licence, we were in a weird situation with a free book which is a translation of a non-free book (since it was still distributed commercially under a non-free license by Eyrolles).
it_it: Dopo la pubblicazione del libro in inglese sotto una licenza per software libero, ci trovavamo in una strana situazione con un libro libero che era la traduzione di un libro non libero (dato che era ancora distribuito commercialmente da Eyrolles sotto una licenza non libera).
ru_ru: После публикации английской книги под свободной лицензией мы оказались в странной ситуации со свободной книгой, являвшейся переводом несвободной книги (поскольку та по-прежнему распространялася коммерчески под несвободной лицензией издательством Eyrolles).

source: We knew that fixing this would require to convince Eyrolles that a free license would contribute to the book's success. The opportunity came to us in 2013 when we had to discuss a new contract to update the book for Debian 7. Since freeing a book often has a significant impact on its sales, as a compromise, we agreed to setup a crowdfunding campaign to offset some of the risks involved and to contribute to the publication costs of a new edition. The campaign was again hosted on Ulule: <ulink type="block" url="http://www.ulule.com/liberation-cahier-admin-debian/" />
it_it: Sapevamo che per risolvere la questione era necessario convincere Eyrolles che una licenza libera avrebbe contribuito al successo del libro. L'opportunità di farlo ci si presentò nel 2013 quando dovevamo discutere un nuovo contratto per aggiornare il libro per Debian 7. Dato che la liberazione di un libro spesso ha un impatto significativo sulle sue vendite, come compromesso accettammo di organizzare una campagna di crowdfunding per compensare parte dei rischi connessi e contribuire ai costi di pubblicazione di una nuova edizione. La campagna fu nuovamente ospitata su Ulule: <ulink type="block" url="http://www.ulule.com/liberation-cahier-admin-debian/" />
ru_ru: Мы знали, что для исправления этого потребуется убедить Eyrolles, что свободная лицензия поможет книге достичь успеха. Такая возможность появилась у нас в 2013 году, когда мы должны были обсудить новый договор на обновление книги для Debian 7. Поскольку освобождение книги часто значительно сказывается на её продажах, в качестве компромисса мы согласились начать кампанию по совместному финансированию, чтобы компенсировать часть сопутствующих рисков и вложиться в публикацию нового издания. Кампания вновь была размещена на Ulule: <ulink type="block" url="http://www.ulule.com/liberation-cahier-admin-debian/" />

source: The target was at €15,000 in 30 days. It took us less than a week to reach it, and at the end we got a whopping €25,518 from 721 supporters.
it_it: L'obiettivo era 15.000 € in 30 giorni. Ci volle meno di una settimana per raggiungerlo, e alla fine ottenemmo l'impressionante somma di 25.518 € da 721 sostenitori.
ru_ru: Целью было собрать 15000 евро за 30 дней. На её достижение у нас ушло меньше недели, а к концу мы набрали целых 25518 евро от 721 жертвователя.

source: We had significant contributions from free software-friendly companies and organizations. Let us thank the <ulink url="http://linuxfr.org">LinuxFr.org</ulink> website, <ulink url="http://korben.info">Korben</ulink>, <ulink url="http://www.addventure.fr">Addventure</ulink>, <ulink url="http://www.eco-cystemes.com/">Eco-Cystèmes</ulink>, <ulink url="http://elol.fr">ELOL SARL</ulink>, and <ulink url="http://www.linuvers.com">Linuvers</ulink>. Many thanks to LinuxFr and Korben, they considerably helped to spread the news.
it_it: Ricevemmo contributi significativi da aziende e organizzazione amiche del software libero. Permetteteci di ringraziare <ulink url="http://linuxfr.org">LinuxFr.org</ulink> website, <ulink url="http://korben.info">Korben</ulink>, <ulink url="http://www.addventure.fr">Addventure</ulink>, <ulink url="http://www.eco-cystemes.com/">Eco-Cystèmes</ulink>, <ulink url="http://elol.fr">ELOL SARL</ulink> e <ulink url="http://www.linuvers.com">Linuvers</ulink>. Molti ringraziamenti a LinuxFr e Korben che ci hanno notevolmente aiutato a spargere la voce.
ru_ru: Мы получили значительную поддержку от компаний и организаций, дружественных к свободному ПО. Позвольте нам выразить благодарность веб-сайту <ulink url="http://linuxfr.org">LinuxFr.org</ulink>, <ulink url="http://korben.info">Korben</ulink>, <ulink url="http://www.addventure.fr">Addventure</ulink>, <ulink url="http://www.eco-cystemes.com/">Eco-Cystèmes</ulink>, <ulink url="http://elol.fr">ELOL SARL</ulink> и <ulink url="http://www.linuvers.com">Linuvers</ulink>. Огромное спасибо LinuxFr и Korben, которые сильно помогли в распространении новостей.

source: The operation has been a huge success because hundreds of people share our values of freedom and put their money to back it up! Thank you for this.
it_it: L'operazione è stata un enorme successo perché centinaia di persone condividono i nostri valori di libertà e hanno dato i loro soldi per sostenerli! Grazie per averlo fatto!
ru_ru: Предприятие завершилось с таким успехом благодаря сотням людей, разделяющим наши взгляды на ценность свободы и не жалеющих денег на её поддержку. Спасибо вам за это!
