Repository: binary-com/mobile
Catalog: */00b_foreword.po
Languages: it_it, ru_ru

source: Foreword
it_it: Introduzione
ru_ru: Введение

source: Linux has been garnering strength for a number of years now, and its growing popularity drives more and more users to make the jump. The first step on that path is to pick a distribution. This is an important decision, because each distribution has its own peculiarities, and future migration costs can be avoided if the right choice is made from the start.
it_it: Da diversi anni ormai, Linux ha rafforzato la propria posizione e la sua crescente popolarità porta sempre più utenti a fare il salto. Il primo passo lungo questo percorso è la scelta di una distribuzione. Questa è una decisione importante poiché ogni distribuzione ha le proprie peculiarità e futuri costi di migrazione possono essere evitati se la scelta iniziale è quella giusta.
ru_ru: Linux уже многие годы набирает силы, и его растущая популярность побуждает всё новых и новых пользователей к переходу. Первый шаг на этом пути — выбор дистрибутива. Это важное решение, потому что каждый дистрибутив имеет свои особенности, и правильный выбор, сделанный в начале, позволит избежать будущих затрат на переход.

source: <emphasis>BACK TO BASICS</emphasis> Linux distribution, Linux kernel
it_it: <emphasis>FONDAMENTALI</emphasis> Distribuzione Linux, Kernel Linux
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Распространение Linux, ядро Linux

source: <primary>Linux</primary><secondary>kernel</secondary>
ru_ru: <primary>Linux</primary><secondary>ядро</secondary>

source: <primary>Linux</primary><secondary>distribution</secondary>
it_it: <primary>Linux</primary><secondary>distribuzione</secondary>
ru_ru: <primary>Linux</primary><secondary>дистрибутив</secondary>

source: <primary>distribution</primary><secondary>Linux distribution</secondary>
it_it: <primary>distribuzione</primary><secondary>distribuzione Linux</secondary>
ru_ru: <primary>дистрибутив</primary><secondary>дистрибутив Linux</secondary>

source: Strictly speaking, Linux is only a kernel, the core piece of software which sits between the hardware and the applications.
it_it: In senso stretto, Linux è solo un kernel, la parte fondamentale di software che è posizionata tra l'hardware e le applicazioni
ru_ru: Строго говоря, Linux — это только ядро, центральная программа, связывающая аппаратное обеспечение и приложения.

source: A “Linux distribution” is a full operating system; it usually includes the Linux kernel, an installer program, and most importantly applications and other software required to turn a computer into a tool that is actually useful.
it_it: Una «distribuzione Linux» è un sistema operativo completo; solitamente include il kernel Linux, un programma di installazione e soprattutto le applicazioni e i software necessari per trasformare un computer in uno strumento effettivamente utile.
ru_ru: «Дистрибутив Linux» — это целая операционная система; он обычно включает ядро Linux, программу-установщик, наиболее важные приложения и прочее программное обеспечение, необходимое для превращения компьютера в действительно полезный инструмент.

source: Debian GNU/Linux is a “generic” Linux distribution that fits most users. The purpose of this book is to show its many aspects so you can make an informed decision when choosing.
it_it: Debian GNU/Linux è una distribuzione Linux «generica» che soddisfa la maggior parte degli utenti. Il proposito di questo libro è di illustrarne i suoi molteplici aspetti così da permettere di prendere una decisione consapevole al momento della propria scelta.
ru_ru: Debian GNU/Linux — это дистрибутив Linux «общего назначения», подходящий большинству пользователей. Цель этой книги — показать его многогранность, чтобы вы могли принять взвешенное решение при выборе.

source: Why This Book?
it_it: Perché questo libro?
ru_ru: Зачем эта книга?

source: <emphasis>CULTURE</emphasis> Commercial distributions
it_it: <emphasis>CULTURA</emphasis> Distribuzioni commerciali
ru_ru: <emphasis>КУЛЬТУРА</emphasis> Коммерческие дистрибутивы

source: <primary>distribution</primary><secondary>commercial distribution</secondary>
it_it: <primary>distribuzione</primary><secondary>distribuzioni commerciali</secondary>
ru_ru: <primary>дистрибутив</primary><secondary>коммерческий дистрибутив</secondary>

source: Most Linux distributions are backed by a for-profit company that develops them and sells them under some kind of commercial scheme. Examples include <emphasis>Ubuntu</emphasis>, mainly developed by <emphasis>Canonical Ltd.</emphasis>; <emphasis>Mandriva Linux</emphasis>, by French company <emphasis>Mandriva SA</emphasis>; and <emphasis>Suse Linux</emphasis>, maintained and made commercially available by <emphasis>Novell</emphasis>.
it_it: La maggior parte delle distribuzioni sono supportate da aziende commerciali che le sviluppano e le vendono per trarne profitti, le più conosciute sono <emphasis>Ubuntu</emphasis>, manutenuta principalmente da <emphasis>Canonical Ltd.</emphasis>; <emphasis>Mandriva Linux</emphasis>, dall'azienda francese <emphasis>Mandriva SA</emphasis>; e <emphasis>Suse Linux</emphasis>, manutenuta e commercializzata da <emphasis>Novell</emphasis>.
ru_ru: Большинство дистрибутивов Linux поддерживаются коммерческими компаниями, которые развивают и продают их по той или иной схеме. Для примера назовём дистрибутив <emphasis>Ubuntu</emphasis>, в основном разрабатываемый <emphasis>Canonical Ltd.</emphasis>; <emphasis>Mandriva Linux</emphasis> французской компании <emphasis>Mandriva SA</emphasis>; и <emphasis>Suse Linux</emphasis>, сопровождаемый и продаваемый <emphasis>Novell</emphasis>.

source: At the other end of the spectrum lie the likes of Debian and the Apache Software Foundation (which hosts the development for the Apache web server). Debian is above all a project in the Free Software world, implemented by volunteers working together through the Internet. While some of them do work on Debian as part of their paid job in various companies, the project as a whole is not attached to any company in particular, nor does any one company have a greater say in the project's affairs than what purely volunteer contributors have.
it_it: Alla parte opposta si trovano progetti come Debian e la Apache Software Foundation (che ospita lo sviluppo per il server web Apache). Debian è soprattutto un progetto nel mondo del Software libero, realizzato da volontari che collaborano tramite Internet. Sebbene alcuni di loro lavorino su Debian come parte del loro lavoro pagato in varie aziende, il progetto nel suo complesso non è legato ad alcuna azienda in particolare, né alcuna azienda ha più voce in capitolo nelle questioni del progetto di quanta ne abbia chi contribuisce in modo puramente volontario.
ru_ru: Противоположностью им являются подобные Debian и Apache Software Foundation (который управляет разработкой веб-сервера Apache). Debian — это прежде всего проект в мире свободного программного обеспечения, разрабатываемый добровольцами, работающими совместно через Интернет. Хотя некоторые из них получают оплату за работу над Debian от различных компаний, проект в целом не принадлежит какой бы то ни было компании, и ни одна компания не имеет большего авторитета во внутренних делах проекта, чем независмый доброволец.

source: Linux has gathered a fair amount of media coverage over the years; it mostly benefits the distributions supported by a real marketing department — in other words, company-backed distributions (Ubuntu, Red Hat, SUSE, Mandriva, and so on). But Debian is far from being a marginal distribution; multiple studies have shown over the years that it is widely used both on servers and on desktops. This is particularly true among webservers where Debian is the leading Linux distribution. <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" /> <ulink type="block" url="http://w3techs.com/blog/entry/debian_ubuntu_extend_the_dominance_in_the_linux_web_server_market_at_the_expense_of_red_hat_centos" />
it_it: Linux ha raccolto negli anni una discreta copertura mediatica, di cui hanno beneficiato per la maggiore le distribuzioni supportate da un dipartimento marketing reale, in altre parole le distribuzioni con alle spalle un'azienda (Ubuntu, Red Hat, SUSE, Mandriva e così via). Ma Debian è tutt'altro che una distribuzione marginale; diversi studi negli anni hanno mostrato come sia largamente usata sia nei server sia nei desktop. Ciò è particolarmente vero per i server web dove Debian è la distribuzione Linux più usata. <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" /> <ulink type="block" url="http://w3techs.com/blog/entry/debian_ubuntu_extend_the_dominance_in_the_linux_web_server_market_at_the_expense_of_red_hat_centos" />
ru_ru: Linux достаточно широко освещался в СМИ на протяжении многих лет, что главным образом заслуга дистрибутивов, продвигаемых рекламными отделами — иными словами, дистрибутивов, за которыми стоят компании (Ubuntu, Red Hat, SUSE, Mandriva и иже с ними). Но Debian далеко не второстепенный дистрибутив; согласно ряду исследований, проведённых за последние годы, он широко используется как на серверах, так и на настольных компьютерах. Это в особенности верно для веб-серверов, где Debian занимает позицию лидирующего дистрибутива Linux. <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" /> <ulink type="block" url="http://w3techs.com/blog/entry/debian_ubuntu_extend_the_dominance_in_the_linux_web_server_market_at_the_expense_of_red_hat_centos" />

source: The purpose of this book is to help you discover this distribution. We hope to share the experience that we have gathered since we joined the project as developers and contributors in 1998 (Raphaël) and 2000 (Roland). With any luck, our enthusiasm will be communicative, and maybe you will join us sometime…
it_it: L'obiettivo di questo libro è di aiutare a scoprire questa distribuzione. Speriamo di condividere l'esperienza che abbiamo raccolto da quando abbiamo aderito al progetto come sviluppatori e collaboratori nel 1998 (Raphaël) e 2000 (Roland). Con un po' di fortuna, speriamo di trasmettere il nostro entusiasmo, e può darsi che prima o poi vi uniate a noi…
ru_ru: Цель этой книги — помочь вам познать этот дистрибутив. Мы надеемся поделиться опытом, который мы получили, присоединившись к проекту как участники и разработчики в 1998 (Рафаэль) и 2000 (Ролан). Если повезёт, вы заразитесь нашим энтузиазмом и, возможно, когда-нибудь присоединитесь к нам…

source: The first edition of this book (in 2004) served to fill a gaping hole: it was the first French-language book that focused exclusively on Debian. At that time, many other books were written on the topic both for French-speaking and English-speaking readers. Unfortunately almost none of them got updated, and over the years the situation slipped back to one where there were very few good books on Debian. We hope that this book, which has started a new life with its translation into English (and several translations from English into various other languages), will fill this gap and help many users.
it_it: La prima edizione di questo libro (nel 2004) è servita a riempire un vuoto: è stato il primo libro in lingua francese concentrato esclusivamente su Debian. Fino ad allora, molti altri libri erano stati scritti sull'argomento, sia per i lettori francofoni che anglofoni. Sfortunatamente quasi nessuno di tali libri è stato aggiornato e la situazione era ritornata ad un punto in cui esistevano pochissimi buoni libri su Debian. Noi speriamo che questo libro, che ha iniziato una nuova vita con la sua traduzione in inglese (e svariate traduzioni dall'inglese ad altre lingue) riempia questo vuoto ed aiuti molti utenti.
ru_ru: Первое издание этой книги (в 2004) заполнило пустующую нишу: это была первая книга на французском языке, посвящённая исключительно Debian. В ту пору было написано множество книг на эту тему как для франкоязычных, так и для англоязычных читателей. К сожалению, практически ни одна из них не обновлялась, и годы спустя ситуация стала прежней: хороших книг по Debian очень мало. Мы надеемся, что эта книга, начавшая новую жизнь с переводом её на английский (и несколькими переводами с английского на другие языки), заполнит данный пробел и поможет многим пользователям.

source: Who Is this Book For?
it_it: A chi è rivolto questo libro?
ru_ru: Для кого эта книга?

source: We tried to make this book useful for many categories of readers. First, systems administrators (both beginners and experienced) will find explanations about the installation and deployment of Debian on many computers. They will also get a glimpse of most of the services available on Debian, along with matching configuration instructions and a description of the specifics coming from the distribution. Understanding the mechanisms involved in Debian's development will enable them to deal with unforeseen problems, knowing that they can always find help within the community.
it_it: Abbiamo cercato di rendere questo libro utile a molte categorie di lettori. Innanzitutto gli amministratori di sistema (sia principianti che esperti) troveranno spiegazioni a proposito dell'installazione e dell'utilizzo di Debian su molti computer; troveranno inoltre una panoramica sulla maggior parte dei servizi disponibili in Debian, assieme alle relative istruzioni di configurazione e la descrizione delle specifiche che provengono dalla distribuzione. Conoscere i meccanismi coinvolti nello sviluppo di Debian permetterà loro di affrontare problemi imprevisti sapendo che potranno sempre trovare aiuto nella comunità.
ru_ru: Мы пытались сделать эту книгу полезной для разных категорий читателей. Во-первых, системные администраторы (как начинающие, так и опытные) найдут инструкцию по установке и внедрению Debian на множество компьютеров. Они также получат представление о большинстве сервисов, доступных в Debian, инструкции по их настройке и описание специфических составляющих дистрибутива. Понимание механизмов разработки Debian поможет им справиться с непредвиденными проблемами, зная, что всегда можно найти помощь у сообщества.

source: Users of another Linux distribution, or of another Unix variant, will discover the specifics of Debian, and should become operational very quickly while benefiting fully from the unique advantages of this distribution.
it_it: Gli utenti di altre distribuzioni Linux, o di altre varianti Unix, scopriranno le specifiche di Debian, e dovrebbero divenire rapidamente operativi beneficiando completamente dei vantaggi unici propri di questa distribuzione.
ru_ru: Пользователи других дистрибутивов Linux, или других Unix-систем, сориентируются в специфике Debian и уже вскоре будут готовы к работе, в полной мере пользуясь всеми преимуществами, присущими этому дистрибутиву.

source: Finally, readers who already have some knowledge of Debian and want to know more about the community behind it should see their expectations fulfilled. This book should make them much closer to joining us as contributors.
it_it: Infine, i lettori che hanno già qualche conoscenza di Debian e vogliono conoscere di più a proposito della comunità alle sue spalle dovrebbero veder soddisfatte le loro aspettative. Questo libro dovrebbe avvicinarli ad unirsi a noi come collaboratori.
ru_ru: Наконец, пользователи, уже знакомые с Debian и желающие узнать больше о стоящем за ним сообществе, не разочаруются в своих ожиданиях. Эта книга может значительно приблизить их к вступлению в сообщество разработчиков.

source: General Approach
it_it: L'approccio generale
ru_ru: Общий подход

source: All of the generic documentation you can find about GNU/Linux also applies to Debian, since Debian includes most common free software. However, the distribution brings many enhancements, which is why we chose to primarily describe the “Debian way” of doing things.
it_it: Tutte le documentazioni generiche che si possono trovare a proposito di GNU/Linux sono applicabili anche a Debian, poiché Debian include la maggior parte del software libero di uso comune. Ad ogni modo, la distribuzione fornisce molti miglioramenti, che sono alla base della nostra scelta di descrivere principalmente «il modo Debian» di fare le cose.
ru_ru: Вся общая документация, которую вы можете найти о GNU/Linux, также применима и к Debian, поскольку Debian включает наиболее распространённое свободное программное обеспечение. Однако дистрибутив привносит много усовершенствований, именно поэтому мы решили в первую очередь описывать способы работы, принятые в «Debian way» («пути Debian»).

source: It is interesting to follow the Debian recommendations, but it is even better to understand their rationale. Therefore, we won't restrict ourselves to practical explanations only; we will also describe the project's workings, so as to provide you with comprehensive and consistent knowledge.
it_it: È interessante seguire le raccomandazioni di Debian, ma è molto meglio capire le loro motivazioni. Quindi, non ci limiteremo alle spiegazioni pratiche; cercheremo anche di descrivere il funzionamento del progetto per fornire conoscenze esaustive e coerenti.
ru_ru: Весьма любопытно следовать рекомендациям Debian, но ещё лучше понимать их мотивы. К тому же мы не ограничиваем себя исключительно практическими объяснениями; мы также опишем работу проекта, чтобы у вас сформировались всесторонние и цельные знания.

source: Book Structure
it_it: Struttura del libro
ru_ru: Структура книги

source: This book has its origins in French publisher Eyrolles' “Administrator's Handbook” collection, and keeps the same approach of revolving around a case study providing both support and illustration for all topics being addressed.
it_it: Questo libro ha le sue origini nella serie «Administrator's Handbook» dell'editore francese Eyrolles e mantiene lo stessa approccio di incentrarsi su un caso di studio che fornisce sia il supporto che l'illustrazione per tutti gli argomenti affrontati.
ru_ru: Эта книга впервый появилась в серии «Настольная книга администратора» французского издательства Eyerolles, и следует тому же подходу, будучи построенной вокруг учебного примера, поясняющего и иллюстрирующего все обсуждаемые темы.

source: <emphasis>NOTE</emphasis> Web site, authors' email
it_it: <emphasis>NOTA</emphasis> Sito Web, email degli autori
ru_ru: <emphasis>ЗАМЕТКА</emphasis> Веб-сайт, e-mail авторов

source: This book has its own website, which hosts whatever elements that can make it more useful. In particular, it includes an online version of the book with clickable links, and possible errata. Feel free to browse it and to leave us some feedback. We will be happy to read your comments or support messages. Send them by email to <email>hertzog@debian.org</email> (Raphaël) and <email>lolando@debian.org</email> (Roland). <ulink type="block" url="http://debian-handbook.info/" />
it_it: Per questo libro è stato realizzato uno specifico sito web completo di tanti strumenti che lo rendono più utile. In particolare, include una versione online del libro con collegamenti navigabili ed eventuali errata. Tutti possono navigare nel sito a piacere e lasciare feedback. Commenti o messaggi di supporto sono i benvenuti. Potete inviarli via email a <email>hertzog@debian.org</email> (Raphaël) e <email>lolando@debian.org</email> (Roland). <ulink type="block" url="http://debian-handbook.info/" />
ru_ru: У этой книги есть собственный веб-сайт, который содержит множество полезных вещей. В частности, там есть онлайн-версия книги с гиперссылками и, возможно, списком известных ошибок. Мы открыты для обратной связи и всегда рады прочитать ваши предложения или тёплые слова. Вы можете прислать их на почту <email>hertzog@debian.org</email> (Рафаэль) или <email>lolando@debian.org</email> (Ролан). <ulink type="block" url="http://debian-handbook.info/" />

source: <emphasis role="strong">Chapter 1</emphasis> focuses on a non-technical presentation of the Debian project and describes its goals and organization. These aspects are important because they define a general framework that others chapters will complete with more concrete information.
it_it: Il <emphasis role="strong">capitolo 1</emphasis> si concentra su una presentazione del progetto Debian descrivendone gli obiettivi e la sua organizzazione. Questi aspetti sono importanti perché permettono di definire un quadro generale che sarà completato con informazioni più dettagliate dai successivi capitoli.
ru_ru: <emphasis role="strong">Глава 1</emphasis> посвящена нетехническому представлению проекта Debian и описывает его цели и организацию. Эти вопросы очень важны, потому что они определяют общий каркас, которые последующие главы заполнят более конкретной информацией.

source: <emphasis role="strong">Chapters 2 and 3</emphasis> provide a broad outline of the case study. At this point, novice readers can take the time to read <emphasis role="strong">appendix B</emphasis>, where they will find a short remedial course explaining a number of basic computing notions, as well as concepts inherent to any Unix system.
it_it: I <emphasis role="strong">capitoli 2 e 3</emphasis> illustreranno a grandi linee un caso di studio reale. A questo punto, i lettori meno esperti possono dedicare un po' di tempo a leggere l'<emphasis role="strong">appendice B</emphasis>, dove potranno trovare un breve corso di recupero che spiega una serie di nozioni informatiche di base, nonché i concetti principali relativi a qualsiasi sistema Unix.
ru_ru: <emphasis role="strong">Главы 2 и 3</emphasis> освещают общие черты учебного примера. На этом этапе новички могут обратиться к <emphasis role="strong">приложению B</emphasis>, где они найдут краткий курс, объясняющий основные компьютерные понятия, а также принципы, общие для всех Unix-систем.

source: To get on with our real subject matter, we will quite naturally start with the installation process (<emphasis role="strong">chapter 4</emphasis>); <emphasis role="strong">chapters 5 and 6</emphasis> will unveil basic tools that any Debian administrator will use, such as those of the <emphasis role="strong">APT</emphasis> family, which is largely responsible for the distribution's excellent reputation. These chapters are in no way reserved to professionals, since everyone is their own administrator at home.
it_it: Per proseguire con il nostro caso reale, partiremo naturalmente con il processo di installazione (<emphasis role="strong">capitolo 4</emphasis>); i <emphasis role="strong">capitoli 5 e 6</emphasis> ci porteranno alla scoperta dei principali strumenti che ogni amministratore di Debian utilizzerà, come quelli della famiglia <emphasis role="strong">APT</emphasis>, che sono in larga parte i responsabili della eccellente reputazione maturata da questa distribuzione. Questi capitoli non sono dedicati ai soli professionisti in quanto ognuno è amministratore del proprio computer.
ru_ru: Переходя непосредственно к нашей теме, мы вполне естественно начнём с процесса установки в (<emphasis role="strong">главе 4</emphasis>); <emphasis role="strong">главы 5 и 6</emphasis> расскажут об основных инструментах, которые использует любой администратор Debian, таких как инструменты семейства <emphasis role="strong">APT</emphasis>, которые во многом определили отличную репутацию дистрибутива. Эти главы предназначены не только для профессионалов, потому что каждый является администратором своей собственной домашней системы.
