Repository: binary-com/mobile
Catalog: */02_case-study.po
Languages: id_id

source: Strong Growth
id_id: Pertumbuhan Kuat

source: Master Plan
id_id: Rencana Induk

source: Migration
id_id: Migrasi

source: Cost Reduction
id_id: Mengurangi Biaya

source: Presenting the Case Study
id_id: Memersembahkan Studi Kasus

source: In the context of this book, you are the system administrator of a growing small business. The time has come for you to redefine the information systems master plan for the coming year in collaboration with your directors. You choose to progressively migrate to Debian, both for practical and economical reasons. Let's see into more detail what's in store for you…
id_id: Dalam konteks buku ini, Anda adalah administrator sistem bisnis kecil yang bertumbuh. Waktunya telah tiba bagi Anda untuk mendefinisikan ulang rencana induk sistem informasi untuk tahun mendatang dalam kolaborasi dengan direksi Anda. Anda memilih untuk memigrasikan sistem secara progresif ke Debian dengan alasan yang lebih praktis dan ekonomi. Mari lihat lebih mendetail apa yang ada untuk Anda…

source: We have envisioned this case study to approach all modern information system services currently used in a medium sized company. After reading this book, you will have all of the elements necessary to install Debian on your servers and fly on your own wings. You will also learn how to effectively find information in the event of difficulties.
id_id: Kami telah membayang studi kasus ini mendekati seluruh layanan sistem informasi modern yang saat ini digunakan di perusaan menengah. Setelah membaca buku ini, Anda akan memiliki seluruh elemen yang diperlukan untuk menginstall Debian di server Anda dan terbang dengan sayap Anda sendiri. Anda juga akan belajar bagaimana menemukan informasi secara efektif pada saat kesulitan.

source: Fast Growing IT Needs
id_id: Kebutuhan Pertumbuhan IT yang Cepat

source: Falcot Corp is a manufacturer of high quality audio equipment. The company is growing strongly, and has two facilities, one in Saint-Étienne, and another in Montpellier. The former has around 150 employees; it hosts a factory for the manufacturing of speakers, a design lab, and all administrative office. The Montpellier site is smaller, with only about 50 workers, and produces amplifiers.
id_id: Falcot Corp ialah pembuat perlatan audio yang berkualitas tinggi. Perusahaan tersebut tumbuh kuat, dan memiliki dua fasilitas, satu di Saint-Etienne, dan lainnya di Montpellier. Dulu memiliki sekitar 150 karyawan; rumah bagi perusahaan untuk pembuatan speaker, sebuah laboratorium desain, dan kantor administrasi. Situs Montpeller lebih kecil, hanya sekitar 50 pekerja, dan memroduksi amplifier.

source: <emphasis>NOTE</emphasis> Fictional company created for case study
id_id: <emphasis>CATATAN</emphasis> Perusahaan fiktif dibuat untuk studi kasus

source: The Falcot Corp company used as an example here is completely fictional. Any resemblance to an existing company is purely coincidental. Likewise, some example data throughout this book may be fictional.
id_id: Perusahaan Falcot Corp yang digunakan sebagai contoh di sini benar-benar fiktif. Kesamaan dengan perusahaan yang ada sepenuhnya adalah kebetulan. Demikian pula, beberapa contoh data di seluruh buku ini mungkin fiktif.

source: The computer system has had difficulty keeping up with the company's growth, so they are now determined to completely redefine it to meet various goals established by management:
id_id: Sistem komputer mengalami kesulitan menjaga dengan pertumbuhan perusahaan, maka sekarang mereka telah ditentukan untuk mendefinisikan kembali guna menyesuaikan dengan tujuan yang dibuat oleh manajemen:

source: modern, easily scalable infrastructure;
id_id: modern, infrastruktur yang terukur;

source: reducing cost of software licenses thanks to use of Open Source software;
id_id: mengurangi biaya lisensi perangkat lunak terima kasih atas penggunaan perangkat luna Sumber Terbuka;

source: installation of an e-commerce website, possibly B2B (business to business, i.e. linking of information systems between different companies, such as a supplier and its clients);
id_id: pemasangan sebuah website e-commerce, mungkin B2B (bussines to bussiness, misalnya menghubungkan sistem informasi antara perusahaan yang berbeda, seperti sebuah supplier dan cliennya);

source: significant improvement in security to better protect trade secrets related to new products.
id_id: kemajuan keamanan yang lebih signifikan untuk melindungi rahasia perdagangan yang berhubungan dengan produk baru.

source: The entire information system will be overhauled with these goals in mind.
id_id: Seluruh sistem informasi akan dirombak dengan tujuan tersebut.

source: <primary>master plan</primary>
id_id: <primary>rencana induk</primary>

source: <primary>migration</primary>
id_id: <primary>migrasi</primary>

source: With your collaboration, IT management has conducted a slightly more extensive study, identifying some constraints and defining a plan for migration to the chosen Open Source system, Debian.
id_id: Dengan kolaborasi Anda, manajemen IT telah dilakukan pembelajaran yang sedikit lebih luas, mengidentifikasi beberapa kendala dan menentukan rencana migrasi untuk memilis sistem Sumber Terbuka, Debian.

source: A significant constraint identified is that the accounting department uses specific software, which only runs on <trademark>Microsoft Windows</trademark>. The laboratory, for its part, uses computer aided design software that runs on <trademark>MacOS X</trademark>.
id_id: Sebuah kendala penting teridentifikasi bahwa departemen akuntan menggunakan perangkat lunak spesifik, yang hanya berjalan di <trademark>Microsoft Windows</trademark>. Laboratorium, pada bagiannya, menggunakan bantuan komputer perangkan lunak desain yang berjalan di <trademark>MacOS X</trademark>.

source: Overview of the Falcot Corp network
id_id: Ikhtisar jaringan Falcot Corp

source: The switch to Debian will be gradual; a small business, with limited means, cannot reasonably change everything overnight. For starters, the IT staff must be trained in Debian administration. The servers will then be converted, starting with the network infrastructure (routers, firewalls, etc.) followed by the user services (file sharing, Web, SMTP, etc.). Then the office computers will be gradually migrated to Debian, for each department to be trained (internally) during the deployment of the new system.
id_id: Perpindahan ke Debian akan bertingkat; bisnis kecil, dengan maksud terbatas, tidak dapat mengubah apapun dalam semalam. Untuk awalan, staff IT harus dilatih dalam mengadministrasi Debian. Server kemudian dikonversi, dimulai dengan infrastruktur jaringan (router, firewall, dll.) diikuti dengan layanan pengguna (file sharing, Web, SMTP, dll.). Kemudian komputer kantor akan secara bertahap dimigrasikan ke Debian, untuk setiap departemen dilatih (secara internal) selama masa pengembangan sistem baru.

source: Why a GNU/Linux Distribution?
id_id: Mengapa Distribusi GNU/Linux?

source: <emphasis>BACK TO BASICS</emphasis> Linux or GNU/Linux?
id_id: <emphasis>KEMBALI KE DASAR</emphasis> Linux atau GNU/Linux?

source: Linux, as you already know, is only a kernel. The expressions, “Linux distribution” and “Linux system” are, thus, incorrect: they are, in reality, distributions or systems <emphasis>based on</emphasis> Linux. These expressions fail to mention the software that always complete this kernel, among which are the programs developed by the GNU Project. Dr. Richard Stallman, founder of this project, insists that the expression “GNU/Linux” be systematically used, in order to better recognize the important contributions made by the GNU Project and the principles of freedom upon which they are founded.
id_id: Linux, seperti yang telah Anda ketahui, hanyalah sebuah kernel. Ekspresi tersebut, “Distribusi Linux” dan “Sistem Linux”, salah: itu, kenyataannya, distribusi atau sistem <emphasis>berbasis</emphasis> Linux. Ekepresi ini gagal menyebutkan perangkat lunak yang selalu melengkapi kernel ini, antara program yang dikembangkan oleh Proyek GNU. Dr. Richard Stallman, penemu proyek ini, bersikeras bahwa ekspresi “GNU/Linux” digunakan sistemis, agar pengenalan yang lebih baik akan kontribusi penting yang dibuat oleh Proyek GNU dan prinsip kebebasan yang ditemukannya.

source: Debian has chosen to follow this recommendation, and, thus, name its distributions accordingly (thus, the latest stable release is Debian GNU/Linux 7).
id_id: Debian telah memilih untuk mengikuti rekomendasi ini, dan, memberi nama distribusi ini demikian (nah, rilis stabil terkini ialah Debian GNU/Linux 7).

source: Several factors have dictated this choice. The system administrator, who was familiar with this distribution, ensured it was listed among the candidates for the computer system overhaul. Difficult economic conditions and ferocious competition have limited the budget for this operation, despite its critical importance for the future of the company. This is why Open Source solutions were swiftly chosen: several recent studies indicate they are less expensive than proprietary solutions while providing equal or better quality of service so long as qualified personnel are available to run them.
id_id: Beberapa faktor telah didikte pilihan ini. Administrator sistem, yang familiar dengan distribusi ini, meyakini ini telah terdaftar antara kandidat untuk pemeriksaan sistem komputer. Kondisi ekonomi yang sulit dan kompetisi yang ganas membatasi budget untuk operasi ini, di samping kepentingan kritis untuk masa depan perusahaan. Itulah mengapa solusi Sumber Terbuka dipilih: beberapa studi terkini mengindikasikan hal ini lebih murah ketimbang solusi berbayar ketika menyediakan persamaan atau kualitas layanan jangka panjang selama personil yang mampu tersedia untuk menjalankannya.

source: <emphasis>IN PRACTICE</emphasis> Total cost of ownership (TCO)
id_id: <emphasis>DALAM PRAKTEKNYA</emphasis> Harga total kepemilikan (TCO)

source: <primary>Total Cost of Ownership</primary>
id_id: <primary>Harga Total Kepemilikan</primary>

source: The Total Cost of Ownership is the total of all money expended for the possession or acquisition of an item, in this case referring to the operating system. This price includes any possible license fee, costs for training personnel to work with the new software, replacement of machines that are too slow, additional repairs, etc. Everything arising directly from the initial choice is taken into account.
id_id: Harga Total Kepemilikan ialah total seluruh uang yang dibelanjakan untuk memiliki atau mengakuisisi sebuah item, dalam kasus ini ialah sistem operasi. Harga ini termasuk beberapa kemungkinan harga lisensi, harga untuk melatih personil untuk bekerja dengan perangkat lunak baru, penggantian mesin yang sangat lambat, beberapa perbaikan, dll. Semuanya yang timbul langsung dari pilihan utama diambil ke dalam akun.

source: This TCO, which varies according to the criteria chosen in the assessment thereof, is rarely significant when taken in isolation. However, it is very interesting to compare TCOs for different options if they are calculated according to the same rules. This assessment table is, thus, of paramount importance, and it is easy to manipulate it in order to draw a predefined conclusion. Thus, the TCO for a single machine doesn't make sense, since the cost of an administrator is also reflected in the total number of machines they manage, a number which obviously depends on the operating system and tools proposed.
id_id: TCO ini, yang bervariasi berdasarkan kriteria yang dipilih dalam assessmen karenanya, jarang penting kwtikan diambil dalam isolasi. Namun, ini sangat menarik untuk membandingkan TCI untuk pilihan yang berbeda jika dihitung berdasarkan aturan yang sama. Tabel assessmen ini, demikian, sangat penting, dan mudah dimanipulasi untuk menggambarkan definisi kesimpulan. Nah, TCO untuk sebuah mesin tidak akan masuk akal, jika harga seorang administrator juga merefleksikan jumlah total mesin yang mereka kelola, jumlah yang biasanya tergantung pada sistem operasi dan alat yan diajukan.

source: Among free operating systems, the IT department looked at the free BSD systems (OpenBSD, FreeBSD, and NetBSD), GNU Hurd, and Linux distributions. GNU Hurd, which has not yet released a stable version, was immediately rejected. The choice is simpler between BSD and Linux. The former have many merits, especially on servers. Pragmatism, however, led to choosing a Linux system, since its installed base and popularity are both very significant and have many positive consequences. One of these consequences is that it is easier to find qualified personnel to administer Linux machines than technicians experienced with BSD. Furthermore, Linux adapts to newer hardware faster than BSD (although they are often neck and neck in this race). Finally, Linux distributions are often more adapted to user-friendly graphical user interfaces, indispensable for beginners during migration of all office machines to a new system.
id_id: Antara sistem operasi gratis, departemen IT melihat pada sistem free BSD (OpenBSD, FreeBSD, dan NetBSD), GNU Hurd, dan distribusi Linux. GNU Hurd, yang belum dirilis versi stabilnya, akan segera ditolak. Pilihannya lebih sederhana antara BSD dan Linux. Sebelumnya memiliki beberapa kepantasan, spesifiknya pada server. Paradigmanya, akan tetapi, menuntun untuk memilih sistem Linux, karena dasarnya terinstall dan popularitas keduanya sangat penting dan memiliki konsekuensi positif. Salah satu konsekuensinya ialah bahwa ini lebih mudah untuk menemukan personil yang mampu untuk mengelola mesin Linux daripada teknisi berpengalaman dengan BSD. Lebih jauh, Linux mengadaptasi perangkat keras lebih cepat daripada BSD (meskipun seringkali bahu membahu dalam perlombaan ini). Akhirnya, distribusi Linux seringkali diadaptasi pada antarmuka pengguna grafis yang ramah pengguna, sangat diperlukan untuk pemula selama migrasi semua mesin kantor pada sistem baru.

source: <emphasis>ALTERNATIVE</emphasis> Debian GNU/kFreeBSD
id_id: <emphasis>ALTERNATIF</emphasis> Debian GNU/kFreeBSD

source: Since Debian <emphasis role="distribution">Squeeze</emphasis>, it is possible to use Debian with a FreeBSD kernel on 32 and 64 bit computers; this is what the <literal>kfreebsd-i386</literal> and <literal>kfreebsd-amd64</literal> architectures mean. While these architectures are labeled “experimental” (Technology Preview), about 90 % of the software packaged by Debian is available for them.
id_id: Sejak Debian <emphasis role="distribution">Squeeze</emphasis>, memungkinkan untuk menggunakan Debian dengan FreeBSD kernal pada komputer 32 dan 64 bit; inilah apa yang dimaksud arsitektur <literal>kfreebsd-i386</literal> dan <literal>kfreebsd-amd64</literal>. Sementara arsitektur ini dilabeli “experimental” (Tinjauan Teknologi), sekitar 90 % perangkat lunak yang dipaketkan oleh Debian tersedia untuknya.

source: These architectures may be an appropriate choice for Falcot Corp administrators, especially for a firewall (the kernel supports three different firewalls: IPF, IPFW, PF) or for a NAS (network attached storage system, for which the ZFS filesystem has been tested and approved).
id_id: Arsitektur ini mungkin pilihan cocok untuk administrator Falcot Corp, khususnya untuk firewall (kernel mendukung perbedaan firewall ini: IPF, IPFW, PF) atau untuk NAS (sistem Network Attached Storage, sistem berkas ZFS telah dites dan diterima).

source: Why the Debian Distribution?
id_id: Mengapa Distribusi Debian?

source: Once the Linux family has been selected, a more specific option must be chosen. Again, there are plenty of criteria to consider. The chosen distribution must be able to operate for several years, since the migration from one to another would entail additional costs (although less than if the migration were between two totally different operating systems, such as Windows or Mac OS).
id_id: Sekali keluarga Linux telah terpilih, pilihan yang lebih spesifik harus diambil. Lagi, ada banyak kriteria penentuan. Distribusi yang dipilih harus dapat beroperasi untuk beberapa tahun, karena migrasi dari satu ke yang lainnya akan memerlukan biaya tambahan (meskipun lebih sedikit jika migrasi antara dua sistem operasi yang benar-benar berbeda, seperti Windows atau Mac OS).

source: Sustainability is, thus, essential, and it must guarantee regular updates and security patches over several years. The timing of updates is also significant, since, with so many machines to manage, Falcot Corp can not handle this complex operation too frequently. The IT department, therefore, insists on running the latest stable version of the distribution, benefiting from the best technical assistance, and guaranteed security patches. In effect, security updates are generally only guaranteed for a limited duration on older versions of a distribution.
id_id: Keberlanjutan ialah penting, dan harus menjamin perbaruan yang rutin dan perbaikan keamanan selama beberapa tahun. Waktu pembaruan juga penting, karena, dengan begitu banyak mesin yang dikelola, Falcot Corp tidak dapat terlalu sering menangani operasi rumit ini. Departemen IT, karenanya, keharusan menjalankan rilis stabil terkini dari distro, keuntungan dari bantuan teknis yang terbaik, dan jaminan perbaikan keamanan. Efeknya, perbaruan keamanan umumnya dijamin untuk jangka waktu yang terbatas untuk versi lawas dari distro.

source: Finally, for reasons of homogeneity and ease of administration, the same distribution must run on all the servers (some of which are Sparc machines, currently running Solaris) and office computers.
id_id: Akhirnya, untuk alasan kebersamaan dan kemudahan administrasi, distro yang sama harus dijalankan pada semua server (beberapa mesin Sparc, saat ini menggunakan Solaris) dan komputer kantor.

source: Commercial and Community Driven Distributions
id_id: Komersial dan Dukungan Komunitas Distro

source: There are two main categories of Linux distributions: commercial and community driven. The former, developed by companies, are sold with commercial support services. The latter are developed according to the same open development model as the free software of which they are comprised.
id_id: Ada dua kategori utama Distro Linux: komersial dan dukungan komunitas. Dahulu, dikembangkan oleh perusahaan, dijual dengan dukungan layanan komersil. Belakangan dikembangkan berdasarkan model pengembangan terbukayang sama dengan perangkat lunak bebas yang dibandingkan.

source: A commercial distribution will have, thus, a tendency to release new versions more frequently, in order to better market updates and associated services. Their future is directly connected to the commercial success of their company, and many have already disappeared (Caldera Linux, StormLinux, etc.).
id_id: Distro komersial akan memiliki, itu, tendensi untuk sering merilis versi terbaru, agar perbaruan pasar lebih baik dan layanan yang sama. Masa depannya langsung terhubung pada kesuksesan komersial perusahaannya, dan beberapa telah menghilang (Caldera Linux, Storm Linux, dll.).

source: A community distribution doesn't follow any schedule but its own. Like the Linux kernel, new versions are released when they are stable, never before. Its survival is guaranteed, as long as it has enough individual developers or third party companies to support it.
id_id: Distro komunitas tidak mengikuti jadwal tapi dirinya sendiri. Seperti kernel Linux, versi terbaru dirilis ketika telah stabil, jika belum stabil tak akan dirilis. Kehidupannya dijamin, selama masih cukup pengembang indivual atau perusahaan pihak ketiga yang mendukungnya.

source: <primary>distribution</primary><secondary>community Linux distribution</secondary>
id_id: <primary>distro</primary><secondary>distro komunitas Linux</secondary>

source: <primary>distribution</primary><secondary>commercial Linux distribution</secondary>
id_id: <primary>distro</primary><secondary>distro Linux komersial</secondary>

source: A comparison of various Linux distributions led to the choice of Debian for various reasons:
id_id: Sebuah perbandingan berbagai distro Linux mengerucut pada pilihan Debian untuk berbagai alasan:

source: It is a community distribution, with development ensured independently from any commercial constraints; its objectives are, thus, essentially of a technical nature, which seem to favor the overall quality of the product.
id_id: Merupakan distro komunitas, dengan pengembangannya dijamin independen dari kungkungan komersial; tujuannya ialah, alam teknikal yang alami, yang tampaknya mendukung keseluruhan kualitas produk.

source: Of all community distributions, it is the most significant from many perspectives: in number of contributors, number of software packages available, and years of continuous existence. The size of its community is an incontestable witness to its continuity.
id_id: Pada semua distro komunitas, inilah yang paling utama dari banyak prespektif: dalam jumlah kontributor, jumlah paket perangkat lunak tersedia, dan tahun eksistensi yang berkelanjutan. Ukuran komunitasnya tak diragukan pada keberlanjutannya.

source: Statistically, new versions are released every 18 to 24 months, a schedule which is agreeable to administrators.
id_id: Secara statis, versi terbaru dirilis setiap 18 hingga 24 bulan, sebuah jadwal yang dapat disetujui oleh administrator.

source: A survey of several French service companies specialized in free software has shown that all of them provide technical assistance for Debian; it is also, for many of them, their chosen distribution, internally. This diversity of potential providers is a major asset for Falcot Corp's independence.
id_id: Sebuah survey beberapa perusahaan layanan Prancis khusus perangkat lunak bebas bahwa semuanya menyediakan asisten teknis untuk Debian; juga, untuk beberapa, distro pilihan mereka, secara internal. Keragaman potensi penyedia ialah aset utama untuk independensi Falcot Corp.

source: Finally, Debian is available on a multitude of architectures, including Sparc; it will, thus, be possible to install it on Falcot Corp's several Sun servers.
id_id: Akhirnya, Debian tersedia pada banyak arsitektur, termasuk Sparc; yang akan memungkinkan menginstallnya pada server Sun milik Falcot Corp.

source: Once Debian has been chosen, the matter of which version to use must be decided. Let us see why the administrators have picked Debian Wheezy.
id_id: Sekali Debian telah dipilih, masalah versi yang akan digunakan harus ditentukan. Mari kita lihat mengapa administrator memilih Debian Wheezy.

source: Why Debian Wheezy?
id_id: Mengapa Debian Wheezy

source: Every Debian release starts its life as a continuously changing distribution, also known as “<emphasis role="distribution">Testing</emphasis>”. But at the time when you will read those lines, Debian Wheezy should be the latest “<emphasis role="distribution">Stable</emphasis>” version of Debian.
id_id: Setiap rilis Debian dimulai kehidupannya mengubah disto secara berkelanjutan, juga diketahui sebagai “<emphasis role="distribution">Testing</emphasis>”. Namun saat ini ketika Anda membaca baris tersebut, Debian Wheezy semestinya merupakan versi terkini Debian “<emphasis role="distribution">Stable</emphasis>”.
