Repository: binary-com/mobile
Catalog: */02_case-study.po
Languages: id_id

source: The choice of Debian Wheezy is well justified based on the fact that any administrator concerned about the quality of their servers will naturally gravitate towards the stable version of Debian. Even if the previous stable release might still be supported for a while, Falcot administrators aren't considering it because its support period will not last long enough and because the latest version brings new interesting features that they care about.
id_id: Memilih Debian Wheezy cukup benar berdasarkan kenyataan bahwa perhatian administrator tentang kualitas server mereka alaminya akan menuju ke arah versi stabil dari Debian. Meskipun jika rilis stabil sebelumnya mungkin masih didukung untuk beberapa waktu, administrator Falcot tidak memertimbangkannya karena periode dukungan tidak akan cukup lama karena versi terkini membawa fitur yang menarik.
