Repository: binary-com/mobile
Catalog: */03_existing-setup.po
Languages: id_id

source: Existing Setup
id_id: Setingan yang Ada

source: Reuse
id_id: Penggunaan Kembali

source: Migration
id_id: Migrasi

source: Analyzing the Existing Setup and Migrating
id_id: Menganalisa Setingan yang Ada dan Memigrasikannya

source: Any computer system overhaul should take the existing system into account. This allows reuse of available resources as much as possible and guarantees interoperability of the various elements comprising the system. This study will introduce a generic framework to follow in any migration of a computing infrastructure to Linux.
id_id: Beberapa kerusakan sistem komputer harus memerhatikan sistem yang ada. Hal ini mengizinkan penggunaan kembali sumberdaya yang tersesia sebanyak mungkin dan menjamin interoperabilitas dari berbagai elemen perbandingan sistem. Studi ini akan mengenalkan kerangka umum yang diikuti dalam migrasi infrastruktur komputer ke Linux.

source: Coexistence in Heterogeneous Environments
id_id: Berdampingan dalam Lingkungan yang Heterogen

source: <primary>environment</primary><secondary>heterogeneous environment</secondary>
id_id: <primary>lingkungan</primary><secondary>lingkungan yang heterogen</secondary>

source: Debian integrates very well in all types of existing environments and plays well with any other operating system. This near-perfect harmony comes from market pressure which demands that software publishers develop programs that follow standards. Compliance with standards allow administrators to switch out programs: clients or servers, whether free or not.
id_id: Debian sangat baik dalam mengintegrasikan berbagai lingkungan yang ada dan bermain dengan baik dengan beberapa sistem operasi lain. Harmoni yang mendekati sempurna ini datang dari tekanan pasar yang menuntut bahwa penerbit perangkat lunak mengembangkan program yang mengikuti standar. Penyesuaian dengan standar mengizinkan administrator untuk berganti program: klien atau server, entah itu bebas (free) atau tidak.

source: Integration with Windows Machines
id_id: Integrasi dengan Mesin Windows

source: Samba's SMB/CIFS support ensures excellent communication within a Windows context. It shares files and print queues to Windows clients and includes software that allow a Linux machine to use resources available on Windows servers.
id_id: Dukngan SMB/CIFS Samba memastikan komunikasi sempurna dengan konteks Windows. Berbagi berkas dan antrian cetak pada klien Windows dan termasuk perangkat lunak yang mengizinkan mesin Linux untuk menggunakan sumberdaya yang ada pada server Windows.

source: <emphasis>TOOL</emphasis> Samba
id_id: <emphasis>ALAT</emphasis> Samba

source: Samba version 2 behaves like a Windows NT server (authentication, files, print queues, downloading printer drivers, DFS, etc.) Version 3 works with Active Directory, brings interoperability with NT4 domain controllers, and supports RPCs (Remote Procedure Calls). Version 4 is a rewrite (still experimental), the purpose of which is to provide functionality of a domain controller compatible with Active Directory.
id_id: Samba versi 2 berperilaku seperti server Windows NT (otentikasi, berkas, antrian cetak, mengunduh penggerak printer, DFS, dll.) Versi 3 bekerja dengan Active Directory, membawa interoperabilitas dengan domain kontroller NT4, dan mendukung RPC (Remote Procedure Calls), Versi 4 ialah penulisan ulang (masin eksperimental), tujuannya menyediakan fungsionalitas domain kontroler yang cocok dengan Active Directory.

source: Integration with Mac OS machines
id_id: Integrasi dengan mesin Mac OS

source: Mac OS machines provide, and are able to use, network services such as file servers and printer sharing. These services are published on the local network, which allows other machines to discover them and make use of them without any manual configuration, using the Bonjour implementation of the Zeroconf protocol suite. Debian includes another implementation, called Avahi, which provides the same functionality.
id_id: Mesin Mac OS menyediakan, dan dapat menggunakan, layanan jaringan seperti server berkas dan printer sharing. Layanan ini dipublikasikan pada jaringan lokal, yang memungkinkan mesin lain untuk menemukan dan menggunakannya tanpa konfigurasi manual, menggunakan implementasi Bonjour pada protokol Zeroconf. Debian menyertakan implementasi lain, yang disebut Avahi, yang menyediakan fungsionalitas yang sama.

source: In the other direction, the Netatalk daemon can be used to provide file servers to Mac OSX machines on the network. It implements the AFP (AppleShare) protocol as well as the required notifications so that the servers can be autodiscovered by the Mac OSX clients.
id_id: Pada arah yang lain, daemon Nettalk dapat digunakan untuk menyediakan server berkas untuk mesin Mac OSX pada jaringan. Mengimplementasikan protokol AFP (AppleShare) sebagaimana pemberitahuan yang diperlukan sehingga server dapat ditemukan secara otomatis oleh klien Mac OSX.

source: Older Mac OS networks (before Mac OSX) used a different protocol called AppleTalk. For environments involving machines using this protocol, Netatalk also provides the AppleTalk protocol (in fact, it started as a reimplementation of that protocol). It ensures the operation of the file server and print queues, as well as time server (clock synchronization). Its router function allows interconnection with AppleTalk networks.
id_id: Jaringan Mac OS tua (sebelum Mac OSX) menggunakan protokol berbeda yang disebut AppleTalk. Untuk lingkungan yang melibatkan mesin menggunakan protokol ini, Netatalk juga menyediakan protokol AppleTalk (kenyataannya, dimulai dengan implementasi ulang protokol tersebut). Hal ini memastikan operasi server berkas dan antrian cetak, sebagaimana server waktu (sinkronisasi jam). Fungsi protokolnya mengizinkan interkoneksi dengan jaringan AppleTalk.

source: Integration with Other Linux/Unix Machines
id_id: Integrasi denggan Mesin Linux/Unix lainnya

source: Finally, NFS and NIS, both included, guarantee interaction with Unix systems. NFS ensures file server functionality, while NIS creates user directories. The BSD printing layer, used by most Unix systems, also allows sharing of print queues.
id_id: Akhirnya, NFS dan NIS, keduanya termasuk, jaminan interaksi dengan sistem Unix. NFS memastikan fungsionalitas file server, sedangkan NIS membuat direktori pengguna. Lapisan cetak BSD, digunakan oleh kebanyak sistem Unix, juga mengizinkan berbagi antrian cetak.

source: Coexistence of Debian with MacOS, Windows and Unix systems
id_id: Debian Berdampingan dengan MacOS, Windows, dan sistem Unix

source: How To Migrate
id_id: Bagaimana Bermigrasi

source: <primary>migration</primary>
id_id: <primary>migrasi</primary>

source: In order to guarantee continuity of the services, each computer migration must be planned and executed according to the plan. Whatever the operating system used, this principle never changes.
id_id: Untuk menjamin keberlanjutan layanan, setiap migrasi komputer harus direncanakan dan dieksekusi berdasarkan rencana. Apapun sistem operasi yang digunakan, prinsip ini tak pernah berubah.

source: Survey and Identify Services
id_id: Survey dan Mengidentifikasi Layanan

source: As simple as it seems, this step is essential. A serious administrator truly knows the principal roles of each server, but such roles can change, and sometimes experienced users may have installed “wild” services. Knowing that they exist will at least allow you to decide what to do with them, rather than delete them haphazardly.
id_id: Sesederhana seperti terlihat, langkah ini penting. Seorang administrator benar-benar tahu aturan prinsip masing-masing server, namun aturan dapat berubah, dan kadang pengguna berpengalaman mungkin telah memasang layanan yang “liar”. Mengetahui hal tersebut setidaknya akan mengizinkan Anda untuk memutuskan apa yang akan dilakukan dengannya, daripada menghapusnya semena-mena.

source: For this purpose, it is wise to inform your users of the project before migrating the server. To involve them in the project, it may be useful to install the most common free software programs on their desktops prior to migration, which they will come across again after the migration to Debian; OpenOffice.org and the Mozilla suite are the best examples here.
id_id: Untuk tujuan ini, alangkah bijak menginformasikan pengguna proyek Anda sebelum memigrasikan server. Melibatkan mereka pada proyek, mungkin akan berguna untuk menginstall program perangkat lunak bebas pada desktop mereka sebelum migrasi, yang mana mereka akan kembali setelah migrasi ke Debian; OpenOffice.org dan Mozilla ialah contoh terbaik di sini.

source: Network and Processes
id_id: Jaringan dan Proses

source: <indexterm><primary><command>nmap</command></primary></indexterm> The <command>nmap</command> tool (in the package with the same name) will quickly identify Internet services hosted by a network connected machine without even requiring to log in to it. Simply call the following command on another machine connected to the same network:
id_id: <indexterm><primary><command>nmap</command></primary></indexterm> Alat <command>nmap</command> (dalam paket dengan nama yang sama) akan mengidentifikasi secara cepat layanan Internet yang dihostkan oleh mesin jaringan terhubung tanpa perlu masuk ke dalamnya. Mudahnya panggil perintah berikut pada mesin yang terhubung pada jaringan yang sama:

source: <emphasis>ALTERNATIVE</emphasis> Use <command>netstat</command> to find the list of available services
id_id: <emphasis>ALTERNATIF</emphasis> Gunakan <command>netstat</command> untuk mencari daftar service yang tersedia

source: On a Linux machine, the <command>netstat -tupan</command> command will show the list of active or pending TCP sessions, as well UDP ports on which running programs are listening. This facilitates identification of services offered on the network.
id_id: Pada mesin Linux, perintah <command>netstat -tupan</command> akan menampilkan daftar sesi TCP aktif maupun pending, juga port UDP program berjalan yang mendengarkan. Fasilitas ini mengidentifikasi layanan yang ditawarkan oleh jaringan.

source: <emphasis>GOING FURTHER</emphasis> IPv6
id_id: <emphasis>LEBIH JAUH</emphasis> IPv6

source: Some network commands may work either with IPv4 (the default usually) or with IPv6. This is especially the case with the <command>nmap</command> and <command>netstat</command> commands, but also others, such as <command>route</command> or <command>ip</command>. The convention is that this behavior is enabled by the <parameter>-6</parameter> command-line option.
id_id: Beberapa perintah jaringan mungkin bekerja baik itu IPv4 (biasanya sebagai bawaan) atau IPv6. Khususnya dalam hal perintah <command>nmap</command> dan <command>netstat</command>, tetapi juga yang lainnya, seperti <command>route</command> atau <command>ip</command>. Konvensi ini dapat diaktifkan dengan opsi baris perintah <parameter>-6</parameter>.

source: If the server is a Unix machine offering shell accounts to users, it is interesting to determine if processes are executed in the background in the absence of their owner. The command <command>ps auxw</command> displays a list of all processes with their user identity. By checking this information against the output of the <command>who</command> command, which gives a list of logged in users, it is possible to identify wild servers or programs running in the background. Looking at <filename>crontabs</filename> (tables listing automatic actions scheduled by users) will often provide interesting information on functions fulfilled by the server (a complete explanation of <command>cron</command> is available in <xref linkend="sect.task-scheduling-cron-atd" />).
id_id: Jika server adalah mesin Unix yang menawarkan akun shell ke pengguna, menarik untuk menentukan apakah proses dieksekusi di background tanpa pengguna. Perintah <command>ps auxw</command> menampilkan daftar semua proses dengan identitas penggunanya. Dengan memeriksa informasi ini trhadap keluaran perintah <command>who</command>, yang menampilkan daftar pengguna yang login, memungkinkan untuk mengidentifikasi server atau program yang berjalan di background secara liar. Lihat di <filename>crontabs</filename> (tabel daftar aksi otomatis terjadwal oleh pengguna) seringkali menyediakan informasi menarik pada fungsi penuh oleh server (penjelasan lengkap tentang <command>cron</command> tersedia di <xref linkend="sect.task-scheduling-cron-atd" />).

source: In any case, it is essential to backup your servers: this allows recovery of information after the fact, when users will report specific problems due to the migration.
id_id: Pada beberapa kasus, penting untuk memback-up server Anda: memungkinkan pemulihan informasi setelah sesuatu dilakukan, ketika pengguna melaporkan masalah khusus disebabkan oleh migrasi.

source: Backing up the Configuration
id_id: Mem-back up Konfigurasi

source: It is wise to retain the configuration of every service identified in order to be able to install the equivalent on the updated server. The strict minimum is to print the configuration files and make a backup copy of them.
id_id: Bijaksana untuk memertahankan konfigurasi setiap layanan teridentifikasi agar dapat menginstall yang sesuai pada server yang diperbarui. Setidaknya cetak berkas konfigurasi dan buat backup salinannya.

source: For Unix machines, the configuration files are usually found in <filename>/etc/</filename>, but they may be located in a sub-directory of <filename>/usr/local/</filename>. This is the case if a program has been installed from sources, rather than with a package. One may also find them, in some cases, under <filename>/opt/</filename>.
id_id: Untuk mesin Unix, berkas konfigurasi biasanya ditemukan di <filename>/etc/</filename>, tetap mungkin juga terletak di sub-direktori <filename>/usr/local/</filename>. Dalam hal ini program telah diinstall dari sumber, daripada dengan paket. Satu mungkin dapat ditemukan, dalam beberapa kasus, di bawah <filename>/opt/</filename>.

source: For data managing services (such as databases), it is strongly recommended to export the data to a standard format that will be easily imported by the new software. Such a format is usually in text mode and documented; it may be, for example, an SQL dump for a database, or an LDIF file for an LDAP server.
id_id: Untuk mengelola layanan data (seperti basisdata), sangat direkomendasikan untuk mengekspor data ke format standar yang nantinya akan mudah diimpor oleh perangkat lunak baru. Seperti format yang biasanya berupa mode teks dan terdokumentasi; mungkin, sebagai contoh, SQL dump untuk basisdata, atau berkas LDIF untuk server LDAP.

source: Database backups
id_id: Backup basisdata

source: Each server software is different, and it is impossible to describe all existing cases in detail. Compare the documentation for the existing and the new software to identify the exportable (thus, re-importable) portions and those which will require manual handling. Reading this book will clarify the configuration of the main Linux server programs.
id_id: Setiap perangkat lunak server itu berbeda, dan tidak mungkin menjelaskan semua kasus secara detail. Bandingkan dokumentasi perangkat lunak yang ada dan yang baru apakah ada bagian yang dapat dieksport (dapat diimpor) dan yang memerlukan penanganan manual. Membaca buku ini akan menglarifikasi konfigurasi program server Linux utama.

source: Taking Over an Existing Debian Server
id_id: Mengambil Alih sebuah Server Debian yang Ada

source: <primary>recovering a Debian machine</primary>
id_id: <primary>memulihkan mesin Debian</primary>

source: <primary>exploring a Debian machine</primary>
id_id: <primary>mengeksplorasi mesin Debian</primary>

source: <primary>taking over a Debian server</primary>
id_id: <primary>mengambil alih server Debian</primary>

source: To effectively take over its maintenance, one may analyze a machine already running with Debian.
id_id: Agar pengambilalihan pemeliharaan efektif, pertama analisa mesin yang sedang berjalan dengan Debian.

source: The first file to check is <filename>/etc/debian_version</filename>, which usually contains the version number for the installed Debian system (it is part of the <emphasis>base-files</emphasis> package). If it indicates <literal><replaceable>codename</replaceable>/sid</literal>, it means that the system was updated with packages coming from one of the development distributions (either testing or unstable).
id_id: Berkas pertama yang dicek ialah <filename>/etc/debian_version</filename>, yang biasanya berisi nomor versi sistem Debian yang terinstall (bagian dari paket <emphasis>base-file</emphasis>). Jika menunjukkan <literal><replaceable>codename</replaceable>/sid</literal>, itu berarti sistem telah diperbarui dengan paket dari distribusi pengembangan (entah itu testing atau unstable).

source: The <command>apt-show-versions</command> program (from the Debian package of the same name) checks the list of installed packages and identifies the available versions. <command>aptitude</command> can also be used for these tasks, albeit in a less systematic manner.
id_id: Program <command>apt-show-versions</command> (dari paket Debian dengan nama sama) periksa daftar paket terinstall dan identifikasi versi yang tersedia. <command>aptitude</command> juga dapat digunakan untuk tugas ini, albeit dengan cara yang kurang semantik.

source: A glance at the <filename>/etc/apt/sources.list</filename> file will show where the installed Debian packages likely came from. If many unknown sources appear, the administrator may choose to completely reinstall the computer's system to ensure optimal compatibility with the software provided by Debian.
id_id: Sekilas pada berkas <filename>/etc/apt/sources.list</filename> akan menampilkan dari mana paket Debian terinstall. Jika ada beberapa nampak dari sumber tak diketahui, administrator mungkin memilih untuk menginstall ulang sepenuhnya sistem komputer untuk mengoptimalkan kompabilitas dengan perangkat lunak yang disediakan oleh Debian.

source: The <filename>sources.list</filename> file is often a good indicator: the majority of administrators keep, at least in comments, the list of APT sources that were previously used. But you should not forget that sources used in the past might have been deleted, and that some random packages grabbed on the Internet might have been manually installed (with the <command>dpkg</command> command). In this case, the machine is misleading in its appearance of “standard” Debian. This is why you should pay attention to any indication that will give away the presence of external packages (appearance of <filename>deb</filename> files in unusual directories, package version numbers with a special suffix indicating that it originated from outside the Debian project, such as <literal>ubuntu</literal> or <literal>lmde</literal>, etc.)
id_id: Berkas <filename>sources.list</filename> merupakan indokator yang baik: mayoritas administrator memertahankannya, setidaknya di komentar, daftar sumber APT yang digunakan sebelumnya. Namun Anda harus ingat bahwa mungkin sumber yang digunakan sebelumnya telah dihapus, dan beberapa paket yang diambil secara acak dari Internet mungkin telah diinstall secara manual (dengan perintah <command>dpkg</command>). Dalam hal ini, mesin mislead dalam tampilannya sebagai Debian “standard”. Ini alasan mengapa Anda harus memerhatikan beberapa indikasi yang akan memberikan presence pada paket eksternal (berkas <filename>deb</filename> nampak di direktori yang tak biasa, nomor versi paket dengan akhiran khusus mengindikasikan paket tersebut berasal dari luar proyek Debian, seperti <literal>ubuntu</literal> atau <literal>lmde</literal>, dll)

source: Likewise, it is interesting to analyze the contents of the <filename>/usr/local/</filename> directory, whose purpose is to contain programs compiled and installed manually. Listing software installed in this manner is instructive, since this raises questions on the reasons for not using the corresponding Debian package, if such a package exists.
id_id: Demikian pula, menarik untuk menganalisa isi dari direktori <filename>/usr/local/</filename>, yang tujuannya memang berisi program yang dicompile dan diinstall secara manual. Mendaftar perangkat lunak terinstall dengan cara ini adalah instruktif, karena ini menimbulkan pertanyaan pada alasan mengapa tidak menggunakan paket Debian yang sesuai, jika paket tersebut ada.

source: <emphasis>QUICK LOOK</emphasis> <emphasis role="pkg">cruft</emphasis>
id_id: <emphasis>LIHAT SEKILAS</emphasis> <emphasis role="pkg">cruft</emphasis>

source: The <emphasis role="pkg">cruft</emphasis> package proposes to list the available files that are not owned by any package. It has some filters (more or less effective, and more or less up to date) to avoid reporting some legitimate files (files generated by Debian packages, or generated configuration files not managed by <command>dpkg</command>, etc.).
id_id: Paket <emphasis role="pkg">cruft</emphasis> mendaftar semua berkas yang tidak dimiliki oleh paket manapun. Memiliki beberapa filter (lebih atau kurang efektif, dan lebih atau kurang up-to-date) menghindari beberapa laporan legitimasi berkas (berkas yang digenerate ooleh paket Debian, atau berkas konfigurasi yang digenerate tidak diatur oleh <command>dpkg</command>, dll.).

source: Be careful to not blindly delete everything that <command>cruft</command> might list!
id_id: Berhati-hatilan untuk tidak menghapus sembarangan apapun yang mungkin didaftar oleh <command>cruft</command>!

source: Installing Debian
id_id: Menginstall Debian

source: Once all the required information on the current server is known, we can shut it down and begin to install Debian on it.
id_id: Setelah seluruh informasi yang diperlukan pada server tersebut diketahui, kita dapat mematikannya dan mulai menginstall Debian.

source: <primary>architecture</primary>
id_id: <primary>arsitektur</primary>

source: To choose the appropriate version, we must know the computer's architecture. If it is a reasonably recent PC, it is most likely to be amd64 (older PCs were usually i386). In other cases, we can narrow down the possibilities according to the previously used system.
id_id: Untuk memilih versi yang sesuai, kita harut tahu arsitektur komputernya. Jika merupakan PC terkini, sepertinya amd64 (PC lawas biasanya i386). Dalam kasus lain, kita dapat memersempit kemungkinan menurut sistem yang sebelumnya digunakan.

source: <xref linkend="tab-corresp" xrefstyle="select: label nopage" /> is not intended to be exhaustive, but may be helpful. In any case, the original documentation for the computer is the most reliable source to find this information.
id_id: <xref linkend="tab-corresp" xrefstyle="select: label nopage" /> tidak dimaksudkan lengkap, tapi mungkin membantu. Dalam beberapa kasus, dokumentasi asli komputer merupakan sumber yang reliable untuk menemukan informasi ini.

source: Matching operating system and architecture
id_id: Sistem operasi dan arsitektur yang sesuai

source: Operating System
id_id: Sistem Operasi

source: Architecture(s)
id_id: Arsitektur

source: <emphasis>HARDWARE</emphasis> 64 bit PC vs 32 bit PC
id_id: <emphasis>PERANGKAT KERAS</emphasis> 64 bit PC vs 32 bit PC
