Repository: binary-com/mobile
Catalog: */03_existing-setup.po
Languages: id_id

source: Most recent computers have 64 bit Intel or AMD processors, compatible with older 32 bit processors; the software compiled for “i386” architecture thus works. On the other hand, this compatibility mode does not fully exploit the capabilities of these new processors. This is why Debian provides the “amd64” architecture, which works for recent AMD chips as well as Intel “em64t” processors (including most of the Core series), which are very similar to AMD64.
id_id: Kebanyakan komputer terkini memiliki 64 bit Intel atau prosesor AMD, cocok dengan prosesor 32 bit yang lebih lama; perangkat lunak yang dicompile untuk arsitektur “i386” yang bekerja. Selain itu, kecocokan ini tidak secara penuh mengeksplor kemampuan prosesor baru ini. Ini alasan mengapa Debian menyediakan arsitektur “amd64”, yang bekerja untuk chip AMD terkini sebagaimana prosesor Intel “em64t” (termasuk kebanyakan series Core), yang sangat sesuai dengan AMD64

source: Installing and Configuring the Selected Services
id_id: Menginstall dan Mengonfigurasi Layanan Terpilih

source: Once Debian is installed, we must install and configure one by one all of the services that this computer must host. The new configuration must take into consideration the prior one in order to ensure a smooth transition. All the information collected in the first two steps are useful to successfully complete this part.
id_id: Setelah Debian terinstall, kita harus menginstall dan mengonfigurasi satu per satu semua layanan yang komputer tersebut harus sajikan. Konfigurasi baru Konfigurasi baru harus memertimbangkan yang utama untuk memastikan transisi yang lembut. Seluruh informasi yang dikumpulkan pada kedua langkah sebelumnya berguna untuk menyelesaikan bagian ini.

source: Install the selected services
id_id: Install layanan terpilih

source: Prior to jumping in to this exercise with both feet, it is strongly recommended that you read the remainder of this book. After that you will have a more precise understanding of how to configure the expected services.
id_id: Sebelum melompat ke latihan ini dengan dua kaki, sangat disarankan Anda membaca peringatan pada buku ini. Setelah itu Anda akan lebih memahami bagaimana mengonfigurasi layanan yang diharapkan.
