Repository: binary-com/mobile
Catalog: */07_solving-problems.po
Languages: ar_ma

source: For high volume mailing lists, such as <email>debian-user@lists.debian.org</email>, it may be worthwhile to go through them as a discussion forum (or newsgroup). Gmane.org allows consultation of the Debian lists in this format. The list mentioned above is available at: <ulink type="block" url="http://dir.gmane.org/gmane.linux.debian.user" />
ar_ma: بالنسبة للقوائم البريدية ذات الأحجام الكبيرة، مثل <email>debian-user@lists.debian.org</email>، قد تستحق عناء تصفحها بشكل منتدى (أو مجموعة إخبارية). يسمح موقع Gmane.org بتصفح قوائم ديبيان بهذا الشكل. تتوفر القائمة المذكورة أعلاه على: <ulink type="block" url="http://dir.gmane.org/gmane.linux.debian.user" />

source: <emphasis>BACK TO BASICS</emphasis> Netiquette applies
ar_ma: <emphasis>أساسيات</emphasis> النتيكيت مطلوب

source: In general, for all correspondence on e-mail lists, the rules of Netiquette should be followed. This term refers to a set of common sense rules, from common courtesy to mistakes that should be avoided. <ulink type="block" url="http://tools.ietf.org/html/rfc1855" /> <indexterm><primary>Netiquette</primary></indexterm>
ar_ma: عمومًا، يجب اتباع قواعد النتيكيت (إتيكيت النت) في جميع المراسلات التي تتم عبر القوائم البريدية. يدل هذا المصطلح على مجموعة من القواعد المنطقية، تتراوح ما بين المجاملة المعروفة إلى الأخطاء التي يجب تفاديها. <ulink type="block" url="http://tools.ietf.org/html/rfc1855" /> <indexterm><primary>نتيكيت</primary></indexterm>

source: Reporting a Bug When a Problem Is Too Difficult
ar_ma: التبليغ عن علة عندما تكون المشكلة صعبة كثيرًا

source: <primary>report a bug</primary>
ar_ma: <primary>تبليغ علة</primary>

source: <primary>bug report</primary>
ar_ma: <primary>بلاغ علة</primary>

source: If all of your efforts to resolve a problem fail, it is possible that a resolution is not your responsibility, and that the problem is due to a bug in the program. In this case, the proper procedure is to report the bug to Debian or directly to the upstream developers. To do this, isolate the problem as much as possible and create a minimal test situation in which it can be reproduced. If you know which program is the apparent cause of the problem, you can find its corresponding package using the command, <command>dpkg -S <replaceable>file_in_question</replaceable></command>. Check the Bug Tracking System (<literal>http://bugs.debian.org/<replaceable>package</replaceable></literal>) to ensure that the bug has not already been reported. You can then send your own bug report, using the <command>reportbug</command> command, including as much information as possible, especially a complete description of those minimal test cases that will allow anyone to recreate the bug.
ar_ma: إذا فشلت جميع مساعيك لحل مشكلة ما، فمن الممكن أن حلها ليس مسؤوليتك، وأن المشكلة ناجمة عن علّة في البرنامج. في هذه الحالة، الإجراء المناسب هو تبليغ العلة إلى ديبيان أو مباشرة إلى المطور الأصلي. لعمل ذلك، اعزل المشكلة قدر المستطاع وأنشئ حالة اختبار مصغرة يمكن إنتاج المشكلة فيها. إذا كنت تعرف أي برنامج هو السبب الواضح للمشكلة، يمكنك العثور على حزمته باستخدام الأمر <command>dpkg -S <replaceable>file_in_question</replaceable></command>. تحقق من نظام تتبع العلل (<literal>http://bugs.debian.org/<replaceable>package</replaceable></literal>) للتأكد أن العلة لم تبلغ سابقًا. يمكنك عندها إرسال تقرير بالعلة، باستخدام الأمر <command>reportbug</command>، مع ذكر أكبر كمية من المعلومات، خصوصاً الوصف الكامل لحالات الاختبار المصغرة التي ستسمح لأي شخص بإعادة توليد العلة.

source: The elements of this chapter are a means of effectively resolving issues that the following chapters may bring about. Use them as often as necessary!
ar_ma: عناصر هذا الفصل هي وسائل فعالة لحل المشاكل التي قد تثيرها الفصول اللاحقة. استخدمها كلما دعت الحاجة!
