Repository: binary-com/mobile
Catalog: */07_solving-problems.po
Languages: ar_ma

source: Documentation
ar_ma: الوثائق

source: Solving problems
ar_ma: حل المشاكل

source: Log files
ar_ma: ملفات السجلات

source: Manual
ar_ma: كتيّب

source: Solving Problems and Finding Relevant Information
ar_ma: حل المشاكل والعثور على المعلومات ذات الصلة

source: For an administrator, the most important skill is to be able to cope with any situation, known or unknown. This chapter gives a number of methods that will — hopefully — allow you to isolate the cause of any problem that you will encounter, so that you may be able to resolve them.
ar_ma: إن أهم مهارة بالنسبة لمدير النظام، هي القدرة على التعامل مع أي وضع، معروف أو مجهول. يقدم هذا الفصل عدة طرق — نأمل أن — تساعدك على عزل سبب أية مشكلة تواجهك، حتى تتمكن من حلها.

source: Documentation Sources
ar_ma: مصادر الوثائق

source: <primary>documentation</primary>
ar_ma: <primary>وثائق</primary>

source: Manual Pages
ar_ma: صفحات الكتيّبات

source: <primary>manual pages</primary>
ar_ma: <primary>صفحات الكتيّبات</primary>

source: <emphasis>CULTURE</emphasis> <acronym>RTFM</acronym>
ar_ma: <emphasis>ثقافة</emphasis> <acronym>RTFM</acronym>

source: <emphasis>BACK TO BASICS</emphasis> The shell, a command line interpreter
ar_ma: <emphasis>أساسيات</emphasis> الصدَفَة، مفسر سطر الأوامر

source: <primary>command line interpreter</primary>
ar_ma: <primary>مفسر سطر الأوامر</primary>

source: <primary>shell</primary>
ar_ma: <primary>الصدفة</primary>

source: A command line interpreter, also called a “shell”, is a program that executes commands that are either entered by the user or stored in a script. In interactive mode, it displays a prompt (usually ending in <literal>$</literal> for a normal user, or by <literal>#</literal> for an administrator) indicating that it is ready to read a new command. <xref linkend="short-remedial-course" /> describes the basics of using the shell.
ar_ma: مفسِّر سطر الأوامر، الذي يعرف باسم ”الصَدَفَة“، هو برنامج ينفّذ الأوامر التي يُدخِلها المستخدم أو المخزَّنة في سكريبت. في الوضع التفاعلي، يعرض إشارة (تنتهي عادة بالرمز <literal>$</literal> بالنسبة للمستخدم العادي، أو <literal>#</literal> بالنسبة لمدير النظام) تبيّن جاهزيته لقراءة أمر جديد. <xref linkend="short-remedial-course" /> يصف أساسيات استخدام الصدفة.

source: The default and most commonly used shell is <command>bash</command> (Bourne Again SHell), but there are others, including <command>dash</command>, <command>csh</command>, <command>tcsh</command> and <command>zsh</command>.
ar_ma: الصدفة الافتراضية والأكثر شيوعاً هي <command>bash</command> (Bourne Again SHell)، لكن يوجد غيرها، منها <command>dash</command> ،<command>csh</command> ،<command>tcsh</command> و <command>zsh</command>.

source: Among other things, most shells offer help during input at the prompt, such as the completion of command or file names (which you can generally activate by pressing the tab key), or recalling previous commands (history management).
ar_ma: من بين العديد من المزايا الأخرى، تساعدك معظم الأصداف أثناء إدخال الأوامر تفاعليًا، مثل إكمال أسماء الأوامر أو الملفات (يمكنك تفعيل ذلك بضغط مفتاح tab بصورة عامة)، أو استدعاء أوامر سابقة (إدارة المحفوظات).

source: commands that can be executed from the command line;
ar_ma: أوامر يمكن تنفيذها من سطر الأوامر؛

source: system calls (functions provided by the kernel);
ar_ma: نداءات النظام (دوال توفرها النواة)؛

source: library functions (provided by system libraries);
ar_ma: دوال مكتبات (توفرها مكتبات النظام)؛

source: games;
ar_ma: ألعاب؛

source: sets of macros and standards;
ar_ma: مجموعات معايير وماكروات؛

source: system administration commands;
ar_ma: أوامر إدارة النظام؛

source: kernel routines.
ar_ma: روتينات النواة.

source: It is possible to specify the section of the manual page that you are looking for: to view the documentation for the <function>read</function> system call, you would type <command>man 2 read</command>. When no section is explicitly specified, the first section that has a manual page with the requested name will be shown. Thus, <command>man shadow</command> returns <citerefentry><refentrytitle>shadow</refentrytitle><manvolnum>5</manvolnum></citerefentry> because there are no manual pages for <foreignphrase>shadow</foreignphrase> in sections 1 to 4.
ar_ma: من الممكن تحديد قسم صفحة الكتيب التي تبحث عنها: لعرض وثائق نداء النظام <function>read</function>، سوف نكتب <command>man 2 read</command>. عند عدم تحديد أي قسم صراحة، سيُعرَض أول قسم يحوي صفحة كتيب للاسم المطلوب. بالتالي، الأمر <command>man shadow</command> يعرض <citerefentry><refentrytitle>shadow</refentrytitle><manvolnum>5</manvolnum></citerefentry> لعدم وجود صفحات كتيبات للاسم <foreignphrase>shadow</foreignphrase> في الأقسام من 1 إلى 4.

source: <emphasis>TIP</emphasis> <command>whatis</command>
ar_ma: <emphasis>تلميح</emphasis> <command>whatis</command>

source: If you do not want to look at the full manual page, but only a short description to confirm that it is what you are looking for, simply enter <command>whatis <replaceable>command</replaceable></command>.
ar_ma: إذا لم ترغب بالنظر في صفحات الكتيبات الكاملة، بل في مختصراتها للتحقق من وجود ما تبحث عنه فيها، ببساطة استعمل <command>whatis <replaceable>command</replaceable></command>.

source: This short description is included in the <emphasis>NAME</emphasis> section at the beginning of all manual pages.
ar_ma: هذا الوصف المختصر مضمّن في قسم <emphasis>NAME</emphasis> في بداية كل صفحة كتيّب.

source: Finding <command>cp</command> with <command>apropos</command>
ar_ma: العثور على <command>cp</command> باستخدام <command>apropos</command>

source: <emphasis>TIP</emphasis> Browsing by following links
ar_ma: <emphasis>تلميح</emphasis> التصفح بمتابعة الروابط

source: Many manual pages have a “SEE ALSO” section, usually at the end. It refers to other manual pages relevant to similar commands, or to external documentation. In this way, it is possible to find relevant documentation even when the first choice is not optimal.
ar_ma: للعديد من صفحات الكتيبات قسم ”SEE ALSO“، عادة في نهايتها. يشير إلى صفحات كتيبات أخرى لها علاقة بأوامر مشابهة، أو يشير إلى توثيق خارجي. بهذه الطريقة، من الممكن العثور على وثائق ذات صلة حتى لو لم يكن الخيار الأول مثاليًا.

source: The <command>man</command> command is not the only means of consulting the manual pages, since <command>konqueror</command> (in KDE) and <command>yelp</command> (under GNOME) programs also offer this possibility. There is also a web interface, provided by the <command>man2html</command> package, which allows you to view manual pages in a web browser. On a computer where this package is installed, use this URL: <ulink type="block" url="http://localhost/cgi-bin/man/man2html" />
ar_ma: ليس الأمر <command>man</command> الوسيلة الوحيدة لقراءة صفحات الكتيبات، نظراً لأن برنامجي <command>konqueror</command> (في KDE) و <command>yelp</command> (في غنوم) يقدمان هذه الإمكانية أيضًا. توجد واجهة وب أيضًا، تقدمها الحزمة <command>man2html</command>، التي تسمح لك باستعراض صفحات الكتيبات في متصفح وب. استعمل الـ URL التالي، على حاسوب مثبتة عليه هذه الحزمة: <ulink type="block" url="http://localhost/cgi-bin/man/man2html" />

source: This utility requires a web server. This is why you should choose to install this package on one of your servers: all users of the local network could benefit from this service (including non-Linux machines), and this will allow you not to set up an HTTP server on each workstation. If your server is also accessible from other networks, it may be desirable to restrict access to this service only to users of the local network.
ar_ma: هذه الأداة تتطلب مُخَدِّم وب. لهذا عليك تثبيت هذه الحزمة على أحد مخدماتك: سيتمكن جميع مستخدمي الشبكة المحلية من الاستفادة من هذه الخدمة (بما فيها الحواسيب التي تستعمل نظم تشغيل غير لينوكس)، وهذا سيسمح لك بعدم إعداد مخدّم HTTP على كل محطة عمل. إذا كان الوصول لمخدّمك ممكناً من شبكات أخرى، فقد يكون حصر الوصول لهذه الخدمة بمستخدمي الشبكة المحلية فقط مرغوبًا.

source: <emphasis>DEBIAN POLICY</emphasis> Required man pages
ar_ma: <emphasis>سياسة ديبيان</emphasis> صفحات الكتيبات الإلزامية

source: Debian requires each program to have a manual page. If the upstream author does not provide one, the Debian package maintainer will usually write a minimal page that will at the very least direct the reader to the location of the original documentation.
ar_ma: تتطلب ديبيان أن يكون لكل برنامج صفحة كتيب. إذا لم يقدم مصدر البرنامج واحدة، سيكتب مسؤول صيانة حزمة ديبيان صفحة مصغرة عادة، توجّه القارئ على الأقل إلى مكان الوثائق الأصلية.

source: <emphasis>info</emphasis> Documents
ar_ma: وثائق <emphasis>info</emphasis>

source: The GNU project has written manuals for most of its programs in the <emphasis>info</emphasis> format; this is why many manual pages refer to the corresponding <emphasis>info</emphasis> documentation. This format offers some advantages, but the program to view these documents is also slightly more complex.
ar_ma: كَتَبَ مشروع غنو كتيبات معظم برامجه في صيغة <emphasis>info</emphasis>؛ ولهذا تشير العديد من صفحات الكتيبات إلى وثائق <emphasis>info</emphasis> المماثلة لها. تُقدِّم هذه الصيغة بعض المزايا، لكن البرنامج المستخدم لعرض هذه الملفات أعقد قليلاً أيضًا.

source: It is of course called <command>info</command>, and it takes the name of the “node” to be consulted as argument. The <emphasis>info</emphasis> documentation has a hierarchical structure, and if you invoke <command>info</command> without parameters, it will display a list of the nodes available at the first level. Usually, nodes bear the name of the corresponding commands.
ar_ma: يدعى هذا البرنامج <command>info</command> بالطبع، وهو يأخذ اسم ”العقدة“ التي تريد قراءتها كمتغير. لوثائقِ <emphasis>info</emphasis> بنيةٌ شجرية، وإذا استدعيت <command>info</command> بدون متغيرات، فسوف يعرض قائمة بالعقد المتوفرة في المستوى الأول. عادة ما تحمل العقد اسم الأوامر المرتبطة بها.

source: The navigation controls in the documentation are not particularly intuitive. The best method to familiarize yourself with the program is probably to invoke it, then enter <userinput>h</userinput> (for “help”), and then follow the instructions to learn through practice. Alternatively, you could also use a graphical browser, which is a lot more user-friendly. Again, <command>konqueror</command> and <command>yelp</command> work; the <command>info2www</command> also provides a web interface. <ulink type="block" url="http://localhost/cgi-bin/info2www" />
ar_ma: أدوات التجول في الوثائق ليست بدهية تمامًا. إن أفضل طريقة للتآلف مع برنامج ما هي استدعاءه على الأرجح، بعدها أدخل <userinput>h</userinput> (اختصار ”help“)، واتّبع التعليمات حتى تتعلم من خلال الممارسة. أو يمكنك أيضًا استخدام متصفح رسومي، فهو أسهل استخدامًا بكثير. مرة أخرى نقول، <command>konqueror</command> و <command>yelp</command> مناسبان؛ وأيضًا <command>info2www</command> يوفر واجهة وب. <ulink type="block" url="http://localhost/cgi-bin/info2www" />

source: Note that the <emphasis>info</emphasis> system does not allow translation, unlike the <command>man</command> page system. <emphasis>info</emphasis> documents are thus always in English. However, when you ask the <command>info</command> program to display a non-existing <emphasis>info</emphasis> page, it will fall back on the <emphasis>man</emphasis> page by the same name (if it exists), which might be translated.
ar_ma: لاحظ أن نظام <emphasis>info</emphasis> لا يدعم الترجمة، بعكس نظام صفحات <command>man</command>. بالتالي فإن وثائق <emphasis>info</emphasis> بالإنجليزية دائمًا. مع ذلك، عندما تطلب من برنامج <command>info</command> عرض صفحة <emphasis>info</emphasis> غير موجودة، فسيلجأ إلى صفحة <emphasis>man</emphasis> ذات الاسم نفسه (في حال وجودها)، والتي قد تكون مترجمة.

source: Specific Documentation
ar_ma: الوثائق الخاصة

source: Each package includes its own documentation. Even the least well documented programs generally have a <filename>README</filename> file containing some interesting and/or important information. This documentation is installed in the <filename>/usr/share/doc/<replaceable>package</replaceable>/</filename> directory (where <replaceable>package</replaceable> represents the name of the package). If the documentation is particularly large, it may not be included in the program's main package, but might be offloaded to a dedicated package which is usually named <literal><replaceable>package</replaceable>-doc</literal>. The main package generally recommends the documentation package so that you can easily find it.
ar_ma: لكل حزمة وثائقها الخاصة. حتى أقل البرامج توثيقًا لها عموماً ملف <filename>README</filename> يحوي بعض المعلومات المثيرة للاهتمام و/أو المهمة. يُثَبَّتُ التوثيق في المجلد <filename>/usr/share/doc/<replaceable>package</replaceable>/</filename> (حيث يمثل <replaceable>package</replaceable> اسم الحزمة). إذا كان التوثيق كبيراً على وجه الخصوص، فقد لا يرفق ضمن حزمة البرنامج الرئيسة، بل يمكن شحنه في حزمة مخصصة تُسمَّى عادة <literal><replaceable>package</replaceable>-doc</literal>. الحزمة الرئيسة عمومًا تنصحك بحزمة التوثيق حتى تستطيع العثور عليها بسهولة.

source: Websites
ar_ma: مواقع الوب

source: <emphasis>TIPS</emphasis> From error to solution
ar_ma: <emphasis>تلميح</emphasis> من الخطأ إلى الحل

source: If the software returns a very specific error message, enter it into the search engine (between double quotes, <literal>"</literal>, in order to search not for individual keywords, but for the complete phrase). In most cases, the first links returned will contain the answer that you need.
ar_ma: إذا أعطت البرمجية رسالة خطأ محددة جداً، أدخلها في محرك البحث كما هي (بين علامتي اقتباس مزدوجتين، <literal>"</literal>، وذلك للبحث عن العبارة كاملة، وليس الكلمات المفتاحية المفردة). في معظم الحالات، سيحتوي الرابط الأول من نتائج البحث على الإجابة التي تحتاج.

source: In other cases, you will get very general errors, such as “Permission denied”. In this case, it is best to check the permissions of the elements involved (files, user ID, groups, etc.).
ar_ma: في حالات أخرى، ستتلقى رسائل خطأ عامة، مثل ”Permission denied“. في هذه الحالة، من الأفضل التحقق من صلاحيات العناصر المرتبطة (ملفات، معرفات مستخدمين، مجموعات، إلخ).

source: <primary><filename>copyright</filename></primary>
ar_ma: <primary><filename>حقوق النشر</filename></primary>

source: Tutorials (<emphasis>HOWTO</emphasis>)
ar_ma: الدروس (<emphasis>HOWTO</emphasis>)

source: Many such tutorials are managed by the Linux Documentation Project (LDP), whose website hosts all of these documents:<ulink type="block" url="http://www.tldp.org/" />
ar_ma: يدير مشروع توثيق لينوكس (LDP = Linux Documentation Project) العديد من الدروس المشابهة لهذه، يستضيف موقع المشروع جميع هذه الوثائق: <ulink type="block" url="http://www.tldp.org/" />

source: <primary>Linux Documentation Project</primary>
ar_ma: <primary>مشروع توثيق لينوكس</primary>

source: Common Procedures
ar_ma: إجراءات شائعة

source: <primary>standard procedure</primary>
ar_ma: <primary>إجراء قياسي</primary>

source: The purpose of this section is to present some general tips on certain operations that an administrator will frequently have to perform. These procedures will of course not cover every possible case in an exhaustive way, but they may serve as starting points for the more difficult cases.
ar_ma: إن الهدف من هذا القسم هو تقديم بعض النصائح العامة لبعض العمليات التي يحتاج مدير النظام تنفيذها بشكل متكرر. لن تغطي هذه الإجراءات جميع الحالات الممكنة بشكل موسّع، بل ستخدمك كنقطة انطلاق للحالات الأكثر صعوبة.

source: <emphasis>DISCOVERY</emphasis> Documentation in French
ar_ma: <emphasis>استكشاف</emphasis> الوثائق بالفرنسية

source: Often, documentation translated into a non-English language is available in a separate package with the name of the corresponding package, followed by <literal>-<replaceable>lang</replaceable></literal> (where <replaceable>lang</replaceable> is the two-letter ISO code for the language).
ar_ma: غالبًا ما تتوفر الوثائق المترجمة إلى غير الإنجليزية في حزمة منفصلة لها نفس اسم الحزمة المرتبطة بها، متبوعًا بـ <literal>-<replaceable>lang</replaceable></literal> (حيث <replaceable>lang</replaceable> هو رمز ISO الخاص باللغة وهو مكون من حرفين).

source: Configuring a Program
ar_ma: ضبط برنامج

source: <primary>configuration</primary><secondary>program configuration</secondary>
ar_ma: <primary>إعداد</primary><secondary>إعداد برنامج</secondary>

source: <primary>program</primary><secondary>configuration</secondary>
ar_ma: <primary>برنامج</primary><secondary>ضبط</secondary>

source: When you want to configure an unknown package, you must proceed in stages. First, you should read what the package maintainer has documented. Reading <filename>/usr/share/doc/<replaceable>package</replaceable>/README.Debian</filename> will indeed allow you to learn of specific provisions made to simplify the use of the software. It is sometimes essential in order to understand the differences from the original behavior of the program, as described in the general documentation, such as howtos. Sometimes this file also details the most common errors in order for you to avoid wasting time on common problems.
ar_ma: عندما ترغب بضبط حزمة مجهولة، عليك العمل في مراحل. أولاً، عليك قراءة ما وثَّقَه مسؤول صيانة الحزمة. ستسمح لك قراءة <filename>/usr/share/doc/<replaceable>package</replaceable>/README.Debian</filename> فعلاً بالتعرف على التغييرات الخاصة التي أضيفت لتبسيط استخدام البرنامج. هذه المعلومات أساسية أحيانًا لفهم الاختلاف عن السلوك الأصلي للبرنامج، كما هو موصوف في الوثائق العامة، مثل دروس howto. أحياناً يفصِّل هذا الملف أيضًا الأخطاء الأكثر شيوعًا حتى تتفادى إضاعة وقتك على المشاكل الشائعة.

source: Finally, the configuration files are often self-documented by many explanatory comments detailing the various possible values for each configuration setting. So much so that it is sometimes enough to just choose a line to activate from among those available. In some cases, examples of configuration files are provided in the <filename>/usr/share/doc/<replaceable>package</replaceable>/examples/</filename> directory. They may serve as a basis for your own configuration file.
ar_ma: أخيراً، غالبًا ما تكون ملفات الإعداد موثقة بنفسها من خلال العديد من التعليقات التوضيحية التي تفصّل القيم المختلفة التي يمكن إسنادها لكل خيار. تعليقات كثيرة لدرجة أنه يكفي أحيانًا اختيار سطر لتفعيله وحسب من بين السطور المتوفرة. في بعض الحالات، تُقدَّم أمثلة عن ملفات الإعداد في المجلد <filename>/usr/share/doc/<replaceable>package</replaceable>/examples/</filename>. قد تخدمك هذه كأساس تبني عليه ملفات الإعداد الخاصة بك.

source: <emphasis>DEBIAN POLICY</emphasis> Location of examples
ar_ma: <emphasis>سياسة ديبيان</emphasis> مكان الأمثلة

source: <primary>examples, location</primary>
ar_ma: <primary>أمثلة، مكان</primary>

source: All examples must be installed in the <filename>/usr/share/doc/<replaceable>package</replaceable>/examples/</filename> directory. This may be a configuration file, program source code (an example of the use of a library), or a data conversion script that the administrator can use in certain cases (such as to initialize a database). If the example is specific to a particular architecture, it should be installed in <filename>/usr/lib/<replaceable>package</replaceable>/examples/</filename> and there should be a link pointing to that file in the <filename>/usr/share/doc/<replaceable>package</replaceable>/examples/</filename> directory.
ar_ma: يجب تثبيت جميع الأمثلة في مجلد <filename>/usr/share/doc/<replaceable>package</replaceable>/examples/</filename>. قد تكون هذه ملفات إعداد، شفرة مصدرية لبرنامج (مثال عن استخدام مكتبة)، أو سكريبت لتحويل البيانات يمكن لمدير النظام استخدامه في حالات معينة (مثل تهيئة قاعدة بيانات). إذا كان المثال مخصصًا لمعمارية معينة، فيجب تثبيته في <filename>/usr/lib/<replaceable>package</replaceable>/examples/</filename> ويجب وجود رابط يشير إلى ذلك الملف من مجلد <filename>/usr/share/doc/<replaceable>package</replaceable>/examples/</filename>.

source: Monitoring What Daemons Are Doing
ar_ma: مراقبة ما يفعله الحراس

source: To allow such tests, each daemon generally records everything that it does, as well as any errors that it encounters, in what are called “log files” or “system logs”. Logs are stored in <filename>/var/log/</filename> or one of its subdirectories. To know the precise name of a log file for each daemon, see its documentation. Note: a single test is not always sufficient if it does not cover all the possible usage cases; some problems only occur in particular circumstances.
ar_ma: للسماح بمثل هذه الاختبارات، يسجل كل حارس عادة كل ما يفعله، بالإضافة إلى أية أخطاء تواجهه، في ما تسمى ”بالسجلات“ أو ”سجلات النظام“. تُخزَّن السجلات في المجلد <filename>/var/log/</filename> أو أحد مجلداته الفرعية. لمعرفة الاسم الدقيق لسجل كل حارس، ابحث في وثائقه. لاحظ أن اختباراً واحدًا لا يكفي ما لم يغطي جميع حالات الاستخدام الممكنة؛ فبعض المشاكل تبرز فقط في ظروف معينة.

source: <emphasis>TOOL</emphasis> The <command>rsyslogd</command> daemon
ar_ma: <emphasis>أدوات</emphasis> الحارس <command>rsyslogd</command>

source: <primary>logs</primary><secondary>files</secondary>
ar_ma: <primary>سجلات</primary><secondary>ملفات</secondary>

source: <primary>files</primary><secondary>logs</secondary>
ar_ma: <primary>ملفات</primary><secondary>سجلات</secondary>

source: Certain C functions, which are specialized in sending logs, simplify the use of the <command>rsyslogd</command> daemon. However some daemons manage their own log files (this is the case, for example, of <command>samba</command>, that implements Windows shares on Linux).
ar_ma: بعض دوال لغة C، المختصّة بإرسال السجلات، تبسط استخدام الحارس <command>rsyslogd</command>. مع ذلك فإن بعض الحراس يديرون ملفات سجلات خاصة بهم (هذه هي حالة <command>samba</command> مثلا، الذي ينشئ مشاركات ويندوز على لينوكس).

source: <emphasis>BACK TO BASICS</emphasis> Daemon
ar_ma: <emphasis>أساسيات</emphasis> الحارس

source: <primary>daemon</primary>
ar_ma: <primary>حارس</primary>

source: A daemon is a program that is not explicitly invoked by the user and that stays in the background, waiting for a certain condition to be met before performing a task. Many server programs are daemons, a term that explains that the letter “d” is frequently present at the end of their name (<command>sshd</command>, <command>smtpd</command>, <command>httpd</command>, etc.).
ar_ma: الحارس هو برنامج لا يستدعيه المستخدم صراحة ويبقى في الخلفية، منتظراً تحقق شرط ما قبل تنفيذ مهمة ما. معظم برامج المخدم حراس، أو daemons، وهو مصطلح يفسر وجود الحرف ”d“ كثيراً في نهايات أسمائها (<command>sshd</command> ،<command>smtpd</command> ،<command>httpd</command>، الخ).

source: Asking for Help on a Mailing List
ar_ma: طلب المساعدة على القوائم البريدية

source: If your various searches haven't helped you to get to the root of a problem, it is possible to get help from other, perhaps more experienced people. This is indeed the purpose of the <email>debian-user@lists.debian.org</email> mailing list. As with any community, it has rules that need to be followed. Before asking any question, you should check that your problem isn't already covered by recent discussions on the list or by any official documentation. <ulink type="block" url="http://wiki.debian.org/DebianMailingLists" /> <ulink type="block" url="http://lists.debian.org/debian-user/" />
ar_ma: إذا لم تساعدك أبحاثك في الوصول إلى جذور المشكلة، يمكنك الحصول على المساعدة من أشخاص آخرين، ربما كانوا أكثر خبرة. حقًا هذا هو الهدف من قائمة <email>debian-user@lists.debian.org</email> البريدية. كما هو الحال مع أي مجتمع، توجد قواعد يجب اتباعها. قبل طرح أي سؤال، عليك التحقق من أن مشكلة لم تكن موضوع نقاشات حديثة على القائمة أو مغطاة بالوثائق الرسمية. <ulink type="block" url="http://wiki.debian.org/DebianMailingLists" /> <ulink type="block" url="http://lists.debian.org/debian-user/" />

source: <primary>mailing lists</primary>
ar_ma: <primary>قوائم بريدية</primary>

source: <emphasis>TIP</emphasis> Reading a list on the Web
ar_ma: <emphasis>تلميح</emphasis> قراءة قائمة على الوب
