Repository: binary-com/mobile
Catalog: */14_security.po
Languages: pt_br

source: To create new modules, the <emphasis role="pkg">selinux-policy-dev</emphasis> package is required, as well as <emphasis role="pkg">selinux-policy-doc</emphasis>. The latter contains the documentation of the standard rules (<filename>/usr/share/doc/selinux-policy-doc/html/</filename>) and sample files that can be used as templates to create new modules. Install those files and study them more closely:
pt_br: Para criar novos módulos, o pacote <emphasis role="pkg">selinux-policy-dev</emphasis> é necessário, bem como <emphasis role="pkg">selinux-policy-doc</emphasis>. Este último contém a documentação das regras padrão (<filename>/usr/share/doc/selinux-policy-doc/html/</filename>) da amostra e arquivos que podem ser usados como modelos para criar novos módulos. Instale estes arquivos e os estude mais de perto:

source: The <filename>.te</filename> file is the most important one. It defines the rules. The <filename>.fc</filename> file defines the “file contexts”, that is the types assigned to files related to this module. The data within the <filename>.fc</filename> file are used during the file labeling step. Finally, the <filename>.if</filename> file defines the interface of the module: it's a set of “public functions” that other modules can use to properly interact with the module that you're creating.
pt_br: O arquivo <filename>.te</filename> é o mais importante. Ele define as regras. O arquivo <filename>.fc</filename> define os arquivos de contextos", isto é, os tipos atribuídos a arquivos relacionados a este módulo. Os dados dentro do arquivo <filename>.fc</filename> são utilizados durante a etapa de rotulagem do arquivo. Finalmente, o arquivo <filename>if</filename> define a interface do módulo:. É um conjunto de "funções públicas" que outros módulos podem usar para interagir adequadamente com o módulo que você está criando.

source: Writing a <filename>.fc</filename> file
pt_br: Escrevendo um arquivo <filename>.fc</filename>

source: Reading the below example should be sufficient to understand the structure of such a file. You can use regular expressions to assign the same security context to multiple files, or even an entire directory tree.
pt_br: Lendo o exemplo a seguir deve ser suficiente para compreender a estrutura de tal arquivo. Você pode usar expressões regulares para atribuir o mesmo contexto de segurança de vários arquivos, ou até mesmo uma árvore de diretórios.

source: <filename>example.fc</filename> file
pt_br: arquivo <filename>example.fc</filename>

source: # myapp executable will have: # label: system_u:object_r:myapp_exec_t # MLS sensitivity: s0 # MCS categories: &lt;none&gt; /usr/sbin/myapp -- gen_context(system_u:object_r:myapp_exec_t,s0)
pt_br: # myapp executavel tera: # label: system_u:object_r:myapp_exec_t # MLS sensibilidade: s0 # MCS categorias: &lt;nenhuma&gt; /usr/sbin/myapp -- gen_context(system_u:object_r:myapp_exec_t,s0)

source: Writing a <filename>.if</filename> File
pt_br: Escrevendo um arquivo <filename>.if</filename>

source: In the sample below, the first interface (“<literal>myapp_domtrans</literal>”) controls who can execute the application. The second one (“<literal>myapp_read_log</literal>”) grants read rights on the application's log files.
pt_br: No exemplo abaixo, a primeira interface ("<literal>myapp_domtrans</literal>") controla quem pode executar o aplicativo. O segundo ("<literal>myapp_read_log</literal>") concede direitos de leitura nos arquivos de log do aplicativo.

source: Each interface must generate a valid set of rules which can be embedded in a <filename>.te</filename> file. You should thus declare all the types that you use (with the <literal>gen_require</literal> macro), and use standard directives to grant rights. Note, however, that you can use interfaces provided by other modules. The next section will give more explanations about how to express those rights.
pt_br: Cada interface deve gerar um conjunto válido de regras que podem ser incorporadas em um arquivo <filename>.te</filename>. Você deve, portanto, declarar todos os tipos que você utiliza (com a macro <literal>gen_require</literal>), e usar diretivas padrão de concessão de direitos. Note, no entanto, que você pode usar interfaces fornecidas por outros módulos. A próxima seção irá dar mais explicações sobre a forma de expressar esses direitos.

source: <filename>example.if</filename> File
pt_br: Arquivo <filename>example.if</filename>

source: ## &lt;summary&gt;Myapp example policy&lt;/summary&gt; ## &lt;desc&gt; ## &lt;p&gt; ## More descriptive text about myapp. The &lt;desc&gt; ## tag can also use &lt;p&gt;, &lt;ul&gt;, and &lt;ol&gt; ## html tags for formatting. ## &lt;/p&gt; ## &lt;p&gt; ## This policy supports the following myapp features: ## &lt;ul&gt; ## &lt;li&gt;Feature A&lt;/li&gt; ## &lt;li&gt;Feature B&lt;/li&gt; ## &lt;li&gt;Feature C&lt;/li&gt; ## &lt;/ul&gt; ## &lt;/p&gt; ## &lt;/desc&gt; # ######################################## ## &lt;summary&gt; ## Execute a domain transition to run myapp. ## &lt;/summary&gt; ## &lt;param name="domain"&gt; ## Domain allowed to transition. ## &lt;/param&gt; # interface(`myapp_domtrans',` gen_require(` type myapp_t, myapp_exec_t; ') domtrans_pattern($1,myapp_exec_t,myapp_t) ') ######################################## ## &lt;summary&gt; ## Read myapp log files. ## &lt;/summary&gt; ## &lt;param name="domain"&gt; ## Domain allowed to read the log files. ## &lt;/param&gt; # interface(`myapp_read_log',` gen_require(` type myapp_log_t; ') logging_search_logs($1) allow $1 myapp_log_t:file r_file_perms; ')
pt_br: ## &lt;summary&gt;Myapp exemple de politica&lt;/summary&gt; ## &lt;desc&gt; ## &lt;p&gt; ## Mais um texto descritivo sobre myapp. A tag &lt;desc&gt; ## tambem pode usar &lt;p&gt;, &lt;ul&gt;, e &lt;ol&gt; ## tags html para formatacao; ## &lt;/p&gt; ## &lt;p&gt; ## Esta politica suporta as seguintes myapp caracteristicas: ## &lt;ul&gt; ## &lt;li&gt;Caracteristica A&lt;/li&gt; ## &lt;li&gt;Caracteristica B&lt;/li&gt; ## &lt;li&gt;Caracteristica C&lt;/li&gt; ## &lt;/ul&gt; ## &lt;/p&gt; ## &lt;/desc&gt; # ######################################## ## &lt;sumario&gt; ## Executar uma transição de domínio para executar myapp. ## &lt;/sumario&gt; ## &lt;param name="domain"&gt; ## Domínio permitiu a transição. ## &lt;/param&gt; # interface(`myapp_domtrans',` gen_require(` type myapp_t, myapp_exec_t; ') domtrans_pattern($1,myapp_exec_t,myapp_t) ') ######################################## ## &lt;summary&gt; ## Ler arquivos de log myapp. ## &lt;/summary&gt; ## &lt;param name="domain"&gt; ## Domínio permitiu ler os arquivos de log. ## &lt;/param&gt; # interface(`myapp_read_log',` gen_require(` type myapp_log_t; ') logging_search_logs($1) allow $1 myapp_log_t:file r_file_perms; ')

source: <emphasis>DOCUMENTATION</emphasis> Explanations about the <emphasis>reference policy</emphasis>
pt_br: <emphasis>DOCUMENTACAO</emphasis> Explicações sobre a <emphasis>política de referência</emphasis>

source: The <emphasis>reference policy</emphasis> evolves like any free software project: based on volunteer contributions. The project is hosted by Tresys, one of the most active companies in the SELinux field. Their wiki contains explanations on how the rules are structured and how you can create new ones. <ulink type="block" url="http://oss.tresys.com/projects/refpolicy/wiki/GettingStarted" />
pt_br: A <emphasis>política de referência</emphasis> evolui como qualquer projeto de software livre: baseado em contribuições voluntárias. O projeto é hospedado pelo Tresys, uma das empresas mais ativas no domínio SELinux. Sua wiki contém explicações sobre como as regras são estruturadas e como você pode criar novas. <ulink type="block" url="http://oss.tresys.com/projects/refpolicy/wiki/GettingStarted" />

source: Writing a <filename>.te</filename> File
pt_br: Escrevendo um Arquivo <filename>.te</filename>

source: Have a look at the <filename>example.te</filename> file:
pt_br: De uma olhada no arquivo <filename>example.te</filename>:

source: <emphasis>GOING FURTHER</emphasis> The <command>m4</command> macro language
pt_br: <emphasis>INDO ALEM</emphasis> A linguagem de macro <command>m4</command>

source: To properly structure the policy, the SELinux developers used a macro-command processor. Instead of duplicating many similar <emphasis>allow</emphasis> directives, they created “macro functions” to use a higher-level logic, which also results in a much more readable policy.
pt_br: Para estruturar adequadamente a política, os desenvolvedores do SELinux utilizado um processador de comandos macro. Em vez de duplicar varios diretivas de permissoes <emphasis>similares</emphasis>, eles criaram "funções macro", para usar uma lógica de alto nível, o que também resulta em uma política muito mais legível.

source: In practice, <command>m4</command> is used to compile those rules. It does the opposite operation: it expands all those high-level directives into a huge database of <emphasis>allow</emphasis> directives.
pt_br: Na prática, <command>m4</command> é usado para compilar essas regras. Ele faz a operação inversa: ele expande todas estas directivas de alto nível em um enorme banco de dados de diretivas de <emphasis>permissoes</emphasis>.

source: The SELinux “interfaces” are only macro functions which will be substituted by a set of rules at compilation time. Likewise, some rights are in fact sets of rights which are replaced by their values at compilation time.
pt_br: As "interfaces" SELinux são apenas funções de macro que serão substituídas por uma série de regras no momento da compilação. Da mesma forma, alguns direitos são conjuntos de fatos de direitos que são substituídos por seus valores em tempo de compilação.

source: policy_module(myapp,1.0.0) <co id="example.te.module"></co> ######################################## # # Declarations # type myapp_t; <co id="example.te.type"></co> type myapp_exec_t; domain_type(myapp_t) domain_entry_file(myapp_t, myapp_exec_t) <co id="example.te.domain"></co> type myapp_log_t; logging_log_file(myapp_log_t) <co id="example.te.interface"></co> type myapp_tmp_t; files_tmp_file(myapp_tmp_t) ######################################## # # Myapp local policy # allow myapp_t myapp_log_t:file { read_file_perms append_file_perms }; <co id="example.te.allow"></co> allow myapp_t myapp_tmp_t:file manage_file_perms; files_tmp_filetrans(myapp_t,myapp_tmp_t,file)
pt_br: policy_module(myapp,1.0.0) <co id="example.te.module"></co> ######################################## # # Declaracoes # type myapp_t; <co id="example.te.type"></co> type myapp_exec_t; domain_type(myapp_t) domain_entry_file(myapp_t, myapp_exec_t) <co id="example.te.domain"></co> type myapp_log_t; logging_log_file(myapp_log_t) <co id="example.te.interface"></co> type myapp_tmp_t; files_tmp_file(myapp_tmp_t) ######################################## # # Politica local Myapp # allow myapp_t myapp_log_t:file { read_file_perms append_file_perms }; <co id="example.te.allow"></co> allow myapp_t myapp_tmp_t:file manage_file_perms; files_tmp_filetrans(myapp_t,myapp_tmp_t,file)

source: The module must be identified by its name and version number. This directive is required.
pt_br: O modulo deve ser identificado pelo seu nome e numero da versao. Esta diretiva é requerida.

source: If the module introduces new types, it must declare them with directives like this one. Do not hesitate to create as many types as required rather than granting too many useless rights.
pt_br: Se o módulo introduz novos tipos, deve declará-los com as directivas como este. Não hesite em criar tantos tipos quantas forem necessários em vez de conceder muitos direitos inúteis.

source: Those interfaces define the <literal>myapp_t</literal> type as a process domain that should be used by any executable labeled with <literal>myapp_exec_t</literal>. Implicitly, this adds an <literal>exec_type</literal> attribute on those objects, which in turn allows other modules to grant rights to execute those programs: for instance, the <literal>userdomain</literal> module allows processes with domains <literal>user_t</literal>, <literal>staff_t</literal>, and <literal>sysadm_t</literal> to execute them. The domains of other confined applications will not have the rights to execute them, unless the rules grant them similar rights (this is the case, for example, of <command>dpkg</command> with its <literal>dpkg_t</literal> domain).
pt_br: Estas interfaces definem o tipo <literal>myapp_t</literal> como uma área processo que deve ser utilizada por qualquer executável rotulado com <literal>myapp_exec_t</literal>. Implicitamente, isso adiciona um atributo <literal>exec_type</literal> sobre esses objetos, que por sua vez permite que outros módulos de concessão de direitos para executar esses programas: por exemplo, o módulo <literal>userdomain</literal>, permite que os processos com domínios <literal>user_t</literal>, <literal>staff_t</literal> e <literal>sysadm_t</literal> execute os. Os domínios de outras aplicações confinadas não terão direitos para executar los, a menos que as regras lhes concedem direitos semelhantes (este é o caso, por exemplo, do <command>dpkg</command> com o seu domínio <literal>dpkg_t</literal>).

source: <literal>logging_log_file</literal> is an interface provided by the reference policy. It indicates that files labeled with the given type are log files which ought to benefit from the associated rules (for example granting rights to <command>logrotate</command> so that it can manipulate them).
pt_br: <literal>logging_log_file</literal> é uma interface fornecida pela política de referência. Ela indica que os arquivos marcados com o tipo de dado são arquivos de log que deveriam beneficiar das regrassociadas (por exemplo concedem direitos ao <command>logrotate</command> para que possa manipulá los).

source: The <literal>allow</literal> directive is the base directive used to authorize an operation. The first parameter is the process domain which is allowed to execute the operation. The second one defines the object that a process of the former domain can manipulate. This parameter is of the form “<replaceable>type</replaceable>:<replaceable>class</replaceable>“ where <replaceable>type</replaceable> is its SELinux type and <replaceable>class</replaceable> describes the nature of the object (file, directory, socket, fifo, etc.). Finally, the last parameter describes the permissions (the allowed operations).
pt_br: O diretiva <literal>permicao</literal> é a diretiva de base utilizada para autorizar uma operação. O primeiro parâmetro é o domínio processo que tem a permissao para executar a operação. A segunda define o objeto que um processo do domínio anterior pode manipular. Este parâmetro é a forma "<replaceable>tipo</replaceable>: <replaceable>classe</replaceable>" onde <replaceable>tipo</replaceable> é o seu tipo SELinux e <replaceable>classe</replaceable> descreve a natureza do objeto (arquivo, diretório, socket, fifo, etc.) Finalmente, o último parâmetro descreve as permissões (as operações permitidas).

source: Permissions are defined as the set of allowed operations and follow this template: <literal>{ <replaceable>operation1</replaceable> <replaceable>operation2</replaceable> }</literal>. However, you can also use macros representing the most useful permissions. The <filename>/usr/share/selinux/default/include/support/obj_perm_sets.spt</filename> lists them.
pt_br: As permissões são definidas como o conjunto de operações permitidas e segue este modelo: <literal>{ <replaceable>operacao1</replaceable><replaceable>operacao2</replaceable>}</literal>. No entanto, você também pode usar macros que representam as permissões mais úteis. O <filename>/usr/share/selinux/default/include/support/obj_perm_sets.spt</filename> os lista.

source: The following web page provides a relatively exhaustive list of object classes, and permissions that can be granted. <ulink type="block" url="http://www.selinuxproject.org/page/ObjectClassesPerms" />
pt_br: A página web a seguir fornece uma lista relativamente exaustiva de classes de objetos e permissões que podem ser concedidas. <ulink type="block" url="http://www.selinuxproject.org/page/ObjectClassesPerms" />

source: Now you just have to find the minimal set of rules required to ensure that the target application or service works properly. To achieve this, you should have a good knowledge of how the application works and of what kind of data it manages and/or generates.
pt_br: Agora você só tem que encontrar o conjunto mínimo de regras necessárias para assegurar que o aplicativo de destino ou serviço funcione corretamente. Para conseguir isso, você deve ter um bom conhecimento de como o aplicativo funciona e de que tipo de dados ele gerencia e/ou gera.

source: However, an empirical approach is possible. Once the relevant objects are correctly labeled, you can use the application in permissive mode: the operations that would be forbidden are logged but still succeed. By analyzing the logs, you can now identify the operations to allow. Here is an example of such a log entry:
pt_br: No entanto, uma abordagem empírica é possível. Uma vez que os objetos relevantes são rotuladas corretamente, você pode usar o aplicativo no modo permissivo: as operações que seriam proibidos são registrados, mas ainda tem sucesso. Ao analisar os logs, você pode agora identificar as operações de permissao. Aqui esta um exemplo de uma tal entrada de log:

source: To better understand this message, let us study it piece by piece.
pt_br: Para melhor entender esta mensagem, vamos estudá la peça por peça.

source: Analysis of an SELinux trace
pt_br: Análise de um rastreamento SELinux

source: Message
pt_br: Mensagem

source: Description
pt_br: Descricao

source: An operation has been denied.
pt_br: Uma operação foi negada.

source: This operation required the <literal>read</literal> and <literal>write</literal> permissions.
pt_br: Esta operação exigiu permissões de <literal>leitura</literal> e <literal>escrita</literal>.

source: The process with PID 1876 executed the operation (or tried to execute it).
pt_br: O processo com PID 1876 executou a operacao (ou tentou executa la).

source: The process was an instance of the <literal>syslogd</literal> program.
pt_br: O processo foi um exemplo do programa <literal>syslogd</literal>.

source: The target object was named <literal>xconsole</literal>.
pt_br: O objeto de destino foi nomeado <literal>xconsole</literal>.

source: The device hosting the target object is a <literal>tmpfs</literal> (an in-memory filesystem). For a real disk, you could see the partition hosting the object (for example: “hda3”).
pt_br: O dispositivo que hospeda o objeto de destino é um <literal>tmpfs</literal> (um sistema de arquivos em memória). Para um disco real, você poderia ver a partição que hospeda o objeto (por exemplo: "hda3").

source: The object is identified by the inode number 5510.
pt_br: O objeto esta identificado pelo inode numero 5510.

source: This is the security context of the process who executed the operation.
pt_br: Este é o contexto de segurança do processo que executou a operação.

source: This is the security context of the target object.
pt_br: Este é o contexto de segurança do objeto destino.

source: The target object is a FIFO file.
pt_br: O objeto destino é um arquivo FIFO.

source: By observing this log entry, it is possible to build a rule that would allow this operation. For example: <literal>allow syslogd_t device_t:fifo_file { read write }</literal>. This process can be automated, and it's exactly what the <command>audit2allow</command> command (of the <emphasis role="pkg">policycoreutils</emphasis> package) offers. This approach is only useful if the various objects are already correctly labeled according to what must be confined. In any case, you will have to carefully review the generated rules and validate them according to your knowledge of the application. Effectively, this approach tends to grant more rights than are really required. The proper solution is often to create new types and to grant rights on those types only. It also happens that a denied operation isn't fatal to the application, in which case it might be better to just add a “<literal>dontaudit</literal>” rule to avoid the log entry despite the effective denial.
pt_br: Ao observar essa entrada de log, é possível construir uma regra que permite esta operação. Por exemplo: <literal>allow syslogd_t device_t:fifo_file { read write }</literal>. Este processo pode ser automatizado, e é exatamente o que o comando <command>audit2allow</command> oferece (do pacote <emphasis role="pkg">policycoreutils</emphasis>). Esta abordagem só é útil se os vários objetos já estão corretamente rotulados de acordo com o que deve ser confinado. Em qualquer caso, você terá que analisar cuidadosamente as regras geradas e as validar de acordo com o seu conhecimento da aplicacao. Efetivamente, essa abordagem tende a conceder mais direitos do que são realmente necessários. A solução adequada é muitas vezes criar novos tipos de concessão de direitos apenas sobre esses tipos. Acontece também de uma operação negada não ser fatal para a aplicação, neste caso pode ser melhor adicionar uma regra "<literal>dontaudit</literal>" para evitar a entrada de log, apesar da efetiva negação.

source: <emphasis>COMPLEMENTS</emphasis> No roles in policy rules
pt_br: <emphasis>COMPLEMENTOS</emphasis> Nao ha papeis nas regras de politicas

source: It might seem weird that roles do not appear at all when creating new rules. SELinux uses only the domains to find out which operations are allowed. The role intervenes only indirectly by allowing the user to switch to another domain. SELinux is based on a theory known as <emphasis>Type Enforcement</emphasis> and the type is the only element that matters when granting rights. <indexterm><primary>Type Enforcement</primary></indexterm> <indexterm><primary>Enforcement, Type Enforcement</primary></indexterm>
pt_br: Pode parecer estranho que os papéis não aparecem em tudo ao criar novas regras. SELinux utiliza apenas os domínios para descobrir quais operações são permitidas. A intervenção do papel apenas de forma indireta, permitindo ao usuário alternar para outro domínio. SELinux é baseado em uma teoria conhecida como <emphasis>Tipo de aplicacao</emphasis> e o tipo é o único elemento que importa na concessão de direitos. <indexterm><primary>Tipo de aplicacao</primary></indexterm><indexterm><primary>Aplicacao, Tipo de aplicacai</primary></indexterm>

source: Compiling the Files
pt_br: Compilando os Arquivos

source: Once the 3 files (<filename>example.if</filename>, <filename>example.fc</filename>, and <filename>example.te</filename>) match your expectations for the new rules, just run <command>make</command> to generate a module in the <filename>example.pp</filename> file (you can immediately load it with <command>semodule -i example.pp</command>). If several modules are defined, <command>make</command> will create all the corresponding <filename>.pp</filename> files.
pt_br: Uma vez que os 3 arquivos (<filename>example.if</filename>, <filename>example.fc</filename>, e <filename>example.te</filename>) correspondem às suas expectativas para as novas regras, basta executar <command>make</command> para gerar um módulo no arquivo <filename>example.pp file></filename> (você pode o carregar imediatamente com <command>semodule -i example.pp</command>). Se vários módulos são definidos, <command>make</command> irá criar todos os arquivos correspondentes <filename>.pp</filename>.

source: Other Security-Related Considerations
pt_br: Outras Consideracoes Relacionadas a Seguranca
