Repository: binary-com/mobile
Catalog: */14_security.po
Languages: pt_br

source: In other cases, the recommended way is to register the configuration script in an <literal>up</literal> directive of the <filename>/etc/network/interfaces</filename> file. In the following example, the script is stored under <filename>/usr/local/etc/arrakis.fw</filename>.
pt_br: Em outros casos, a maneira recomendada é registrar o script de configuração em uma directiva <literal>up</literal> do <filename>/etc/network/interfaces</filename>. No exemplo a seguir, o script é armazenado em <filename>/usr/local/etc/arrakis.fw</filename>.

source: <filename>interfaces</filename> file calling firewall script
pt_br: arquivo <filename>interfaces</filename> chamando script firewall

source: Supervision: Prevention, Detection, Deterrence
pt_br: Supervisão: Prevenção, Detecção, Desencorajamento

source: <primary>monitoring</primary>
pt_br: <primary>Monitoramento</primary>

source: Monitoring is an integral part of any security policy for several reasons. Among them, that the goal of security is usually not restricted to guaranteeing data confidentiality, but it also includes ensuring availability of the services. It is therefore imperative to check that everything works as expected, and to detect in a timely manner any deviant behavior or change in quality of the service(s) rendered. Monitoring activity can help detecting intrusion attempts and enable a swift reaction before they cause grave consequences. This section reviews some tools that can be used to monitor several aspects of a Debian system. As such, it completes the section dedicated to generic system monitoring in <xref linkend="advanced-administration" />.
pt_br: O monitoramento é uma parte integrante de qualquer política de segurança por várias razões. Entre elas, que o objetivo da segurança não é normalmente restrito a garantir a confidencialidade dos dados, mas também inclui a disponibilidade assegurada dos serviços. Portanto, é imperativo verificar se tudo funciona como esperado, e para detectar em tempo hábil qualquer desvio no comportamento ou mudança na qualidade do(s) serviço(s) processado(s). Atividade de monitoramento pode ajudar a detectar tentativas de intrusão e permitir uma reação rápida antes que causem consequências graves. Esta seção analisa algumas ferramentas que podem ser usadas para monitorar vários aspectos de um sistema Debian. Como tal, completa a seção dedicada ao monitoramento genérico do sistema em <xref linkend="advanced-administration"/>.

source: Monitoring Logs with <command>logcheck</command>
pt_br: Monitoramento de Logs com <command>logcheck</command>

source: <primary>logs</primary><secondary>monitoring</secondary>
pt_br: <primary>logs</primary><secondary>monitorando</secondary>

source: <primary>monitoring</primary><secondary>log files</secondary>
pt_br: <primary>monitorando</primary><secondary>arquivos log</secondary>

source: The <command>logcheck</command> program monitors log files every hour by default. It sends unusual log messages in emails to the administrator for further analysis.
pt_br: O programa <command>logcheck</command> monitora arquivos de log a cada hora por padrão. Ele envia mensagens de log incomuns em e-mails para o administrador, para posterior análise.

source: The list of monitored files is stored in <filename>/etc/logcheck/logcheck.logfiles</filename>; the default values work fine if the <filename>/etc/syslog.conf</filename> file has not been completely overhauled.
pt_br: A lista de arquivos monitorados é armazenada em <filename>/etc/logcheck/logcheck.logfiles</filename>, os valores padrão funcionam bem se o arquivo <filename>/etc/syslog.conf</filename> não foi completamente refeito.

source: <command>logcheck</command> can work in one of three more or less detailed modes: <emphasis>paranoid</emphasis>, <emphasis>server</emphasis> and <emphasis>workstation</emphasis>. The first one is <emphasis>very</emphasis> verbose, and should probably be restricted to specific servers such as firewalls. The second (and default) mode is recommended for most servers. The last one is designed for workstations, and is even terser (it filters out more messages).
pt_br: <command>logcheck</command> pode trabalhar em um dos três modos mais ou menos detalhados: <emphasis>paranoid</emphasis>, <emphasis>server</emphasis> e <emphasis>workstation</emphasis>. O primeiro é <emphasis>muito</emphasis> verboso, e provavelmente deve ser restrito a servidores específicos, tais como firewalls. O segundo modo (e padrão) é recomendado para a maioria dos servidores. O último é projetado para estações de trabalho, e é ainda suscinto (que filtra mais mensagens).

source: In all three cases, <command>logcheck</command> should probably be customized to exclude some extra messages (depending on installed services), unless the admin really wishes to receive hourly batches of long uninteresting emails. Since the message selection mechanism is rather complex, <filename>/usr/share/doc/logcheck-database/README.logcheck-database.gz</filename> is a required — if challenging — read.
pt_br: Nos três casos, <command>logcheck</command> provavelmente deve ser personalizado para excluir algumas mensagens extras (dependendo dos serviços instalados), a menos que o administrador realmente deseje receber lotes por hora de longos e-mails desinteressantes. Uma vez que o mecanismo de seleção de mensagem é bastante complexo, <filename>/usr/share/doc/logcheck-database/README.logcheck-database.gz</filename> é uma necessidade - se desafiador - leia.

source: The applied rules can be split into several types:
pt_br: As regras aplicadas podem ser divididas em vários tipos:

source: those that qualify a message as a cracking attempt (stored in a file in the <filename>/etc/logcheck/cracking.d/</filename> directory);
pt_br: aqueles que qualificam uma mensagem como uma tentativa de invasao (armazenado em um arquivo no diretorio <filename>/etc/logcheck/cracking.d/</filename>);

source: those canceling such a qualification (<filename>/etc/logcheck/cracking.ignore.d/</filename>);
pt_br: aqueles cancelando essas qualificaçoes (<filename>/etc/logcheck/cracking.ignore.d/</filename>);

source: those classifying a message as a security alert (<filename>/etc/logcheck/violations.d/</filename>);
pt_br: aqueles classificando uma mensagem como um alerta de segurança (<filename>/etc/logcheck/violations.d/</filename>);

source: those canceling this classification (<filename>/etc/logcheck/violations.ignore.d/</filename>);
pt_br: aqueles cancelando esta classificacao (<filename>/etc/logcheck/violations.ignore.d/</filename>);

source: finally, those applying to the remaining messages (considered as <emphasis>system events</emphasis>).
pt_br: finalmente, as que se aplicam às mensagens restantes (consideradas como <emphasis>eventos de sistema</emphasis>).

source: <emphasis>CAUTION</emphasis> Ignoring a message
pt_br: <emphasis>ATENÇÃO</emphasis> Ignorando uma mensagem

source: Any message tagged as a cracking attempt or a security alert (following a rule stored in a <filename>/etc/logcheck/violations.d/myfile</filename> file) can only be ignored by a rule in a <filename>/etc/logcheck/violations.ignore.d/myfile</filename> or <filename>/etc/logcheck/violations.ignore.d/myfile-<replaceable>extension</replaceable></filename> file.
pt_br: Qualquer mensagem marcada como uma tentativa de invasao ou um alerta de segurança (seguindo uma regra armazenada num arquivo <filename>/etc/logcheck/violations.d/myfile</filename>) só pode ser ignorada por uma regra em <filename>/etc/logcheck/violations.ignore.d/myfile</filename> ou no arquivo <filename>/etc/logcheck/violations.ignore.d/myfile-<replaceable>extensão</replaceable></filename>.

source: A system event is always signaled unless a rule in one of the <filename>/etc/logcheck/ignore.d.{paranoid,server,workstation}/</filename> directories states the event should be ignored. Of course, the only directories taken into account are those corresponding to verbosity levels equal or greater than the selected operation mode.
pt_br: Um evento de sistema é sempre sinalizado a menos que uma regra em um dos diretorios <filename>/etc/logcheck/ignore.d. {paranoid,server,workstation}/</filename> indica que o evento deve ser ignorado. Naturalmente, apenas os directórios levados em consideração são aqueles que correspondem aos níveis de verbosidade iguais ou maiores que o modo de funcionamento seleccionado.

source: <emphasis>TIP</emphasis> Your logs as screen background
pt_br: <emphasis>DICA</emphasis> Seus logs como fundo de tela

source: Some administrators like seeing their log messages scroll by in real time; the <command>root-tail</command> command (in the <emphasis role="pkg">root-tail</emphasis>) package can be used to integrate the logs into the background of their graphical desktop. The <command>xconsole</command> program (in the <emphasis>x11-apps</emphasis> package) can also have them scrolling in a small window. Messages are directly taken from <command>syslogd</command> via the <filename>/dev/xconsole</filename> named pipe.
pt_br: Alguns administradores gostam de ver suas mensagens de log rolar em tempo real, o comando <command>root-tail</command> (no pacote <emphasis role="pkg">root-tail</emphasis>) pode ser usado para integrar os logs para o fundo da sua área de trabalho gráfica. O programa <command>xconsole</command> (no pacote <emphasis>x11-apps</emphasis>) pode também tê-los rolando em uma pequena janela. As mensagens são diretamente retiradas de <command>syslogd</command> através do <filename>/dev/xconsole</filename> chamado pipe.

source: <primary>logs</primary><secondary>display</secondary>
pt_br: <primary>logs</primary><secondary>exibir</secondary>

source: Monitoring Activity
pt_br: Monitorando Atividades

source: <primary>monitoring</primary><secondary>activity</secondary>
pt_br: <primary>monitorando</primary><secondary>atividades</secondary>

source: <primary>activity, monitoring</primary>
pt_br: <primary>atividades, monitorando</primary>

source: In Real Time
pt_br: Em Tempo Real

source: <command>top</command> is an interactive tool that displays a list of currently running processes. The default sorting is based on the current amount of processor use and can be obtained with the <keycap>P</keycap> key. Other sort orders include a sort by occupied memory (<keycap>M</keycap> key), by total processor time (<keycap>T</keycap> key) and by process identifier (<keycap>N</keycap> key). The <keycap>k</keycap> key allows killing a process by entering its process identifier. The <keycap>r</keycap> key allows <emphasis>renicing</emphasis> a process, i.e. changing its priority.
pt_br: <command>top</command> é uma ferramenta interativa que exibe uma lista de processos em execução. A triagem padrão baseia se na quantidade atual de utilização do processador e pode ser obtida com a tecla <keycap>P</keycap>. Outras ordens de classificação incluem uma espécie de memória ocupada (tecla <keycap>M</keycap>), pelo tempo total do processador (tecla <keycap>T</keycap>) e pelo identificador de processo (tecla <keycap>N</keycap>). A tecla <keycap>k</keycap> permite matar um processo, digitando seu identificador de processo. O tecla <keycap>r</keycap> permite <emphasis>renicing</emphasis> um processo, ou seja, mudar sua prioridade.

source: When the system seems to be overloaded, <command>top</command> is a great tool to see which processes are competing for processor time or consume too much memory. In particular, it is often interesting to check if the processes consuming resources match the real services that the machine is known to host. An unknown process running as the www-data user should really stand out and be investigated, since it's probably an instance of software installed and executed on the system through a vulnerability in a web application.
pt_br: Quando o sistema parece estar sobrecarregado, <command>top</command> é uma ótima ferramenta para ver quais processos estão competindo por tempo de processador ou consumindo muita memória. Em particular, muitas vezes é interessante verificar se os recursos do processos que consomem coincidem com os serviços reais conhecidos que a máquina hospeda. Um processo desconhecido rodando como o usuário www-data deve realmente se destacar e ser investigado, já que é provavelmente uma instância do software instalado e executado no sistema através de uma vulnerabilidade em uma aplicação web.

source: <command>top</command> is a very flexible tool and its manual page gives details on how to customize its display and adapt it to one's personal needs and habits.
pt_br: <command>top</command> é uma ferramenta muito flexível e sua página de manual dá detalhes sobre como personalizar a sua exibição e adaptá la às nossas necessidades pessoais e hábitos.

source: The <command>gnome-system-monitor</command> and <command>qps</command> graphical tools are similar to <command>top</command> and they provide roughly the same features.
pt_br: As ferramentas gráficas <command>gnome-system-monitor</command> e <command>qps</command> são semelhantes ao <command>top</command> e proporcionam mais ou menos as mesmas características.

source: History
pt_br: Historia

source: <primary>activity, history</primary>
pt_br: <primary>atividades, historico de</primary>

source: Processor load, network traffic and free disk space are information that are constantly varying. Keeping a history of their evolution is often useful in determining exactly how the computer is used.
pt_br: Carga do processador, o tráfego de rede e o espaço livre no disco são informações que variam constantemente. Manter um histórico de sua evolução é muitas vezes útil para determinar exatamente como o computador é usado.

source: There are many dedicated tools for this task. Most can fetch data via SNMP (<emphasis>Simple Network Management Protocol</emphasis>) in order to centralize this information. An added benefit is that this allows fetching data from network elements that may not be general-purpose computers, such as dedicated network routers or switches.
pt_br: Existem muitas ferramentas dedicadas a esta tarefa. A maioria pode buscar dados via SNMP (<emphasis>Simple Network Management Protocol</emphasis>, a fim de centralizar esta informação. Um benefício adicional é que este permite buscar dados de elementos de rede que podem não ser de computadores de uso geral, tais como roteadores de rede dedicadas ou switches.

source: This book deals with Munin in some detail (see <xref linkend="sect.munin" />) as part of <xref linkend="advanced-administration" xrefstyle="select: label quotedtitle" />. Debian also provides a similar tool, <emphasis role="pkg">cacti</emphasis>. Its deployment is slightly more complex, since it is based solely on SNMP. Despite having a web interface, grasping the concepts involved in configuration still requires some effort. Reading the HTML documentation (<filename>/usr/share/doc/cacti/html/index.html</filename>) should be considered a prerequisite.
pt_br: Este livro trata do Munin com algum detalhe (ver <xref linkend="sect.munin" />) como parte do <xref linkend="advanced-administration" xrefstyle="select: label quotedtitle" />. O Debian também fornece uma ferramenta similar, <emphasis role="pkg">cacti</emphasis>. Sua implantação é um pouco mais complexa, pois se baseia apenas em SNMP. Apesar de ter uma interface web, compreender os conceitos envolvidos na configuração ainda requer algum esforço. Lendo a documentação HTML (<filename>/usr/share/doc/cacti/html/index.html</filename>) deve ser considerado um pré-requisito.

source: <emphasis>ALTERNATIVE</emphasis> <command>mrtg</command>
pt_br: <emphasis>ALTERNATIVO</emphasis> <command>mrtg</command>

source: <command>mrtg</command> (in the similarly-named package) is an older tool. Despite some rough edges, it can aggregate historical data and display them as graphs. It includes a number of scripts dedicated to collecting the most commonly monitored data such as processor load, network traffic, web page hits, and so on.
pt_br: <command>mrtg</command> (do pacote com mesmo nome) é uma antiga ferramenta. Apesar de algumas arestas, ela pode agregar dados históricos e exibi-los na forma de gráficos. Ela inclui uma série de scripts dedicados à coleta de dados mais comumente monitorados, tais como a carga do processador, o tráfego de rede, acessos à página da web, e assim por diante.

source: The <emphasis role="pkg">mrtg-contrib</emphasis> and <emphasis role="pkg">mrtgutils</emphasis> packages contain example scripts that can be used directly.
pt_br: Os pacotes <emphasis role="pkg">mrtg-contrib</emphasis> e <emphasis role="pkg">mrtgutils</emphasis> contem exemplos de scripts que podem ser utilizados diretamente.

source: Detecting Changes
pt_br: Detectando Modificações

source: Once the system is installed and configured, and barring security upgrades, there's usually no reason for most of the files and directories to evolve, data excepted. It is therefore interesting to make sure that files actually do not change: any unexpected change would therefore be worth investigating. This section presents a few tools able to monitor files and to warn the administrator when an unexpected change occurs (or simply to list such changes).
pt_br: Uma vez que o sistema esteja instalado e configurado, e impedindo atualizações de segurança, geralmente não há razão para a maioria dos arquivos e diretórios para evoluirem, exceeto os dados. É interessante, portanto, certificar se que os arquivos realmente não alteram: qualquer mudança seria, portanto, inesperada, valendo a pena investigar. Esta seção apresenta algumas ferramentas capazes de monitorar os arquivos e para avisar o administrador quando ocorrer uma mudança inesperada (ou simplesmente para listar tais mudanças).

source: Auditing Packages: <command>debsums</command> and its Limits
pt_br: Auditando Pacotes: <command>debsums</command> e seus limites

source: <emphasis>GOING FURTHER</emphasis> Protecting against upstream changes
pt_br: <emphasis>INDO ALEM</emphasis> Protegendo se contra mudanças mais significativas

source: <command>debsums</command> is useful in detecting changes to files coming from a Debian package, but it will be useless if the package itself is compromised, for instance if the Debian mirror is compromised. Protecting against this class of attacks involves using APT's digital signature verification system (see <xref linkend="sect.package-authentication" />), and taking care to only install packages from a certified origin.
pt_br: <command>debsums</command> é útil na detecção de alterações em arquivos provenientes de um pacote Debian, mas será inútil se o pacote em si está comprometidO, por exemplo, se o espelho Debian está comprometida. Protegendo-se contra este tipo de ataques envolve a utilização de sistema APT de verificação de assinatura digital (veja <xref linkend="sect.package-authentication" />), e tomando cuidado para só instalar pacotes a partir de uma origem certificada.

source: <command>debsums</command> is an interesting tool since it allows finding what installed files have been modified (potentially by an attacker), but this should be taken with a grain of salt. First, because not all Debian packages provide the fingerprints required by this program (they can be found in <filename>/var/lib/dpkg/info/<replaceable>package</replaceable>.md5sums</filename> when they exist). <indexterm><primary>fingerprint</primary></indexterm> <indexterm><primary>control sum</primary></indexterm> <indexterm><primary>MD5</primary></indexterm> <indexterm><primary>SHA1</primary></indexterm> As a reminder: a fingerprint is a value, often a number (even though in hexadecimal notation), that contains a kind of signature for the contents of a file. This signature is calculated with an algorithm (MD5 or SHA1 being well-known examples) that more or less guarantee that even the tiniest change in the file contents implies a change in the fingerprint; this is known as the “avalanche effect”. This allows a simple numerical fingerprint to serve as a litmus test to check whether the contents of a file have been altered. These algorithms are not reversible; in other words, for most of them, knowing a fingerprint doesn't allow finding the corresponding contents. Recent mathematical advances seem to weaken the absoluteness of these principles, but their use is not called into question so far, since creating different contents yielding the same fingerprint still seems to be quite a difficult task.
pt_br: <command>debsums</command> é uma ferramenta interessante, pois permite encontrar o que instalou arquivos que foram modificados (potencialmente por um atacante), mas isso deve ser tomado com certa reserva. Primeiro, porque nem todos os pacotes do Debian contém as impressões digitais exigidas por este programa (que pode ser encontrado em <filename>/var/lib/dpkg/info/<replaceable>pacote</replaceable>. Md5sums </filename> quando existir). <indexterm><primary>fingerprint</primary></indexterm> <indexterm><primary>control sum</primary></indexterm><indexterm><primary>MD5</primary></indexterm><indexterm><primary>SHA1</primary></indexterm> Como um lembrete: a impressão digital é um valor, muitas vezes um número (mesmo que em notação hexadecimal), que contém uma espécie de assinatura para o conteúdo de um arquivo. Esta assinatura é calculada com um algoritmo (MD5 ou SHA1 sendo exemplos bem conhecidos) que garanta mais ou menos que, mesmo a mais ínfima mudança no conteúdo do arquivo implica uma mudança na impressão digital, o que é conhecido como o "efeito avalanche". Isto permite uma impressão digital numérica simples para servir como um teste para verificar se o conteúdo de um arquivo foram alterado. Estes algoritmos não são reversíveis, em outras palavras, para a maioria deles, sabendo a impressão digital não permite encontrar o conteúdo correspondente. Os recentes avanços matemáticos parecem enfraquecer o poder absoluto destes princípios, mas seu uso não é posto em causa, até agora, produzir a mesma impressão digital apartir de conteúdos diferentes ainda parece ser uma tarefa bastante difícil.

source: In addition, the <filename>md5sums</filename> files are stored on the hard disk; a thorough attacker will therefore update these files so they contain the new control sums for the subverted files.
pt_br: Além disso, os arquivos <filename>MD5sums</filename> estão armazenados no disco rígido, um atacante completo, portanto, atualizara esses arquivos para que eles contenham as novas somas de controle para os arquivos subvertidos.

source: The first drawback can be avoided by asking <command>debsums</command> to base its checks on a <filename>.deb</filename> package instead of relying on the <filename>md5sums</filename> file. But that requires downloading the matching <filename>.deb</filename> files first:
pt_br: O primeiro inconveniente pode ser evitado, pedindo <command>debsums</command> para basearsuas verificações em um pacote <filename>.deb</filename> em vez de depender dos arquivos <filename>md5sums</filename>. Mas que requer o download do arquivo <filename>.deb</filename> correspondente primeiro:

source: It is also worth noting that, in its default configuration, <command>debsums</command> automatically generates the missing <filename>md5sums</filename> files whenever a package is installed using APT.
pt_br: É importante notar também que, em sua configuração padrão, <command>debsums</command> gera automaticamente os arquivos <filename>md5sums</filename> sempre que um pacote é instalado usando o APT.
