Repository: binary-com/mobile
Catalog: */14_security.po
Languages: pt_br

source: For reference, a receive buffer is a small memory zone storing data between the time it arrives from the network and the time the kernel handles it. If this zone is full, new data cannot be received, and ICMP signals the problem, so that the emitter can slow down its transfer rate (which should ideally reach an equilibrium after some time).
pt_br: Para referência, um buffer de recepção é uma pequena região de memória para armazenamento de dados entre o tempo que chega na rede e o tempo que o kernel o manipula. Se esta regiao está cheia, os novos dados não podem ser recebidos, e o ICMP sinaliza o problema, de modo que o emissor possa abrandar a sua taxa de transferência (que devem, idealmente, chegar a um equilíbrio após algum tempo).

source: <primary>receive buffer</primary>
pt_br: <primary>buffer de recepção</primary>

source: <primary>buffer</primary><secondary>receive buffer</secondary>
pt_br: <primary>buffer</primary><secondary>buffer de recepcao</secondary>

source: Note that although an IPv4 network can work without ICMP, ICMPv6 is strictly required for an IPv6 network, since it combines several functions that were, in the IPv4 world, spread across ICMPv4, IGMP (<emphasis>Internet Group Membership Protocol</emphasis>) and ARP (<emphasis>Address Resolution Protocol</emphasis>). ICMPv6 is defined in RFC4443. <ulink type="block" url="http://www.faqs.org/rfcs/rfc4443.html" />
pt_br: Observe que, embora uma rede IPv4 possa funcionar sem ICMP, ICMPv6 é estritamente necessário para uma rede IPv6, uma vez que combina várias funções que eram, no mundo IPv4, espalhados por ICMPv4, IGMP (<emphasis>Internet Group Membership Protocol</emphasis>) e ARP (<emphasis>Address Resolution Protocol</emphasis>). ICMPv6 é definido na RFC4443. <ulink type="block" url="http://www.faqs.org/rfcs/rfc4443.html" />

source: <literal>ACCEPT</literal>: allow the packet to go on its way;
pt_br: <literal>ACCEPT</literal>: permite que o pacote siga seu caminho;

source: <literal>REJECT</literal>: reject the packet with an ICMP error packet (the <literal>--reject-with <replaceable>type</replaceable></literal> option to <command>iptables</command> allows selecting the type of error);
pt_br: <literal>REJECT</literal>: rejeita o pacote com um erro ICMP (o <literal>--reject-with <replaceable>tipo</replaceable></literal> opção para <command>iptables</command> permite seleccionar o tipo de erro);

source: <literal>DROP</literal>: delete (ignore) the packet;
pt_br: <literal>DROP</literal>: apaga (ignora) o pacote;

source: <literal>LOG</literal>: log (via <command>syslogd</command>) a message with a description of the packet; note that this action does not interrupt processing, and the execution of the chain continues at the next rule, which is why logging refused packets requires both a LOG and a REJECT/DROP rule;
pt_br: <literal>LOG</literal>: log (via <command>syslogd</command>) uma mensagem com uma descrição do pacote, observe que esta ação não interrompe o processamento, e a execução da cadeia continua na próxima regra, razão pela qual recusou registro de pacotes, requer as regras tanto LOG quanto REJECT/DROP;

source: <literal>ULOG</literal>: log a message via <command>ulogd</command>, which can be better adapted and more efficient than <command>syslogd</command> for handling large numbers of messages; note that this action, like LOG, also returns processing to the next rule in the calling chain;
pt_br: <literal>ULOG</literal>: registrar uma mensagem via <command>ulogd</command>, que pode ser melhor adaptada e mais eficiente do que <command>syslogd</command> para lidar com um grande número de mensagens, observe que esta ação, como LOG, também retorna o processamento para a próxima regra na cadeia chamada;

source: <replaceable>chain_name</replaceable>: jump to the given chain and evaluate its rules;
pt_br: <replaceable>chain_name</replaceable>: Vá para a cadeia e avalie as suas regras;

source: <literal>RETURN</literal>: interrupt processing of the current chain, and return to the calling chain; in case the current chain is a standard one, there's no calling chain, so the default action (defined with the <literal>-P</literal> option to <command>iptables</command>) is executed instead;
pt_br: <literal>RETURN</literal>: interrompe o processamento da cadeia atual, e volta para a cadeia de chamada; no caso a cadeia atual é padrão, não há nenhuma cadeia de chamada, de modo que a ação padrão (definida com a opção <literal>- P</literal> para o <command>iptables</command>) é executada em vez disto;

source: <literal>SNAT</literal> (only in the <literal>nat</literal> table, therefore only in IPv4 on <emphasis role="distribution">Wheezy</emphasis> — NAT support for IPv6 appeared in the Linux 3.7 kernel): apply <emphasis>Source NAT</emphasis> (extra options describe the exact changes to apply);
pt_br: <literal>SNAT</literal> (apenas na tabela <literal>nat</literal>, portanto, somente em IPv4 no <emphasis role="distribution">Whezzy</emphasis> - o suporte NAT para IPv6 apareceu no kernel Linux 3.7): aplicar <emphasis>Nat de origem</emphasis> (opções extra descrevem as alterações exatas para aplicar);

source: <literal>DNAT</literal> (only in the <literal>nat</literal> table, therefore only in IPv4 on <emphasis role="distribution">Wheezy</emphasis>): apply <emphasis>Destination NAT</emphasis> (extra options describe the exact changes to apply);
pt_br: <literal>DNAT</literal> (apenas na tabela <literal>nat</literal>, portanto, somente em IPv4 no <emphasis role="distribution">Whezzy</emphasis>: aplica <emphasis>NAT de Destino</emphasis> (opções extra descrevem as alterações exatas para aplicar);

source: <literal>MASQUERADE</literal> (only in the <literal>nat</literal> table, therefore only in IPv4 on <emphasis role="distribution">Wheezy</emphasis>): apply <emphasis>masquerading</emphasis> (a special case of <emphasis>Source NAT</emphasis>);
pt_br: <literal>MASQUERADE</literal> (apenas na tabela <literal>nat</literal>, portanto, somente em IPv4 no <emphasis role="distribution">Whezzy</emphasis>): aplica <emphasis>masquerading</emphasis> (um caso especial de <emphasis>NAT de origem</emphasis>);

source: <literal>REDIRECT</literal> (only in the <literal>nat</literal> table, therefore only in IPv4 on <emphasis role="distribution">Wheezy</emphasis>): redirect a packet to a given port of the firewall itself; this can be used to set up a transparent web proxy that works with no configuration on the client side, since the client thinks it connects to the recipient whereas the communications actually go through the proxy.
pt_br: <literal>REDIRECT</literal> (apenas na tabela <literal>nat</literal>, portanto, somente em IPv4 no <emphasis role="distribution">Whezzy</emphasis>): redireciona um pacote para uma determinada porta do firewall, isto pode ser usado para configurar um proxy web transparente que funciona sem nenhuma configuração no lado do cliente, uma vez que o cliente pensa que ele se conecta ao destinatário e as comunicações realmente passam pelo proxy.

source: Other actions, particularly those concerning the <literal>mangle</literal> table, are outside the scope of this text. The <citerefentry><refentrytitle>iptables</refentrytitle> <manvolnum>8</manvolnum></citerefentry> and <citerefentry><refentrytitle>ip6tables</refentrytitle> <manvolnum>8</manvolnum></citerefentry> have a comprehensive list.
pt_br: Outras ações, particularmente as relativas à tabela <literal>mangle</literal>, estão fora do escopo deste texto. O <citerefentry><refentrytitle>iptables</refentrytitle> <manvolnum>8</manvolnum></citerefentry> e <citerefentry> <refentrytitle>ip6tables</refentrytitle> <manvolnum>8</manvolnum></citerefentry> tem um lista completa.

source: Syntax of <command>iptables</command> and <command>ip6tables</command>
pt_br: Sintaxe do <command>iptables</command> e do <command>ip6tables</command>

source: The <command>iptables</command> and <command>ip6tables</command> commands allow manipulating tables, chains and rules. Their <literal>-t <replaceable>table</replaceable></literal> option indicates which table to operate on (by default, <literal>filter</literal>).
pt_br: Os comandos <command>iptables</command> e <command>ip6tables</command> permitem manipulação de tabelas, cadeias e regrass. Sua opção <literal><replaceable>tabela</replaceable> -t</literal> indica em qual tabela operar (por padrão, <literal>filtro</literal>).

source: Commands
pt_br: Comandos

source: The <literal>-N <replaceable>chain</replaceable></literal> option creates a new chain. The <literal>-X <replaceable>chain</replaceable></literal> deletes an empty and unused chain. The <literal>-A <replaceable>chain</replaceable> <replaceable>rule</replaceable></literal> adds a rule at the end of the given chain. The <literal>-I <replaceable>chain</replaceable> <replaceable>rule_num</replaceable> <replaceable>rule</replaceable></literal> option inserts a rule before the rule number <replaceable>rule_num</replaceable>. The <literal>-D <replaceable>chain</replaceable> <replaceable>rule_num</replaceable></literal> (or <literal>-D <replaceable>chain</replaceable> <replaceable>rule</replaceable></literal>) option deletes a rule in a chain; the first syntax identifies the rule to be deleted by its number, while the latter identifies it by its contents. The <literal>-F <replaceable>chain</replaceable></literal> option flushes a chain (deletes all its rules); if no chain is mentioned, all the rules in the table are deleted. The <literal>-L <replaceable>chain</replaceable></literal> option lists the rules in the chain. Finally, the <literal>-P <replaceable>chain</replaceable> <replaceable>action</replaceable></literal> option defines the default action, or “policy”, for a given chain; note that only standard chains can have such a policy.
pt_br: A opção <literal>-N <replaceable>cadeia</replaceable></literal> cria uma nova cadeia. A <literal>-X <replaceable>cadeia</replaceable></literal> exclui uma cadeia vazia e sem uso. A <literal>-A <replaceable>cadeia</replaceable> <replaceable>regra</replaceable></literal> adiciona uma regra no final da cadeia dada. A opção <literal>-I <replaceable>cadeia</replaceable> <replaceable>número_regra</replaceable> <replaceable>regra</replaceable></literal> insere uma regra antes da regra número <replaceable>número_regra</replaceable>. A opção <literal>-D <replaceable>cadeia</replaceable> <replaceable>número_regra</replaceable></literal> (ou <literal>-D <replaceable>cadeia</replaceable> <replaceable>regra</replaceable></literal>) remove uma regra na cadeia, a primeira sintaxe identifica a regra a ser removida pelo seu número, enquanto o segundo o identifica pelo seu conteúdo. A opção <literal>-F <replaceable>cadeia</replaceable></literal> esvazia uma cadeia (remove todas suas regras); se nenhuma cadeia é mencionada, todas as regras da tabela são removidas. A opção <literal>-L <replaceable>cadeia</replaceable></literal> lista as regras na cadeia. Finalmente, a opção <literal>-P <replaceable>cadeia</replaceable> <replaceable>ação</replaceable></literal> define a ação padrão, ou "política", para uma dada cadeia; observe que apenas as cadeias padrão podem ter essa política.

source: Rules
pt_br: Regras

source: Each rule is expressed as <literal><replaceable>conditions</replaceable> -j <replaceable>action</replaceable> <replaceable>action_options</replaceable></literal>. If several conditions are described in the same rule, then the criterion is the conjunction (logical <emphasis>and</emphasis>) of the conditions, which is at least as restrictive as each individual condition.
pt_br: Cada regra é expressa como <literal><replaceable>condições</replaceable> -j <replaceable>ação</replaceable> <replaceable>opcoes_acoes</replaceable></literal>. Se várias condições são descritas na mesma regra, então o critério é a conjunção (lógica <emphasis>e</emphasis>) das condições, que é pelo menos tão restritiva quanto cada condição individual.

source: The <literal>-p <replaceable>protocol</replaceable></literal> condition matches the protocol field of the IP packet. The most common values are <literal>tcp</literal>, <literal>udp</literal>, <literal>icmp</literal>, and <literal>icmpv6</literal>. Prefixing the condition with an exclamation mark negates the condition, which then becomes a match for “any packets with a different protocol than the specified one”. This negation mechanism is not specific to the <literal>-p</literal> option and it can be applied to all other conditions too.
pt_br: A condição <literal>-p <replaceable>protocolo</replaceable></literal> corresponde ao campo protocolo do pacote IP. Os valores mais comuns são <literal>tcp</literal>, <literal>udp</literal>, <literal>icmp</literal>, e <literal>ICMPv6</literal>. Prefixando a condição com um ponto de exclamação nega a condição, que se transforma numa correspondência para "todos os pacotes com um protocolo diferente da especificada". Este mecanismo de negação não é específico para a opção <literal>-p</literal> e também pode ser aplicada a todas outras condições.

source: The <literal>-s <replaceable>address</replaceable></literal> or <literal>-s <replaceable>network/mask</replaceable></literal> condition matches the source address of the packet. Correspondingly, <literal>-d <replaceable>address</replaceable></literal> or <literal>-d <replaceable>network/mask</replaceable></literal> matches the destination address.
pt_br: A condição <literal>-s <replaceable>endereço</replaceable></literal> ou <literal>-s <replaceable>rede/máscara</replaceable></literal> corresponde o endereço de origem do pacote. Do mesmo modo, <literal>-d <replaceable>endereço</replaceable></literal> ou <literal>-d <replaceable>rede/máscara</replaceable></literal> corresponde o endereço de destino.

source: The <literal>-i <replaceable>interface</replaceable></literal> condition selects packets coming from the given network interface. <literal>-o <replaceable>interface</replaceable></literal> selects packets going out on a specific interface.
pt_br: A condicao <literal>-i <replaceable>interface</replaceable></literal> seleciona os pacotes provenientes da interface de rede. <literal>-o <replaceable>interface</replaceable></literal> seleciona pacotes saindo em uma interface específica.

source: There are more specific conditions, depending on the generic conditions described above. For instance, the <literal>-p tcp</literal> condition can be complemented with conditions on the TCP ports, with clauses such as <literal>--source-port <replaceable>port</replaceable></literal> and <literal>--destination-port <replaceable>port</replaceable></literal>.
pt_br: Existem condições mais específicas, dependendo das condições genéricas acima descritas. Por exemplo, a condição <literal>-p TCP</literal> pode ser complementada com condições sobre as portas TCP, com cláusulas como <literal>-- porta-origem <replaceable>porta</replaceable></literal> e <literal>--porta-destino <replaceable>porta</replaceable></literal>.

source: The <literal>--state <replaceable>state</replaceable></literal> condition matches the state of a packet in a connection (this requires the <command>ipt_conntrack</command> kernel module, for connection tracking). The <literal>NEW</literal> state describes a packet starting a new connection; <literal>ESTABLISHED</literal> matches packets belonging to an already existing connection, and <literal>RELATED</literal> matches packets initiating a new connection related to an existing one (which is useful for the <literal>ftp-data</literal> connections in the “active” mode of the FTP protocol).
pt_br: A condição <literal>--estado <replaceable>estado</replaceable></literal> corresponde ao estado de um pacote em uma conexão (isto requer o módulo <command>ipt_conntrack</command> do kernel, para rastreamento de conexões). O estado <literal>NEW</literal> descreve um pacote iniciando uma nova conexão; O pacote <literal>ESTABLISHED</literal> corresponde aos pacotes pertencentes a uma conexão já existente, e <literal>RELATED</literal> correspondem aos pacotes iniciando uma nova conexão relacionada a um já existente (o que é útil para as conexões <literal>ftp-data</literal> no modo "active" do protocolo FTP).

source: The previous section lists available actions, but not their respective options. The <literal>LOG</literal> action, for instance, has the following options:
pt_br: A seção anterior lista as ações disponíveis, mas não suas respectivas opções. A ação <literal>LOG</literal>, por exemplo, tem as seguintes opções:

source: <literal>--log-priority</literal>, with default value <literal>warning</literal>, indicates the <command>syslog</command> message priority;
pt_br: <literal>--log-priority</literal>, com valor padrão <literal>aviso</literal>, indica a prioridade da mensagem <command>syslog</command>;

source: <literal>--log-prefix</literal> allows specifying a text prefix to differentiate between logged messages;
pt_br: <literal>--log-prefix</literal> permite especificar um prefixo de texto para diferenciar mensagens registradas;

source: <literal>--log-tcp-sequence</literal>, <literal>--log-tcp-options</literal> and <literal>--log-ip-options</literal> indicate extra data to be integrated into the message: respectively, the TCP sequence number, TCP options, and IP options.
pt_br: <literal>--log-tcp-sequence</literal>, <literal>--log-tcp-options</literal> e <literal>--log-ip-options</literal> indicam dados extras a serem integrados na mensagem: respectivamente, o número de seqüência TCP, opções TCP, e as opções IP.

source: The <literal>DNAT</literal> action provides the <literal>--to-destination <replaceable>address</replaceable>:<replaceable>port</replaceable></literal> option to indicate the new destination IP address and/or port. Similarly, <literal>SNAT</literal> provides <literal>--to-source <replaceable>address</replaceable>:<replaceable>port</replaceable></literal> to indicate the new source IP address and/or port.
pt_br: A acao <literal>DNAT</literal> fornece a <literal>--to-destination <replaceable>endereço</replaceable>: opção <replaceable>porta</replaceable></literal> para indicar o novo endereço IP de destino e/ou porta. Da mesma forma, <literal>SNAT</literal> fornece <literal>--to-source <replaceable>endereço</replaceable>:<replaceable>porta</replaceable></literal> para indicar o novo endereço IP de origem e/ou porta.

source: The <literal>REDIRECT</literal> action (only available if NAT is available — on <emphasis role="distribution">Wheezy</emphasis>, this means IPv4 only) provides the <literal>--to-ports <replaceable>port(s)</replaceable></literal> option to indicate the port, or port range, where the packets should be redirected.
pt_br: A ação <literal>REDIRECT</literal> (disponível apenas se o NAT está disponível - no <emphasis role="distribution">Wheezy</emphasis>, que significa IPv4 somente) fornece a opção <literal>--to-ports <replaceable>porta(s)</replaceable></literal> para indicar a porta, ou intervalo de portas, onde os pacotes devem ser redirecionados.

source: Creating Rules
pt_br: Criando Regras

source: Each rule creation requires one invocation of <command>iptables</command>/<command>ip6tables</command>. Typing these commands manually can be tedious, so the calls are usually stored in a script so that the same configuration is set up automatically every time the machine boots. This script can be written by hand, but it can also be interesting to prepare it with a high-level tool such as <command>fwbuilder</command>.
pt_br: Cada criação de regra exige uma invocação de <command>iptables</command>/<command>ip6tables</command>. Digitando estes comandos manualmente pode ser tedioso, por isso as chamadas são normalmente armazenados em um script para que a mesma configuração seja criada automaticamente a cada vez que a máquina inicia. Este script pode ser escrito à mão, mas também pode ser interessante prepará lo com uma ferramenta de alto nível, tais como <command>fwbuilder</command>.

source: The principle is simple. In the first step, one needs to describe all the elements that will be involved in the actual rules:
pt_br: O princípio é simples. Na primeira etapa, é preciso descrever todos os elementos que estarão envolvidos nas atuais regras:

source: the firewall itself, with its network interfaces;
pt_br: o firewall, com suas interfaces de rede;

source: the networks, with their corresponding IP ranges;
pt_br: as redes, com suas faixas de IP correspondentes;

source: the servers;
pt_br: os servidores;

source: the ports belonging to the services hosted on the servers.
pt_br: as portas que pertencem aos serviços hospedados nos servidores.

source: The rules are then created with simple drag-and-drop actions on the objects. A few contextual menus can change the condition (negating it, for instance). Then the action needs to be chosen and configured.
pt_br: As regras são então criadas com simples ações de arrastar-e-soltar nos objetos. Alguns menus contextuais podem alterar a condição (negando o, por exemplo). Em seguida, a ação deve ser escolhida e configurada.

source: As far as IPv6 is concerned, one can either create two distinct rulesets for IPv4 and IPv6, or create only one and let <command>fwbuilder</command> translate the rules according to the addresses assigned to the objects.
pt_br: Quanto IPv6 está ativo, pode se criar dois conjuntos de regras distintas para IPv4 e IPv6, ou criar uma só e deixar <command>fwbuilder</command> traduzir as regras de acordo com os endereços atribuídos aos objetos.

source: Fwbuilder's main window
pt_br: janela principal do Fwbuilder

source: <command>fwbuilder</command> can then generate a script configuring the firewall according to the rules that have been defined. Its modular architecture gives it the ability to generate scripts targeting different systems (<command>iptables</command> for Linux, <command>ipf</command> for FreeBSD and <command>pf</command> for OpenBSD).
pt_br: <command>fwbuilder</command> pode gerar um script de configuração do firewall de acordo com as regras que foram definidas. Sua arquitetura modular lhe confere a capacidade de gerar scripts que visam diferentes sistemas (<command>iptables</command> para Linux, <command>ipf</command> para o FreeBSD e <command>pf</command> para OpenBSD).

source: Versions of the <emphasis role="pkg">fwbuilder</emphasis> package since <emphasis role="distribution">Squeeze</emphasis> contain both the graphical interface and the modules for each firewall system (these were previously split over several packages, one for each target system):
pt_br: Versões do pacote <emphasis role="pkg">fwbuilder</emphasis> desde <emphasis role="distribution">Squeeze</emphasis> contém tanto a interface gráfica e os módulos de cada sistema de firewall (estes foram previamente divididos em vários pacotes, um para cada sistema de destino):

source: Installing the Rules at Each Boot
pt_br: Instalando as Regras em cada inicializacao

source: If the firewall is meant to protect an intermittent PPP network connection, the simplest way to deploy the script is to install it as <filename>/etc/ppp/ip-up.d/0iptables</filename> (note that only files without a dot in their name are taken into account). The firewall will thus be reloaded every time a PPP connection is established.
pt_br: Se o firewall serve para proteger uma conexão de rede intermitente PPP, a maneira mais simples de implantar o script é instalá lo como <filename>/etc/ppp/ip-up.d/0iptables</filename> (observe que apenas os arquivos sem um ponto em seu nome são levados em conta). O firewall irá assim ser recarregado a cada vez que uma conexão PPP for estabelecida.
