Repository: binary-com/mobile
Catalog: */14_security.po
Languages: pt_br

source: The other problem can be avoided in a similar fashion: the check must simply be based on a pristine <filename>.deb</filename> file. Since this implies having all the <filename>.deb</filename> files for all the installed packages, and being sure of their integrity, the simplest way is to grab them from a Debian mirror. This operation can be slow and tedious, and should therefore not be considered a proactive technique to be used on a regular basis.
pt_br: O outro problema pode ser evitado de forma semelhante: o cheque deve simplesmente basear-se num puro arquivo <filename>.deb</filename>. Uma vez que esta implica em ter todos os arquivos <filename>.deb</filename> para todos os pacotes instalados, e ter certeza de sua integridade, a maneira mais simples é baixa los de um espelho Debian. Esta operação pode ser lenta e tediosa, e não deve, portanto, ser considerada uma técnica dinamica a ser utilizada numa base regular.

source: <computeroutput># </computeroutput><userinput>apt-get --reinstall -d install `grep-status -e 'Status: install ok installed' -n -s Package`</userinput> <computeroutput>[ ... ] # </computeroutput><userinput>debsums -p /var/cache/apt/archives --generate=all</userinput>
pt_br: <computeroutput># </computeroutput><userinput>apt-get --reinstall -d install `grep-status -e 'Status: install ok installed' -n -s Pacote`</userinput> <computeroutput>[ ... ] # </computeroutput><userinput>debsums -p /var/cache/apt/archives --generate=all</userinput>

source: Note that this example uses the <command>grep-status</command> command from the <emphasis role="pkg">dctrl-tools</emphasis> package, which is not installed by default.
pt_br: Note que este exemplo usa o comando <command>grep status</command> a partir do pacote <emphasis role="pkg">dctrl-tools</emphasis>, que não é instalado por padrão.

source: Monitoring Files: AIDE
pt_br: Monitorando Arquivos: AIDE

source: <primary><emphasis role="pkg">aide</emphasis> (Debian package)</primary>
pt_br: <primary><emphasis role="pkg">aide</emphasis> (Pacote Debian)</primary>

source: The AIDE tool (<emphasis>Advanced Intrusion Detection Environment</emphasis>) allows checking file integrity, and detecting any change against a previously recorded image of the valid system. This image is stored as a database (<filename>/var/lib/aide/aide.db</filename>) containing the relevant information on all files of the system (fingerprints, permissions, timestamps and so on). This database is first initialized with <command>aideinit</command>; it is then used daily (by the <filename>/etc/cron.daily/aide</filename> script) to check that nothing relevant changed. When changes are detected, AIDE records them in log files (<filename>/var/log/aide/*.log</filename>) and sends its findings to the administrator by email.
pt_br: A ferramenta AIDE (<emphasis>Advanced Intrusion Detection Environment - Ambiente Avançado de Deteccao Intrusao</emphasis>) permite verificar a integridade de arquivos, e detectar qualquer mudança em relacao a uma imagem gravada anteriormente do sistema válido. Esta imagem é armazenada como um banco de dados (<filename> /var/lib/aide/aide.db</filename>) que contém as informações relevantes de todos os arquivos do sistema (impressões digitais, permissões, timestamps e assim por diante). Este banco de dados é inicializado com <command>aideinit</command>, que é então usado diariamente (pelo script <filename>/etc/cron.daily/</filename> ) para verificar que nada de relevante mudou. Quando forem detectadas alterações, AIDE grava os em arquivos de log (<filename>/var/log/aide/*.log</filename>) e envia os seus resultados ao administrador por e-mail.

source: <emphasis>IN PRACTICE</emphasis> Protecting the database
pt_br: <emphasis>NA PRATICA</emphasis> Proteger o banco de dados

source: Since AIDE uses a local database to compare the states of the files, the validity of its results is directly linked to the validity of the database. If an attacker gets root permissions on a compromised system, they will be able to replace the database and cover their tracks. A possible workaround would be to store the reference data on read-only storage media.
pt_br: Como AIDE usa um banco de dados local para comparar os estados dos arquivos, a validade de seus resultados está diretamente ligada à validade do banco de dados. Se um atacante obtém permissões de root em um sistema comprometido, eles serão capazes de substituir o banco de dados e cobrir seus rastros. Uma possível solução seria armazenar os dados de referência em mídia somente leitura de armazenamento.

source: Many options in <filename>/etc/default/aide</filename> can be used to tweak the behavior of the <emphasis role="pkg">aide</emphasis> package. The AIDE configuration proper is stored in <filename>/etc/aide/aide.conf</filename> and <filename>/etc/aide/aide.conf.d/</filename> (actually, these files are only used by <command>update-aide.conf</command> to generate <filename>/var/lib/aide/aide.conf.autogenerated</filename>). Configuration indicates which properties of which files need to be checked. For instance, the contents of log files changes routinely, and such changes can be ignored as long as the permissions of these files stay the same, but both contents and permissions of executable programs must be constant. Although not very complex, the configuration syntax is not fully intuitive, and reading the <citerefentry><refentrytitle>aide.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> manual page is therefore recommended.
pt_br: Muitas opções em <filename>/etc/default/aide</filename> pode ser usadas para ajustar o comportamento do pacote <emphasis role="pkg">aide</emphasis>. A configuração AIDE adequada é armazenada em <filename>/etc/aide/aide.conf</filename> e <filename>/etc/aide/aide.conf.d/</filename> (na verdade, esses arquivos são usados <command>update-aide.conf</command> para gerar <filename>/var/lib/aide/aide.conf.autogenerated</filename>). Configuração indica quais propriedades de arquivos precisam ser verificadas. Por exemplo, o conteúdo de arquivos log muda rotineiramente, e estas modificações podem ser ignoradas, desde que as permissões destes arquivos permaneçam o mesmo, mas ambos os conteúdos e as permissões de programas executáveis devem ser constantes. Embora não seja muito complexo, a sintaxe de configuração não é totalmente intuitiva, e a leitura de <citerefentry><refentrytitle>aide.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> da página do manual é recomendada.

source: A new version of the database is generated daily in <filename>/var/lib/aide/aide.db.new</filename>; if all recorded changes were legitimate, it can be used to replace the reference database.
pt_br: Uma nova versão do banco de dados é gerada diariamente em <filename>/var/lib/aide/aide.db.new</filename>, se todas alterações registradas eram legítimas, ele pode ser usado para substituir o banco de dados de referência.

source: <emphasis>ALTERNATIVE</emphasis> Tripwire and Samhain
pt_br: <emphasis>ALTERNATIVO</emphasis> Tripwire and Samhain

source: Tripwire is very similar to AIDE; even the configuration file syntax is almost the same. The main addition provided by <emphasis role="pkg">tripwire</emphasis> is a mechanism to sign the configuration file, so that an attacker cannot make it point at a different version of the reference database.
pt_br: Tripwire é muito semelhante ao AIDE; mesmo a sintaxe arquivo de configuração é quase a mesma. A adição principal fornecida pelo <emphasis role="pkg">tripwire</emphasis> é um mecanismo para assinar o arquivo de configuração, de modo que um atacante não pode torná lo ponto em uma versão diferente do banco de dados de referência.

source: Samhain also offers similar features, as well as some functions to help detecting rootkits (see the QUICK LOOK sidebar). It can also be deployed globally on a network, and record its traces on a central server (with a signature).
pt_br: Samhain também oferece características semelhantes, bem como algumas funções ajudar a detectar rootkits (veja o quadro QUICK LOOK). Também pode ser implementado globalmente em uma rede, e gravar os seus vestigios em um servidor central (com uma assinatura).

source: <emphasis>QUICK LOOK</emphasis> The <emphasis role="pkg">checksecurity</emphasis> and <emphasis role="pkg">chkrootkit</emphasis>/<emphasis role="pkg">rkhunter</emphasis> packages
pt_br: <emphasis>BLOQUEIO RAPIDO</emphasis> os pacotes <emphasis role="pkg">checksecurity</emphasis> e <emphasis role="pkg">chkrootkit</emphasis>/<emphasis role="pkg">rkhunter</emphasis>

source: The first of these packages contains several small scripts performing basic checks on the system (empty passwords, new setuid files, and so on) and warning the administrator if required. Despite its explicit name, an administrator should not rely solely on it to make sure a Linux system is secure.
pt_br: O primeiro destes pacotes contém vários pequenos scripts que executam verificações básicas sobre o sistema (senhas vazias, arquivos setuid novos, e assim por diante) e alerta o administrador, se necessário. Apesar de seu nome expressar, um administrador não deve confiar somente nele para certificar se que um sistema Linux está seguro.

source: The <emphasis role="pkg">chkrootkit</emphasis> and <emphasis role="pkg">rkhunter</emphasis> packages allow looking for <emphasis>rootkits</emphasis> potentially installed on the system. As a reminder, these are pieces of software designed to hide the compromise of a system while discreetly keeping control of the machine. The tests are not 100% reliable, but they can usually draw the administrator's attention to potential problems.
pt_br: Os pacotes <emphasis role="pkg">chkrootkit</emphasis> e <emphasis role="pkg">rkhunter</emphasis> permitem buscar por potenciais <emphasis>rootkits</emphasis> instalados no sistema. Como um lembrete, existem peças de software desenvolvidas para esconder o comprometimento de um sistema enquanto, discretamente, mantém o controle da máquina. Os testes não são 100% confiáveis, mas eles geralmente chamam a atenção do administrador para potenciais problemas.

source: Detecting Intrusion (IDS/NIDS)
pt_br: Detectando Intrusoes (IDS/NIDS)

source: <primary>detection, intrusion</primary>
pt_br: <primary>deteccao, intrusao</primary>

source: <primary>intrusion detection</primary>
pt_br: <primary>intrusao deteccao</primary>

source: <primary>intrusion detection system</primary>
pt_br: <primary>sistema de deteccao de intrusao</primary>

source: <primary>Network</primary><secondary>IDS</secondary>
pt_br: <primary>Rede</primary><secondary>IDS</secondary>

source: <emphasis>BACK TO BASICS</emphasis> Denial of service
pt_br: <emphasis>DE VOLTA AO BASICO</emphasis> Negação de serviço

source: <primary>denial of service</primary>
pt_br: <primary>negacao de servico</primary>

source: A “denial of service” attack has only one goal: to make a service unavailable. Whether such an attack involves overloading the server with queries or exploiting a bug, the end result is the same: the service is no longer operational. Regular users are unhappy, and the entity hosting the targeted network service suffers a loss in reputation (and possibly in revenue, for instance if the service was an e-commerce site).
pt_br: O ataque "negação de serviço" tem apenas um objetivo: tornar um serviço indisponível. Se tal ataque envolve a sobrecarrega do servidor com consultas ou explorar uma falha, o resultado final é o mesmo: o serviço não é mais operacional. Os usuários regulares estão infelizes, e a entidade que hospeda o serviço de rede alvo sofre uma perda de reputação (e, eventualmente, em receita, por exemplo, se o serviço era um site de comércio eletrônico).

source: Such an attack is sometimes “distributed”; this usually involves overloading the server with large numbers of queries coming from many different sources so that the server becomes unable to answer the legitimate queries. These types of attacks have gained well-known acronyms: <acronym>DoS</acronym> and <acronym>DDoS</acronym> (depending on whether the denial of service attack is distributed or not).
pt_br: Tal ataque é por vezes "distribuído", o que geralmente envolve sobrecarregar o servidor com um grande número de consultas provenientes de muitas fontes diferentes para que o servidor se torna incapaz de responder às perguntas legítimas. Estes tipos de ataques ganharam siglas bem conhecidas: <acronym>DoS</acronym> e <acronym>DDoS</acronym> (dependendo se o ataque de negação de serviço distribuído ou não).

source: <command>snort</command> (in the Debian package of the same name) is a NIDS — a <emphasis>Network Intrusion Detection System</emphasis>. Its function is to listen to the network and try to detect infiltration attempts and/or hostile acts (including denial of service attacks). All these events are logged, and a daily email is sent to the administrator with a summary of the past 24 hours.
pt_br: <command>snort</command> (no pacote Debian com o mesmo nome) é um NIDS - um <emphasis>Sistema de Detecção de Intrusão de Rede</emphasis>. Sua função é ouvir a rede e tentar detectar tentativas de infiltração e/ou atos hostis (incluindo ataques de negação de serviço). Todos esses eventos são registrados, e diariamente um e-mail é enviado para o administrador com um resumo das últimas 24 horas.

source: Its configuration requires describing the range of addresses that the local network covers. In practice, this means the set of all potential attack targets. Other important parameters can be configured with <command>dpkg-reconfigure snort</command>, including the network interface to monitor. This will often be <literal>eth0</literal> for an Ethernet connection, but other possibilities exist such as <literal>ppp0</literal> for an ADSL or PSTN (<emphasis>Public Switched Telephone Network</emphasis>, or good old dialup modem), or even <literal>wlan0</literal> for some wireless network cards.
pt_br: Sua configuração exige que descreva o intervalo de endereços que a rede local cobre. Na prática, isso significa que o conjunto de todos os alvos potenciais de ataque. Outros parâmetros importantes podem ser configurados com <command>dpkg-reconfigure snort</command>, incluindo a interface de rede para monitorar. Isto será muitas vezes <literal>eth0</literal> para uma conexão Ethernet, mas existem outras possibilidades, como <literal>ppp0</literal> para uma ADSL ou PSTN (<emphasis>Public Switched Telephone Network </emphasis> ou bom e antigo modem dial-up), ou mesmo <literal>wlan0</literal> para algumas placas de rede sem fio.

source: <emphasis>GOING FURTHER</emphasis> Integration with <command>prelude</command>
pt_br: <emphasis>INDO MAIS</emphasis> Integração com o <command>prelude</command>

source: Prelude brings centralized monitoring of security information. Its modular architecture includes a server (the <emphasis>manager</emphasis> in <emphasis role="pkg">prelude-manager</emphasis>) which gathers alerts generated by <emphasis>sensors</emphasis> of various types.
pt_br: Prelude traz monitoramento centralizado de informações de segurança. Sua arquitetura modular inclui um servidor (o gerente <emphasis>manager</emphasis> em <emphasis role="pkg">prelude-manager</emphasis>) que reúne os alertas gerados por <emphasis>sensores</emphasis> de vários tipos.

source: Snort can be configured as such a sensor. Other possibilities include <emphasis>prelude-lml</emphasis> (<emphasis>Log Monitor Lackey</emphasis>) which monitors log files (in a manner similar to <command>logcheck</command>, described in <xref linkend="sect.logcheck" />).
pt_br: O Snort pode ser configurado como um doestes sensores. Outras possibilidades incluem <emphasis>prelude-lml</emphasis> (<emphasis>Log Monitor Lackey</emphasis>), que monitora os arquivos de registro (de forma semelhante ao <command>logcheck</command>, descrito em <xref linkend = "sect.logcheck" />).

source: The <command>snort</command> configuration file (<filename>/etc/snort/snort.conf</filename>) is very long, and the abundant comments describe each directive with much detail. Getting the most out of it requires reading it in full and adapting it to the local situation. For instance, indicating which machine hosts which service can limit the number of incidents <command>snort</command> will report, since a denial of service attack on a desktop machine is far from being as critical as one on a DNS server. Another interesting directive allows storing the mappings between IP addresses and MAC addresses (these uniquely identify a network card), so as to allow detecting <emphasis>ARP spoofing</emphasis> attacks by which a compromised machine attempts to masquerade as another such as a sensitive server.
pt_br: O arquivo de configuração <command>snort</command>(<filename>/etc/snort/snort.conf</filename>) é muito longo, e os comentários abundantes descrever cada directiva com muito detalhe. Obtendo o máximo do que exige lendo o na íntegra e adaptando-o à situação local. Por exemplo, indicando quais máquinas e quais serviços pode limitar o número de incidentes o <command>snort</command> irá relatar, já que um ataque de negação de serviço em uma máquina desktop está longe de ser tão crítica como em um servidor DNS. Outra diretriz interessante permite armazenar os mapeamentos entre endereços IP e endereços MAC (estes identificam uma placa de rede), de modo a permitir a detecção de ataques <emphasis>ARP spoofing</emphasis> por que uma ou outra tentativas de máquinas comprometidas mascaram outra, como um servidor sensível.

source: <emphasis>CAUTION</emphasis> Range of action
pt_br: <emphasis>ATENCAO</emphasis> Raio de ação

source: The effectiveness of <command>snort</command> is limited by the traffic seen on the monitored network interface. It will obviously not be able to detect anything if it cannot observe the real traffic. When plugged into a network switch, it will therefore only monitor attacks targeting the machine it runs on, which is probably not the intention. The machine hosting <command>snort</command> should therefore be plugged into the “mirror” port of the switch, which is usually dedicated to chaining switches and therefore gets all the traffic.
pt_br: A eficácia do <command>snort</command> é limitada pelo tráfego visto na interface de rede monitorada. Obviamente, não será capaz de detectar qualquer coisa se não pode observar o tráfego real. Quando conectado a um switch de rede, ele irá, portanto, apenas monitorar ataques contra a máquina que ele roda, provavelmente não é a intenção. A máquina de hospedagem <command>snort</command> deve estar ligada ao "espelho" da porta do switch, que normalmente é dedicada aos interruptores de encadeamento e, portanto, recebe todo o tráfego.

source: On a small network based around a network hub, there is no such problem, since all machines get all the traffic.
pt_br: Em uma pequena rede em torno de um hub de rede, não existe esse problema, uma vez que todas máquinas obtem todo o tráfego.

source: Introduction to SELinux
pt_br: Introducao ao SELinux

source: Principles
pt_br: Principios

source: SELinux (<emphasis>Security Enhanced Linux</emphasis>) is a <emphasis>Mandatory Access Control</emphasis> system built on Linux's LSM (<emphasis>Linux Security Modules</emphasis>) interface. In practice, the kernel queries SELinux before each system call to know whether the process is authorized to do the given operation.
pt_br: SELinux (<emphasis>Security Enhanced Linux</emphasis>) é um sistema de <emphasis>controle de acesso obrigatório</emphasis> construído sobre a interface LSM (<emphasis>Linux Security Modules</emphasis>) do Linux. Na prática, o kernel consulta o SELinux antes de cada chamada do sistema para saber se o processo está autorizado a fazer a operação dada.

source: SELinux uses a set of rules — collectively known as a <emphasis>policy</emphasis> — to authorize or forbid operations. Those rules are difficult to create. Fortunately, two standard policies (<emphasis>targeted</emphasis> and <emphasis>strict</emphasis>) are provided to avoid the bulk of the configuration work.
pt_br: SELinux utiliza um conjunto de regras - conhecidos coletivamente como uma <emphasis>política</emphasis> - para autorizar ou proibir as operações. Essas regras são difíceis de criar. Felizmente, duas diretivas padroes (<emphasis>targeted</emphasis> e <emphasis>strict</emphasis>) são fornecidas para evitar a maior parte do trabalho de configuração.

source: With SELinux, the management of rights is completely different from traditional Unix systems. The rights of a process depend on its <emphasis>security context</emphasis>. The context is defined by the <emphasis>identity</emphasis> of the user who started the process, the <emphasis>role</emphasis> and the <emphasis>domain</emphasis> that the user carried at that time. The rights really depend on the domain, but the transitions between domains are controlled by the roles. Finally, the possible transitions between roles depend on the identity.
pt_br: Com o SELinux, a gestão dos direitos é completamente diferente do sistema Unix tradicional. Os direitos de um processo depende de seu <emphasis>contexto de segurança</emphasis>. O contexto é definido pela <emphasis>identidade</emphasis> do usuário que iniciou o processo, o <emphasis>papel</emphasis> e o <emphasis>domínio</emphasis> que o usuário realizada naquele momento. Os direitos realmente dependem do domínio, mas transições entre os domínios são controladas pelos papéis. Finalmente, as transições possíveis entre os papéis dependem da identidade.

source: Security contexts and Unix users
pt_br: Contextos de segurança e usuários Unix

source: In practice, during login, the user gets assigned a default security context (depending on the roles that they should be able to endorse). This defines the current domain, and thus the domain that all new child processes will carry. If you want to change the current role and its associated domain, you must call <command>newrole -r <replaceable>role_r</replaceable> -t <replaceable>domain_t</replaceable></command> (there's usually only a single domain allowed for a given role, the <literal>-t</literal> parameter can thus often be left out). This command authenticates you by asking you to type your password. This feature forbids programs to automatically switch roles. Such changes can only happen if they are explicitly allowed in the SELinux policy.
pt_br: Na prática, durante o login, ao usuário é atribuído um contexto de segurança padrão (dependendo das funções que eles devem ser capazes de endossar). Isto define o domínio corrente e, assim, o domínio que todos os novos processos filho irao transportar. Se você quiser alterar o papel atual e seu domínio associado, você deve chamar <command>newrole-r <replaceable> role_r </replaceable>-t <replaceable>domain_t</replaceable></command> (normalmente há apenas um único domínio permitido para uma determinada função, o parâmetro <literal>-t</literal> pode, assim, muitas vezes, ser deixado de fora). Este comando autentica você pedindo que você digite sua senha. Este recurso proíbe programas mudarem automaticamente os papéis. Tais mudanças só podem acontecer se forem expressamente permitidas pela política SELinux.
