Repository: binary-com/mobile
Catalog: */14_security.po
Languages: pt_br

source: Obviously the rights do not apply to all <emphasis>objects</emphasis> (files, directories, sockets, devices, etc.). They can vary from object to object. To achieve this, each object is associated to a <emphasis>type</emphasis> (this is known as labeling). Domains' rights are thus expressed with sets of (dis)allowed operations on those types (and, indirectly, on all objects which are labeled with the given type).
pt_br: Obviamente, os direitos não se aplicam a todos os <emphasis>objetos</emphasis> (arquivos, diretórios, soquetes, dispositivos, etc.). Eles podem variar de objeto para objeto. Para conseguir isso, cada objeto é associado a um <emphasis>tipo</emphasis> (isto é conhecido como etiquetagem). Direitos de domínio são, portanto, expressos com conjuntos de operações (não) permitidos sobre os tipos (e, indiretamente, em todos os objetos que são etiquetados com o tipo de dado).

source: <emphasis>EXTRA</emphasis> Domains and types are equivalent
pt_br: <emphasis>EXTRA</emphasis> Domínios e Tipos são equivalentes

source: Internally, a domain is just a type, but a type that only applies to processes. That's why domains are suffixed with <literal>_t</literal> just like objects' types.
pt_br: Internamente um domínio é apenas um tipo, mas um tipo que só se aplica a processos. É por isso que os domínios tem sufixo <literal>_t</literal> igual aos tipos de objeto.

source: By default, a program inherits its domain from the user who started it, but the standard SELinux policies expect many important programs to run in dedicated domains. To achieve this, those executables are labeled with a dedicated type (for example <command>ssh</command> is labeled with <literal>ssh_exec_t</literal>, and when the program starts, it automatically switches to the <literal>ssh_t</literal> domain). This automatic domain transition mechanism makes it possible to grant only the rights required by each program. It is a fundamental principle of SELinux.
pt_br: Por padrão, um programa herda seu domínio do usuário que o iniciou, mas políticas SELinux padrões esperam que muitos programas importantes sejam executados em domínios dedicados. Para conseguir isso, estes executáveis são marcados com um tipo específico (por exemplo <command>ssh</command>) é marcado com <literal>ssh_exec_t</literal>, e quando o programa é iniciado, ele muda automaticamente no domínio <literal>ssh_t</literal>). Este mecanismo de transição automática de domínio torna possível conceder apenas os direitos necessários para cada programa. É um princípio fundamental do SELinux.

source: Automatic transitions between domains
pt_br: Transicoes automaticas entre dominios

source: <emphasis>IN PRACTICE</emphasis> Finding the security context
pt_br: <emphasis>NA PRATICA</emphasis> Encontrar o contexto de segunranca

source: <primary>security context</primary>
pt_br: <primary>contexto de seguranca</primary>

source: <primary>context, security context</primary>
pt_br: <primary>contexto, contexto de seguranca</primary>

source: To find the security context of a given process, you should use the <literal>Z</literal> option of <command>ps</command>.
pt_br: Para encontrar o contexto de segurança de um determinado processo, você deve usar a opção <literal>Z</literal> do <command>ps</command>.

source: The first field contains the identity, the role, the domain and the MCS level, separated by colons. The MCS level (<emphasis>Multi-Category Security</emphasis>) is a parameter that intervenes in the setup of a confidentiality protection policy, which regulates the access to files based on their sensitivity. This feature will not be explained in this book.
pt_br: O primeiro campo contém a identidade, o papel, o domínio e o nível MCS, separados por vírgulas. O nível de MCS (<emphasis>Multi-Category Security</emphasis>) é um parâmetro que intervém na configuração de uma política de protecção da confidencialidade, que regula o acesso a arquivos com base em sua sensibilidade. Esta funcionalidade não será explicada neste livro.

source: To find the current security context in a shell, you should call <command>id -Z</command>.
pt_br: Para encontrar o contexto de segurança atual em um shell, você deve chamar <command>id-Z</command>.

source: Finally, to find the type assigned to a file, you can use <command>ls -Z</command>.
pt_br: Finalmente, para encontrar o tipo atribuído a um arquivo, você pode usar o <command>ls -Z</command>.

source: It is worth noting that the identity and role assigned to a file bear no special importance (they are never used), but for the sake of uniformity, all objects get assigned a complete security context.
pt_br: É interessante notar que a identidade e o papel atribuído a um arquivo não têm qualquer importância especial (eles nunca são usados), mas por uma questão de uniformidade, todos os objetos são atribuídos num contexto de segurança completo.

source: Setting Up SELinux
pt_br: Configurando o SELinux

source: SELinux support is built into the standard kernels provided by Debian. The core Unix tools support SELinux without any modifications. It is thus relatively easy to enable SELinux.
pt_br: O suporte SELinux é construído nos kernels padroes fornecidos pelo Debian. As principais ferramentas de suporte Unix SELinux sem quaisquer modificações. É, assim, relativamente fácil, habilitar SELinux.

source: The <command>aptitude install selinux-basics selinux-policy-default</command> command will automatically install the packages required to configure an SELinux system.
pt_br: O comando <command>aptitude install selinux-basics selinux-policy-default</command> irá instalar automaticamente os pacotes necessários para configurar um sistema SELinux.

source: The <emphasis role="pkg">selinux-policy-default</emphasis> package contains a set of standard rules. By default, this policy only restricts access for a few widely exposed services. The user sessions are not restricted and it is thus unlikely that SELinux would block legitimate user operations. However, this does enhance the security of system services running on the machine. To setup a policy equivalent to the old “strict” rules, you just have to disable the <literal>unconfined</literal> module (modules management is detailed further in this section).
pt_br: O pacote <emphasis role="pkg">selinux-policy-default</emphasis> contém um conjunto de regras padrão. Por padrão, essa política só restringe o acesso a alguns serviços amplamente expostos. As sessões de usuários não estão restritas e, portanto, é improvável que o SELinux iria bloquear as operações legítimas do usuário. No entanto, isso faz aumentar a segurança dos serviços do sistema rodando na máquina. Para configurar uma política corresponde à antigo regra "strict", você só tem que desativar o módulo <literal>unconfined</literal> (gerenciamento de módulos está detalhada ainda nesta seção).

source: Once the policy has been installed, you should label all the available files (which means assigning them a type). This operation must be manually started with <command>fixfiles relabel</command>.
pt_br: Uma vez que a política tenha sido instalada, você deve marcar todos os arquivos disponíveis (o que significa atribuir-lhes um tipo). Esta operação deve ser iniciada manualmente com <command>fixfiles relabel</command>.

source: The SELinux system is now ready. To enable it, you should add the <literal>selinux=1</literal> parameter to the Linux kernel. The <literal>audit=1</literal> parameter enables SELinux logging which records all the denied operations. Finally, the <literal>enforcing=1</literal> parameter brings the rules into application: without it SELinux works in its default <emphasis>permissive</emphasis> mode where denied actions are logged but still executed. You should thus modify the GRUB bootloader configuration file to append the desired parameters. One easy way to do this is to modify the <literal>GRUB_CMDLINE_LINUX</literal> variable in <filename>/etc/default/grub</filename> and to run <command>update-grub</command>. SELinux will be active after a reboot.
pt_br: O sistema SELinux agora está pronto. Para habilitá-lo, você deve adicionar o parâmetro <literal>selinux=1</literal> para o kernel de Linux. O parâmetro <literal>selinux=1</literal> habilita o log SELinux que registra todas operações negadas. Finalmente, o parâmetro <literal>enforcing=1</literal> traz as regras para aplicação: sem ele SELinux funciona no modo padrão <emphasis>permissive</emphasis> onde as ações negadas são registradas, mas ainda executadA. Você deve, portanto, modificar o arquivo de configuração do GRUB para anexar os parâmetros desejados. Uma maneira fácil de fazer isso é modificar A variável <literal>GRUB_CMDLINE_LINUX</literal> em <filename>/etc/default/grub</filename> e executar <command>update-grub</command>. SELinux estará ativo após uma reinicialização.

source: It is worth noting that the <command>selinux-activate</command> script automates those operations and forces a labeling on next boot (which avoids new non-labeled files created while SELinux was not yet active and while the labeling was going on).
pt_br: É interessante notar que o script <command>selinux-activate</command> automatiza as operações e força uma rotulagem na próxima inicialização (o que evita criacao de novos arquivos não-rotulados enquanto o SELinux ainda não estiver ativo, e enquanto a rotulagem estiver acontecendo).

source: Managing an SELinux System
pt_br: Gerenciando um Sistema SELinux

source: The SELinux policy is a modular set of rules, and its installation detects and enables automatically all the relevant modules based on the already installed services. The system is thus immediately operational. However, when a service is installed after the SELinux policy, you must be able to manually enable the corresponding module. That is the purpose of the <command>semodule</command> command. Furthermore, you must be able to define the roles that each user can endorse, and this can be done with the <command>semanage</command> command.
pt_br: A política do SELinux é um conjunto modular de regras, e sua instalação detecta e permite automaticamente todos os módulos relevantes com base nos serviços já instalados. O sistema é assim imediatamente operacional. No entanto, quando um serviço é instalado após a política do SELinux, você deve ser capaz de habilitar manualmente o módulo correspondente. Esse é o propósito do comando <command>semodule</command>. Além disso, você deve ser capaz de definir as funções que cada usuário pode endossar, e isso pode ser feito com o comando <command>semanage</command>.

source: Those two commands can thus be used to modify the current SELinux configuration, which is stored in <filename>/etc/selinux/default/</filename>. Unlike other configuration files that you can find in <filename>/etc/</filename>, all those files must not be changed by hand. You should use the programs designed for this purpose.
pt_br: Estes dois comandos podem assim ser usados para modificar a atual configuração do SELinux, que é armazenada em <filename>/etc/selinux/default/</filename>. Ao contrário de outros arquivos de configuração que você pode encontrar em <filename>/etc/</filename>, todos esses arquivos não devem ser alterados manualmente. Você deve usar os programas concebidos para este proposito.

source: <emphasis>GOING FURTHER</emphasis> More documentation
pt_br: <emphasis>INDO ALEM</emphasis> Mais documentacao

source: Since the NSA doesn't provide any official documentation, the community set up a wiki to compensate. It brings together a lot of information, but you must be aware that most SELinux contributors are Fedora users (where SELinux is enabled by default). The documentation thus tends to deal specifically with that distribution. <ulink type="block" url="http://www.selinuxproject.org" />
pt_br: Uma vez que a NSA não fornece qualquer documentação oficial, a comunidade criou um wiki para compensar. Reúne uma série de informações, mas você deve estar ciente que os maiores contribuintes SELinux são usuários do Fedora (onde o SELinux está habilitado por padrão). A documentação, portanto, tende a tratar especificamente com essa distribuição. <ulink type="block" url="http://www.selinuxproject.org" />

source: You should also have a look at the dedicated Debian wiki page as well as Russel Coker's blog, who is one of the most active Debian developers working on SELinux support. <ulink type="block" url="http://wiki.debian.org/SELinux" /> <ulink type="block" url="http://etbe.coker.com.au/tag/selinux/" />
pt_br: Você também deve ter olhado para a página wiki dedicada ao Debian, bem como blog de Russel Coker, que é um dos desenvolvedores mais ativos do Debian trabalhando no suporte SELinux. <ulink type="block" url="http://wiki.debian.org/SELinux" /> <ulink type="block" url="http://etbe.coker.com.au/tag/selinux/ "/>

source: Managing SELinux Modules
pt_br: Gerenciando Modulos SELinux

source: Available SELinux modules are stored in the <filename>/usr/share/selinux/default/</filename> directory. To enable one of these modules in the current configuration, you should use <command>semodule -i <replaceable>module.pp</replaceable></command>. The <emphasis>pp</emphasis> extension stands for <emphasis>policy package</emphasis>.
pt_br: Módulos SELinux disponíveis são armazenados no diretorio <filename>/usr/share/selinux/default/</filename>. Para habilitar um desses módulos na configuração atual, você deve usar <command>semodule-i <replaceable>module.pp</replaceable></command>. A extensão <emphasis>pp</emphasis> representa <emphasis>pacote política</emphasis>.

source: Removing a module from the current configuration is done with <command>semodule -r <replaceable>module</replaceable></command>. Finally, the <command>semodule -l</command> command lists the modules which are currently enabled. It also outputs their version numbers.
pt_br: A removecao de um módulo a partir da configuração atual é feita com <command>semodule -r <replaceable>module</replaceable></command>. Finalmente, o comando <command>semodule -l</command> listas os modulos que estao atualmente habilitados. Também mostra seus números de versão.

source: <command>semodule</command> immediately loads the new configuration unless you use its <literal>-n</literal> option. It is worth noting that the program acts by default on the current configuration (which is indicated by the <literal>SELINUXTYPE</literal> variable in <filename>/etc/selinux/config</filename>), but that you can modify another one by specifying it with the <literal>-s</literal> option.
pt_br: <command>semodule</command> imediatamente carrega a nova configuração, a menos que você use sua opção <literal>-n </literal>. É interessante notar que o programa atua por padrão na configuração atual (que é indicada pela variavel <literal>SELINUXTYPE</literal> em <filename>/etc/selinux/config</filename>), mas que você pode modificar outra, especificando-a com a opcao <literal>opção-s</literal>.

source: Managing Identities
pt_br: Gerenciando Identidades

source: Every time that a user logs in, they get assigned an SELinux identity. This identity defines the roles that they will be able to endorse. Those two mappings (from the user to the identity and from this identity to roles) are configurable with the <command>semanage</command> command.
pt_br: Toda vez que um usuário faz logon, eles se atribui uma identidade SELinux. Esta identidade define os papéis que eles serão capazes de endossar. Estes dois mapeamentos (do usuário para a identidade e de esta identidade para papéis) são configuráveis com o comando <command>semanage</command>.

source: You should definitely read the <citerefentry><refentrytitle>semanage</refentrytitle><manvolnum>8</manvolnum></citerefentry> manual page, even if the command's syntax tends to be similar for all the concepts which are managed. You will find common options to all sub-commands: <literal>-a</literal> to add, <literal>-d</literal> to delete, <literal>-m</literal> to modify, <literal>-l</literal> to list, and <literal>-t</literal> to indicate a type (or domain).
pt_br: Você deve definitivamente ler a página de manual <citerefentry><refentrytitle>semanage</refentrytitle><manvolnum>8</manvolnum></citerefentry>, mesmo se a sintaxe do comando tende a ser semelhante para todos os conceitos que são geridos. Você vai encontrar opções comuns a todos os sub-comandos: <literal>-a</literal> para adicionar, <literal>-d</literal> para excluir, <literal>-m</literal> para modificar, <literal>-l</literal> para listar, e <literal>-t</literal> para indicar um tipo (ou domínio).

source: <command>semanage login -l</command> lists the current mapping between user identifiers and SELinux identities. Users that have no explicit entry get the identity indicated in the <literal>__default__</literal> entry. The <command>semanage login -a -s user_u <replaceable>user</replaceable></command> command will associate the <emphasis>user_u</emphasis> identity to the given user. Finally, <command>semanage login -d <replaceable>user</replaceable></command> drops the mapping entry assigned to this user.
pt_br: <command>semanage login -l</command> lista o atual mapeamento entre identificadores de usuário e identidades SELinux. Os usuários que não têm entrada explícita obter a identidade indicado na entrada <literal>__default__</literal>. O comando <command>semanage login -a -s user_u <replaceable>user</replaceable></command> irá associar a identidade <emphasis>user_u</emphasis> ao determinado usuário. Finalmente,<command>semanage login -d <replaceable>user</replaceable></command> exclui a entrada de mapeamento atribuído a este usuário.

source: <command>semanage user -l</command> lists the mapping between SELinux user identities and allowed roles. Adding a new identity requires to define both the corresponding roles and a labeling prefix which is used to assign a type to personal files (<filename>/home/<replaceable>user</replaceable>/*</filename>). The prefix must be picked among <literal>user</literal>, <literal>staff</literal>, and <literal>sysadm</literal>. The “<literal>staff</literal>” prefix results in files of type “<literal>staff_home_dir_t</literal>”. Creating a new SELinux user identity is done with <command>semanage user -a -R <replaceable>roles</replaceable> -P <replaceable>prefix</replaceable> <replaceable>identity</replaceable></command>. Finally, you can remove an SELinux user identity with <command>semanage user -d <replaceable>identity</replaceable></command>.
pt_br: <command>semanage user -l</command> lista o mapeamento entre as identidades de usuários do SELinux e papéis permitidos. Adicionar uma nova identidade requer definir os papéis correspondentes e um prefixo de marcação que é usado para designar um tipo de arquivo pessoal (<filename>/home/<replaceable>usuário</replaceable>/*</filename>). O prefixo deve ser escolhido entre <literal>user</literal>, o <literal>staff</literal>, e o <literal>sysadm</literal>. O prefixo "<literal>staff</literal>" resulta em arquivos do tipo "<literal>staff_home_dir_t</literal>". Criar uma nova identidade de usuário SELinux é feita com <command>semanage usuário -a -R <replaceable>papéis</replaceable> -P <replaceable>prefixo</replaceable> <replaceable>identidade</replaceable></command>. Finalmente, você pode remover uma identidade de usuário SELinux com <command>semanage usuário -d <replaceable>identidade</replaceable></command>.

source: Managing File Contexts, Ports and Booleans
pt_br: Gerenciamento de arquivos Contextos, Portas e booleanos

source: Each SELinux module provides a set of file labeling rules, but it is also possible to add custom labeling rules to cater to a specific case. For example, if you want the web server to be able to read files within the <filename>/srv/www/</filename> file hierarchy, you could execute <command>semanage fcontext -a -t httpd_sys_content_t "/srv/www(/.*)?"</command> followed by <command>restorecon -R /srv/www/</command>. The former command registers the new labeling rules and the latter resets the file types according to the current labeling rules.
pt_br: Cada módulo SELinux fornece um conjunto de regras de rotulagem de arquivos, mas também é possível adicionar regras de rotulagem personalizadas para atender a um caso específico. Por exemplo, se você deseja que o servidor web para seja capaz de ler arquivos dentro da hierarquia de arquivos <filename>/srv/www/</filename>, você pode executar semanage <command> fcontext-a-t httpd_sys_content_t "/srv/www(/.*)? "</command> seguido de <command> restorecon -R /srv/www/</command>. O comando anterior registra as novas regras de rotulagem e redefine o último dos tipos de arquivos de acordo com as atuais regras de rotulagem.

source: Similarly, TCP/UDP ports are labeled in a way that ensures that only the corresponding daemons can listen to them. For instance, if you want that the web server be able to listen on port 8080, you should run <command>semanage port -m -t http_port_t -p tcp 8080</command>.
pt_br: Da mesma forma, portas TCP/UDP são rotuladas de uma forma que garante que apenas os daemons correspondentes podem ouvi los. Por exemplo, se você quiser que o servidor web seja capaz de escutar na porta 8080, você deve executar <command>semanage porta -m -t http_port_t-p tcp 8080</command>.

source: Some SELinux modules export boolean options that you can tweak to alter the behavior of the default rules. The <command>getsebool</command> utility can be used to inspect those options (<command>getsebool <replaceable>boolean</replaceable></command> displays one option, and <command>getsebool -a</command> them all). The <command>setsebool <replaceable>boolean</replaceable> <replaceable>value</replaceable></command> command changes the current value of a boolean option. The <literal>-P</literal> option makes the change permanent, it means that the new value becomes the default and will be kept across reboots. The example below grants web servers an access to home directories (this is useful when users have personal websites in <filename>~/public_html/</filename>).
pt_br: Alguns módulos do SELinux exportar opções booleanas que você pode alterar para alterar o comportamento das regras padrão. O utilitário <command>getsebool</command> pode ser usado para inspecionar as opções (<command>getsebool<replaceable>boolean</replaceable></command> exibe uma opção, e <command>getsebool -a</command> todas elas). O comando <command>setsebool <replaceable>boolean</replaceable> <replaceable>value</replaceable></command> muda o valor atual de uma opção booleana. A opcao <literal>-P</literal> faz a mudança permanente, isso significa que o novo valor passa a ser o padrão e será mantido entre as reinicializações. O exemplo abaixo servidores web concede acesso para diretórios home (isto é útil quando os usuários têm sites pessoais em <filename>~/public_html/</filename>).

source: Adapting the Rules
pt_br: Adaptando as Regras

source: Since the SELinux policy is modular, it might be interesting to develop new modules for (possibly custom) applications that lack them. These new modules will then complete the <emphasis>reference policy</emphasis>.
pt_br: Uma vez que a política do SELinux é modular, pode ser interessante para desenvolver novos módulos para (possivelmente personalizar) aplicações que não os possuem. Estes novos módulos, então, completarao a <emphasis>política de referência</emphasis>.
