Repository: binary-com/mobile
Catalog: */70_conclusion.po
Languages: pt_br

source: Future
pt_br: Futuro

source: Improvements
pt_br: Melhorias

source: Opinions
pt_br: Opiniões

source: Conclusion: Debian's Future
pt_br: Conclusão: O Futuro do Debian

source: The story of Falcot Corp ends with this last chapter; but Debian lives on, and the future will certainly bring many interesting surprises.
pt_br: A história da Falcot Corp termina com este último capítulo; mas o Debian continua, e o futuro certamente trará muitas surpresas interessantes.

source: Upcoming Developments
pt_br: Desenvolvimentos futuros

source: Weeks (or months) before a new version of Debian is released, the Release Manager picks the codename for the next version. Now that Debian version 7 is out, the developers are already busy working on the next version, codenamed <emphasis role="distribution">Jessie</emphasis>…
pt_br: Semanas (ou meses) antes de uma nova versão do Debian ser lançada, o Gerente de Lançamentos escolhe um codinome para a próxima versão. Agora que o Debian versão 6.07 saiu, os desenvolvedores já estão ocupados trabalhando na próxima versão, codinome <emphasis role="distribution">Jessie</emphasis>…

source: There's no official list of planned changes, and Debian never makes promises relating to technical goals of the coming versions. However, a few development trends can already be noted, and we can try some bets on what might happen (or not).
pt_br: Não existe nenhuma lista de mudanças planejadas, e o Debian nunca faz promessas com relação a objetivos técnicos das próximas versões. Entretanto, após algumas tendências de desenvolvimentos já podem ser notadas, e nós podemos tentar algumas apostas sobre o que pode acontecer (ou não).

source: The default “init” process (<command>sysvinit</command>) will hopefully be replaced by a more modern system such as <command>upstart</command> or <command>systemd</command>. Some ports will be gone: <literal>s390</literal> has been superseded by <literal>s390x</literal>, <literal>sparc</literal> and <literal>ia64</literal> might follow as they suffer from multiple problems (lack of recent hardware, lack of Debian porters, lack of upstream support, etc.). <command>dpkg</command> will gain a <command>--verify</command> command that renders <command>debsums</command> mostly obsolete.
pt_br: O processo “init” padrão (<command>sysvinit</command>) que espero seja substituído por um sistema mais moderno, como <command>upstart</command> ou <command>systemd</command>. Algumas portas desaparerão: <literal>s390</literal> foi substituído pelo <literal>s390x</literal>, <literal>sparc</literal> e <literal>ia64</literal> pode seguir como eles sofrem de vários problemas (falta de hardware recente, falta de empregados do Debian, falta de apoio a montante, etc.) <command>dpkg</command> ganhará um comando <command>--verify</command> que torna <command>debsums</command> em sua maioria obsoleta.

source: Of course, all the main software suites will have had a major release. Apache 2.4 (or newer) will have a strong impact on deployed websites as many configuration files will have to be updated. The Linux kernel is likely to have a much improved container support (with user namespaces, paving the path towards more secure containers). And the latest version of the various desktops will bring better usability and new features. GNOME 3 will be much more polished and the fans of the good old GNOME 2 will be pleased with the inclusion of <ulink url="http://mate-desktop.org/">MATE</ulink> in Debian.
pt_br: Claro, todos os principais pacotes de software terão tido um grande lançamento. Apache 2.4 (ou mais recente) terão um forte impacto em sites implantados como muitos arquivos de configuração e terão de ser atualizados. O kernel do Linux provavelmente terá um suporte muito melhorado do recipiente (com espaços para nomes de usuários, abrindo o caminho para recipientes mais seguros). E a versão mais recente dos vários desktops trarão uma melhor usabilidade e novos recursos. GNOME 3 será muito mais polido e os fãs do bom velho GNOME 2 estarão satisfeitos com a inclusão do <ulink url="http://mate-desktop.org/">MATE</ulink> no Debian.

source: Debian's Future
pt_br: Futuro do Debian

source: In addition to these internal developments, one can reasonably expect new Debian-based distributions to come to light, as many tools keep making this task easier. New specialized subprojects will also be started, in order to widen Debian's reach to new horizons.
pt_br: Além destes desenvolvimentos internos, é esperado que novas distribuições baseadas no Debian apareçam, como muitas ferramentas continuam a fazer esta tarefa mais fácil. Novos subprojetos especializados também serão iniciados, a fim de ampliar o alcance do Debian para novos horizontes.

source: The Debian user community will increase, and new contributors will join the project… including, maybe, you!
pt_br: A comunidade Debian crescerá, e novos contribuidores se juntarão ao projeto... incluindo, talvez, você!

source: The Debian project is stronger than ever, and well on its way towards its goal of a universal distribution; the inside joke within the Debian community is about <foreignphrase>World Domination</foreignphrase>.
pt_br: O projeto Debian é mais forte do que nunca, e bem encaminhado em seu objetivo de se tornar uma distribuição universal; a piada interna dentro da comunidade Debian é sobre <foreignphrase>Dominar o mundo</foreignphrase>.

source: In spite of its old age and its respectable size, Debian keeps on growing in all kinds of (sometimes unexpected) directions. Contributors are teeming with ideas, and discussions on development mailing lists, even when they look like bickerings, keep increasing the momentum. Debian is sometimes compared to a black hole, of such density that any new free software project is attracted.
pt_br: Apesar da sua idade avançada e seu tamanho respeitável, o Debian continua crescendo em todas (algumas vezes inesperadas) as direções. Contribuidores estão repletos de ideias, e discussões na listas de e-mails de desenvolvimentos, mesmo quando elas parecem insignificantes, continuam aumentando o impulso. O Debian às vezes é comparado a um buraco negro, de tamanha densidade que qualquer programa livre é atraído.

source: Beyond the apparent satisfaction of most Debian users, a deep trend is becoming more and more indisputable: people are increasingly realising that collaborating, rather than working alone in their corner, leads to better results for everyone. Such is the rationale used by distributions merging into Debian by way of subprojects.
pt_br: Além da aparente satisfação da maioria dos usuários do Debian, uma profunda tendência está se tornando mais e mais incontestável: as pessoas estão cada vez mais percebendo que colaborar, em vez de trabalhar sozinho em seu canto, leva a melhores resultados. Tal é o raciocínio usado por distribuições que estão fundindo-se com o Debian por meio de subprojetos.

source: The Debian project is therefore not threatened by extinction…
pt_br: O projeto Debian é, portanto, não é ameaçado pela extinção...

source: Future of this Book
pt_br: O Futuro deste Livro

source: We would like this book to evolve in the spirit of free software. We therefore welcome contributions, remarks, suggestions, and criticism. Please direct them to Raphaël (<email>hertzog@debian.org</email>) or Roland (<email>lolando@debian.org</email>). For actionable feedback, feel free to open bug reports against the <literal>debian-handbook</literal> Debian package. The website will be used to gather all information relevant to its evolution, and you will find there information on how to contribute, in particular if you want to translate this book to make it available to an even larger public than today. <ulink type="block" url="http://debian-handbook.info/" />
pt_br: Nós gostaríamos que este livro evolua no espírito dos programas livres. Nós portanto damos boas-vindas a contribuições, sugestões, e críticas. Por favor direcionem-nas a Raphaël (<email>hertzog@debian.org</email>) ou Roland (<email>lolando@debian.org</email>). Para informações práticas, sinta-se à vontade em abrir relatórios de bug contra o pacote Debian <literal>debian-handbook</literal>. O site será utilizado para recolher todas informações relevantes para sua evolução, e você vai descobrir que há informações sobre como contribuir, em particular, se você quiser traduzir este livro para torná-lo disponível para um público ainda maior do que hoje. <ulink type="block" url="http://debian-handbook.info/" />

source: We tried to integrate most of what our experience at Debian taught us, so that anyone can use this distribution and take the best advantage of it as soon as possible. We hope this book contributes to making Debian less confusing and more popular, and we welcome publicity around it!
pt_br: Nós tentamos integrar o máximo do que a nossa experiência com o Debian nos ensinou, de maneira que qualquer um possa usa essa distribuição e tirar o melhor proveito o mais rápido possível, Nós esperamos que este livro contribua para fazer o Debian menos confuso e popular, e nós agradecemos a publicidade ao seu redor!

source: We'd like to conclude on a personal note. Writing (and translating) this book took a considerable amount of time out of our usual professional activity. Since we're both freelance consultants, any new source of income grants us the freedom to spend more time improving Debian; we hope this book to be successful and to contribute to this. In the meantime, feel free to retain our services! <ulink type="block" url="http://www.freexian.com" /> <ulink type="block" url="http://www.gnurandal.com" />
pt_br: Nós gostaríamos de concluir com uma nota pessoal. Escrever (e traduzir) este livro tomou um tempo considerável das nossas atividades profissionais corriqueiras. Ambos já somos consultores autônomos, e qualquer nova fonte de renda nos garante a liberdade de passar mais tempo melhorando o Debian; nós esperamos que este livro seja um sucesso e contribua para isso. Entretanto, sinta-se a vontade para contratar nossos serviços! <ulink type="block" url="http://www.freexian.com" /> <ulink type="block" url="http://www.gnurandal.com" />

source: See you soon!
pt_br: Vejo vocês em breve!
