Repository: binary-com/mobile
Catalog: */92_short-remedial-course.po
Languages: pt_br

source: In the case where one does not wish to store data on disk, one can use a <emphasis>pipe</emphasis>, which is simply an object with two ends; bytes written in one end are readable at the other. If the ends are controlled by separate processes, this leads to a simple and convenient inter-process communication channel. Pipes can be classified into two categories: named pipes, and anonymous pipes. A named pipe is represented by an entry on the filesystem (although the transmitted data is not stored there), so both processes can open it independently if the location of the named pipe is known beforehand. In cases where the communicating processes are related (for instance, a parent and its child process), the parent process can also create an anonymous pipe before forking, and the child inherits it. Both processes will then be able to exchange data through the pipe without needing the filesystem.
pt_br: No caso de que não desejamos armazenar dados em disco, pode-se usar um <emphasis>pipe</emphasis> (conexão), que é simplesmente um objeto com duas extremidades; bytes escritos em uma extremidade são legíveis no outro. Se as extremidades são controladas por processos separados, este se converte em um canal de comunicação entre processos simples e conveniente. Pipes podem ser classificados em duas categorias: pipes nomeados e pipes anônimos. Um pipe nomeado é representado por uma entrada no sistema de arquivos (embora os dados transmitidos não são armazenados lá), para que ambos os processos posam abri-lo de forma independente se a localização do pipe nomeado é conhecido antecipadamente. Nos casos em que os processos de comunicação estão relacionados (por exemplo, um pai e seu processo filho), o processo pai também pode criar um pipe anônimo antes da bifurcação, e o filho o herda. Assim, ambos os processos serão capazes de trocar dados através do pipe sem a necessidade do sistema de arquivos.

source: <emphasis>IN PRACTICE</emphasis> A concrete example
pt_br: <emphasis>NA PRÁTICA</emphasis> Um exemplo concreto

source: Let's describe in some detail what happens when a complex command (a <emphasis>pipeline</emphasis>) is run from a shell. We assume we have a <command>bash</command> process (the standard user shell on Debian), with <emphasis>pid</emphasis> 4374; into this shell, we type the command: <command>ls | sort</command> .
pt_br: Vamos descrever em detalhes o que acontece quando um comando complexo (um <emphasis>pipeline</emphasis>) é executado a partir de um shell. Vamos assumir que temos um processo <command>bash</command> (o shell do usuário padrão no Debian), com <emphasis>pid</emphasis> 4374; neste shell podemos digitar o comando: <command>ls | sort</command>.

source: The shell first interprets the command typed in. In our case, it understands there are two programs (<command>ls</command> and <command>sort</command>), with a data stream flowing from one to the other (denoted by the <userinput>|</userinput> character, known as <emphasis>pipe</emphasis>). <command>bash</command> first creates an unnamed pipe (which initially exists only within the <command>bash</command> process itself).
pt_br: O shell interpreta pela primeira vez o comando digitado nele. No nosso caso, ele entende que existem dois programas (<command>ls</command> e <command>sort</command>), com um fluxo de dados que flui de um para o outro (denotada pelo caractere <userinput>|</userinput>, conhecido como <emphasis>pipe</emphasis>). O <command>bash</command> primeiro cria um pipe sem nome (que inicialmente só existe dentro do processo <command>bash</command> em si).

source: Then the shell clones itself; this leads to a new <command>bash</command> process, with <emphasis>pid</emphasis> #4521 (<emphasis>pids</emphasis> are abstract numbers, and generally have no particular meaning). Process #4521 inherits the pipe, which means it is able to write in its “input” side; <command>bash</command> redirects its standard output stream to this pipe's input. Then it executes (and replaces itself with) the <command>ls</command> program, which lists the contents of the current directory. Since <command>ls</command> writes on its standard output, and this output has previously been redirected, the results are effectively sent into the pipe.
pt_br: Então o shell se clona; isso leva a um novo processo <command>bash</command> com <emphasis>pid</emphasis> #4521 (<emphasis>pids</emphasis> são números abstratos e geralmente não têm significado particular). O processo #4521 herda o pipe, o que significa que é capaz de escrever em seu lado de "entrada"; o <command>bash</command> redireciona seu fluxo de saída padrão para a entrada deste pipe. Em seguida, ele executa (e substitui-se com) o <command>ls</command> do programa, que lista o conteúdo do diretório atual. Como o <command>ls</command> escreve em sua saída padrão, e anteriormente se direcionou esta saída, seus resultados são efetivamente enviados para o pipe.

source: A similar operation happens for the second command: <command>bash</command> clones itself again, leading to a new <command>bash</command> process with pid #4522. Since it is also a child process of #4374, it also inherits the pipe; <command>bash</command> then connects its standard input to the pipe output, then executes (and replaces itself with) the <command>sort</command> command, which sorts its input and displays the results.
pt_br: Uma operação similar acontece para o segundo comando: o<command>bash</command> se clona novamente, levando a um novo processo <command>bash</command> com pid #4522. Como também é um processo filho do #4374, também herda o pipe; em seguida o <command>bash</command> conecta sua entrada padrão para a saída do pipe, então executa (e se substitui com) o <command>sort</command>, que classifica sua entrada e exibe os resultados.

source: All the pieces of the puzzle are now set up: <command>ls</command> reads the current directory and writes the list of files into the pipe; <command>sort</command> reads this list, sorts it alphabetically, and displays the results. Processes numbers #4521 and #4522 then terminate, and #4374 (which was waiting for them during the operation), resumes control and displays the prompt to allow the user to type in a new command.
pt_br: Todas as peças do quebra-cabeça agora estão definidas: o <command>ls</command> lê o diretório atual e escreve a lista de arquivos dentro do pipe; o <command>sort</command> lê esta lista, classifica-a em ordem alfabética e exibe os resultados. Os processos números #4521 e #4522 encerram, e o #4374 (que estava esperando por eles durante a operação), retoma o controle e exibe o prompt permitindo que o usuário digite um novo comando.

source: Not all inter-process communications are used to move data around, though. In many situations, the only information that needs to be transmitted are control messages such as “pause execution” or “resume execution”. Unix (and Linux) provides a mechanism known as <emphasis>signals</emphasis>, through which a process can simply send a signal (chosen within a fixed list of a few tens of predefined signals) to another process. The only requirement is to know the <emphasis>pid</emphasis> of the target.
pt_br: No entanto, nem todas as comunicações entre processos são usados para mover os dados. Em muitas situações, a única informação que deve ser transmitida são mensagens de controle tais como "execução em pausa" ou "retomar execução". O Unix (e Linux) fornece um mecanismo conhecido como <emphasis>sinais</emphasis>, através do qual um processo pode simplesmente enviar um sinal (escolhido dentro de uma lista fixa de algumas dezenas de sinais pré-definidos) para outro processo. O único requisito é saber o <emphasis>pid</emphasis> do objetivo.

source: For more complex communications, there are also mechanisms allowing a process to open access, or share, part of its allocated memory to other processes. Memory shared between them can be used to move data across.
pt_br: Para comunicações mais complexas também existem mecanismos que permitem um processo acessar, ou compartilhar, parte da memória alocada para outros processos. Podem utilizar a memória compartilhada entre eles trocar dados.

source: Finally, network connections can also help processes communicate; these processes can even be running on different computers, possibly thousands of kilometers apart.
pt_br: Finalmente, as conexões de rede também pode ajudar a comunicação de processos; esses processos podem até ser executados em diferentes computadores, possivelmente a milhares de quilômetros de distância.

source: It is quite standard for a typical Unix-like system to make use of all these mechanisms to various degrees.
pt_br: É bastante normal para um típico sistema similar ao Unix fazer uso de todos esses mecanismos em vários graus.

source: Libraries
pt_br: Bibliotecas

source: <primary>library (of functions)</primary>
pt_br: <primary>biblioteca (de funções)</primary>

source: Function libraries play a crucial role in a Unix-like operating system. They are not proper programs, since they cannot be executed on their own, but collections of code fragments that can be used by standard programs. Among the common libraries, you can find:
pt_br: Bibliotecas de funções desempenham um papel crucial em um sistema operacional similar ao Unix. Eles não são programas propriamente dito, uma vez que não podem ser executados por si próprios, mas coleções de fragmentos de código que podem ser utilizados pelos programas normais. Entre as bibliotecas comuns, você pode encontrar:

source: the standard C library (<emphasis>glibc</emphasis>), which contains basic functions such as ones to open files or network connections, and others facilitating interactions with the kernel;
pt_br: a biblioteca padrão C (<emphasis>glibc</emphasis>), que contém as funções básicas como aqueles para abrir arquivos ou conexões de rede, e outras que facilitam as interações com o kernel;

source: graphical toolkits, such as Gtk+ and Qt, allowing many programs to reuse the graphical objects they provide;
pt_br: toolkits gráficos, como Gtk+ e o Qt, permitindo que muitos programas reutilizem os objetos gráficos que eles provêm;

source: the <emphasis>libpng</emphasis> library, that allows loading, interpreting and saving images in the PNG format.
pt_br: a biblioteca <emphasis>libpng</emphasis> que permite carregar, interpretar e salvar imagens no formato PNG.

source: Thanks to those libraries, applications can reuse existing code. Their development is thus correspondingly simplified, in particular when many applications reuse the same functions. Since libraries are often developed by different persons, the global development of the system is closer to Unix's historical philosophy.
pt_br: Graças a essas bibliotecas, as aplicações podem reutilizar o código existente. Seu desenvolvimento é correspondentemente simplificado, em especial quando muitas aplicações reutilizam as mesmas funções. Devido que as bibliotecas são geralmente desenvolvidas por pessoas diferentes, o desenvolvimento global do sistema está mais perto da filosofia histórica do Unix.

source: <emphasis>CULTURE</emphasis> The Unix Way: one thing at a time
pt_br: <emphasis>CULTURA</emphasis> O Estilo Unix; uma coisa de cada vez

source: One of the fundamental concepts that underlies the Unix family of operating systems is that each tool should only do one thing, and do it well; applications can then reuse these tools to build more advanced logic on top. This Way can be seen in many incarnations. Shell scripts may be the best example: they assemble complex sequences of very simple tools (such as <command>grep</command>, <command>wc</command>, <command>sort</command>, <command>uniq</command> and so on). Another implementation of this philosophy can be seen in code libraries: the <emphasis>libpng</emphasis> library allows reading and writing PNG images, with different options and in different ways, but it does only that; no question of including functions that display or edit images.
pt_br: Um dos conceitos fundamentais em que subjaz à família de sistemas operacionais Unix é que cada ferramenta deveria fazer uma coisa, e fazê-lo bem; aplicações podem reutilizar essas ferramentas para criar uma lógica mais avançada sobre elas. Desta forma podem ser vistas em muitas encarnações. Shell scripts podem ser o melhor exemplo: eles montam sequências complexas de ferramentas muito simples (como <command>grep</command>, <command>wc</command>, <command>sort</command>, <command>uniq</command> e assim por diante). Outra implementação dessa filosofia pode ser vista em bibliotecas de código: a biblioteca <emphasis>libpng</emphasis> permite ler e escrever imagens PNG, com diferentes opções e de maneiras diferentes, mas ele faz só isso; nenhuma questão de incluir funções que exibem ou editam imagens.

source: Moreover, these libraries are often referred to as “shared libraries”, since the kernel is able to only load them into memory once, even if several processes use the same library at the same time. This allows saving memory, when compared with the opposite (hypothetical) situation where the code for a library would be loaded as many times as there are processes using it.
pt_br: Além disso, essas bibliotecas muitas vezes são referidas como "bibliotecas compartilhadas", desde que o kernel possa carregá-las apenas uma vez para a memória, mesmo se vários processos utilizam a mesma biblioteca ao mesmo tempo. Isso permite economia de memória, quando comparado com a situação oposta (hipotética), onde o código para uma biblioteca seria carregada tantas vezes quantos os processos que a utilizam.
