Repository: binary-com/mobile
Catalog: */92_short-remedial-course.po
Languages: pt_br

source: Kernel
pt_br: Núcleo

source: Process
pt_br: Processo

source: Hierarchy
pt_br: Hierarquia

source: Basic Commands
pt_br: Comandos Básicos

source: Short Remedial Course
pt_br: Curso Rápido de Reparação

source: Even though this book primarily targets administrators and “power-users”, we wouldn't like to exclude motivated beginners. This appendix will therefore be a crash-course describing the fundamental concepts involved in handling a Unix computer.
pt_br: Mesmo que este livro tenha como alvo principalmente administradores de sistemas e "usuários experientes", nós não gostaríamos de excluir os iniciantes motivados. Este apêndice será, portanto, um curso intensivo que descreve os conceitos fundamentais envolvidos na operação de um computador com Unix.

source: Shell and Basic Commands
pt_br: Shell e Comandos Básicos

source: In the Unix world, every administrator has to use the command line sooner or later; for example, when the system fails to start properly and only provides a command-line rescue mode. Being able to handle such an interface, therefore, is a basic survival skill for these circumstances.
pt_br: No mundo Unix, todo administrador de sistemas terá que usar linha de comandos mais cedo ou mais tarde; por exemplo, quando o sistema falha em iniciar corretamente e provê somente o modo de recuperação via linhas de comando. Ser capaz de trabalhar com esta interface, portanto, é uma habilidade de sobrevivência básica para estas circunstâncias.

source: <emphasis>QUICK LOOK</emphasis> Starting the command interpreter
pt_br: <emphasis>OLHAR RÁPIDO</emphasis> Iniciando o interpretador de comando

source: A command-line environment can be run from the graphical desktop, by an application known as a “terminal”, such as those found under the <menuchoice><guimenu>Applications</guimenu> <guisubmenu>Accessories</guisubmenu></menuchoice> menu for GNOME, and in <menuchoice><guimenu>K</guimenu> <guisubmenu>Applications</guisubmenu> <guisubmenu>System</guisubmenu></menuchoice> for KDE.
pt_br: O ambiente de linha de comando pode ser usado a partir do ambiente gráfico do computador, através de uma aplicação conhecida como "terminal", tais como as ferramentas encontradas no menu <menuchoice><guimenu>Aplicações</guimenu> <guisubmenu>Acessórios</guisubmenu></menuchoice> para o Gnome, e em <menuchoice><guimenu>K</guimenu> <guisubmenu>Aplicações</guisubmenu> <guisubmenu>Sistema</guisubmenu></menuchoice> no KDE.

source: This section only gives a quick peek at the commands. They all have many options not described here; accordingly, they also have abundant documentation in their respective manual pages.
pt_br: Esta seção só dá uma olhada rápida nos comandos. Todos eles têm muitas opções não descritas aqui, portanto, eles também têm vasta documentação nas suas respectivas páginas de manual.

source: Browsing the Directory Tree and Managing Files
pt_br: Navegando na Árvore de Diretórios e Gestão de Arquivos

source: Once a session is open, the <command>pwd</command> command (which stands for <emphasis>print working directory</emphasis>) displays the current location in the filesystem. The current directory is changed with the <command>cd <replaceable>directory</replaceable></command> command (<command>cd</command> is for <emphasis>change directory</emphasis>). The parent directory is always called <literal>..</literal> (two dots), whereas the current directory is also known as <literal>.</literal> (one dot). The <command>ls</command> command allows <emphasis>listing</emphasis> the contents of a directory. If no parameters are given, it operates on the current directory.
pt_br: Uma vez que uma sessão é aberta, o comando <command>pwd</command> (que significa <emphasis>print working directory</emphasis> - imprimir o diretório de trabalho) mostra a localização atual do sistema de arquivos. O diretório atual é alterado com o comando <command>cd <replaceable>diretório</replaceable></command> (<command>cd</command> serve para <emphasis>change directory</emphasis> - alterar diretório). O diretório pai é sempre chamado <literal>..</literal> (dois pontos), enquanto o diretório atual também é conhecido como <literal>.</literal> (ponto). O <command>ls</command> permite <emphasis>listar</emphasis> o conteúdo de um diretório. Se nenhum parâmetro é dado, ele opera no diretório atual.

source: A new directory can be created with <command>mkdir <replaceable>directory</replaceable></command>, and an existing (empty) directory can be removed with <command>rmdir <replaceable>directory</replaceable></command>. The <command>mv</command> command allows <emphasis>moving</emphasis> and/or renaming files and directories; <emphasis>removing</emphasis> a file involves <command>rm <replaceable>file</replaceable></command>.
pt_br: Um novo diretório pode ser criado com <command>mkdir <replaceable>diretório</replaceable></command>, e um diretório (vazio) existente pode ser removido com <command>rmdir <replaceable>diretório</replaceable></command >. O comando <command>mv</command> permite <emphasis>mover</emphasis> e/ou renomear arquivos e diretórios; <emphasis>removendo</emphasis> um arquivo envolve <command>rm <replaceable>arquivo</replaceable></command>.

source: <computeroutput>$ </computeroutput><userinput>mkdir test</userinput> <computeroutput>$ </computeroutput><userinput>ls</userinput> <computeroutput>Desktop Downloads Pictures Templates Videos Documents Music Public test $ </computeroutput><userinput>mv test new</userinput> <computeroutput>$ </computeroutput><userinput>ls</userinput> <computeroutput>Desktop Downloads new Public Videos Documents Music Pictures Templates $ </computeroutput><userinput>rmdir new</userinput> <computeroutput>$ </computeroutput><userinput>ls</userinput> <computeroutput>Desktop Downloads Pictures Templates Videos Documents Music Public</computeroutput>
pt_br: <computeroutput>$ </computeroutput><userinput>mkdir teste</userinput> <computeroutput>$ </computeroutput><userinput>ls</userinput> <computeroutput>Desktop Downloads Pictures Templates Videos Documents Music Public teste $ </computeroutput><userinput>mv teste novo</userinput> <computeroutput>$ </computeroutput><userinput>ls</userinput> <computeroutput>Desktop Downloads novo Public Videos Documents Music Pictures Templates $ </computeroutput><userinput>rmdir novo</userinput> <computeroutput>$ </computeroutput><userinput>ls</userinput> <computeroutput>Desktop Downloads Pictures Templates Videos Documents Music Public</computeroutput>

source: Displaying and Modifying Text Files
pt_br: Mostrando e Modificando Arquivos Texto

source: The <command>cat <replaceable>file</replaceable></command> command (intended to <emphasis>concatenate</emphasis> files on its standard output) reads a file and displays its contents in the terminal. If the file is too big to fit on a screen, use a pager such as <command>less</command> (or <command>more</command>) to display it page by page.
pt_br: O comando <command>cat <replaceable>arquivo</replaceable></command> (destinado a <emphasis>concatenar</emphasis> arquivos em sua saída padrão) lê um arquivo e exibe seu conteúdo no terminal. Se o arquivo é muito grande para ser ajustado na tela, use um paginador como o <command>less</command> (ou <command>more</command>) para exibir o conteúdo página a página.

source: The <command>editor</command> command always points at a text editor (such as <command>vi</command> or <command>nano</command>) and allows creating, modifying and reading text files. The simplest files can sometimes be created directly from the command interpreter thanks to redirection: <command>echo "<replaceable>text</replaceable>" &gt;<replaceable>file</replaceable></command> creates a file named <replaceable>file</replaceable> with “<replaceable>text</replaceable>” as its contents. Adding a line at the end of this file is possible too, with a command such as <command>echo "<replaceable>line</replaceable>" &gt;&gt;<replaceable>file</replaceable></command>.
pt_br: O comando <command>editor</command> sempre aponta para um editor de texto (como o <command>vi</command> ou o <command>nano</command>) e permite criar, modificar e ler arquivos de texto. Os arquivos mais simples às vezes podem ser criados diretamente a partir do interpretador de comandos graças ao redirecionamento: <command>echo "<replaceable>texto</replaceable>"&gt;<replaceable>arquivo</replaceable></command> cria um arquivo chamado <replaceable>arquivo</replaceable> com "<replaceable>texto</replaceable>" como o seu conteúdo. Também é possível adicionar uma linha no final deste arquivo com um comando como <command>echo "<replaceable>linha</replaceable>"&gt;&gt;<replaceable>arquivo</replaceable></command>.

source: Searching for Files and within Files
pt_br: Procurando por e nos Arquivos

source: The <command>find <replaceable>directory</replaceable> <replaceable>criteria</replaceable></command> command looks for files in the hierarchy under <replaceable>directory</replaceable> according to several criteria. The most commonly used criterion is <literal>-name <replaceable>name</replaceable></literal>: it allows looking for a file by its name.
pt_br: O comando <command>find <replaceable>diretório</replaceable> <replaceable>critérios</replaceable></command> procura por arquivos na hierarquia sob o <replaceable>diretório</replaceable> de acordo com vários critérios. A maioria dos critérios mais comuns <literal>-name <replaceable>name</replaceable></literal>: permite procurar por um arquivos pelo seu nome.

source: The <command>grep <replaceable>expression</replaceable> <replaceable>files</replaceable></command> command searches the contents of the files and extracts the lines matching the regular expression (see sidebar <xref linkend="sidebar.regexp" />). Adding the <literal>-r</literal> option enables a recursive search on all files contained in the directory passed as a parameter. This allows looking for a file when only a part of the contents are known.
pt_br: O comando <command>grep <replaceable>expressão</replaceable> <replaceable>arquivos</replaceable></command> procura o conteúdo nos arquivos e extrai as linhas correspondentes na expressão regular (veja na barra lateral <xref linkend="sidebar.regexp"/>). Adicionando a opção <literal>-r</literal> habilita a procura recursiva em todos os arquivos contidos no diretório passado como um parâmetro. Isto permite procurar por um arquivo quando somente uma parte do conteúdo é conhecido.

source: Managing Processes
pt_br: Gerenciamento de Processos

source: The <command>ps aux</command> command lists the processes currently running and allows identifying them by their <emphasis>pid</emphasis> (process id). Once the <emphasis>pid</emphasis> of a process is known, the <command>kill -<replaceable>signal</replaceable> <replaceable>pid</replaceable></command> command allows sending it a signal (if the process belongs to the current user). Several signals exist; most commonly used are <literal>TERM</literal> (a request to terminate) and <literal>KILL</literal> (a heavy-handed kill).
pt_br: O comando <command>ps aux </command> lista os processos rodando atualmente e permite identificá-los pelo <emphasis>pid</emphasis> (identificador do processo).Uma vez que o processo<emphasis>pid</emphasis> é conhecido, o comando <command>kill -<replaceable>signal</replaceable><replaceable>pid</replaceable></command> permite enviar um sinal (este processo precisa pertencer ao usuário corrente). Existem muitos sinais; os mais usados comumente são <literal>TERM</literal> (uma requisição para terminar) e <literal>KILL</literal> (matar o processo à força).

source: The command interpreter can also run programs in the background if the command ends with “&amp;”. By using the ampersand, the user resumes control of the shell immediately even though the command is still running (hidden from the user; as a background process). The <command>jobs</command> command lists the processes running in the background; running <command>fg %<replaceable>job-number</replaceable></command> (for <emphasis>foreground</emphasis>) restores a job to the foreground. When a command is running in the foreground (either because it was started normally, or brought back to the foreground with <command>fg</command>), the <keycombo action="simul"><keycap>Control</keycap><keycap>Z</keycap></keycombo> key combination pauses the process and resumes control of the command-line. The process can then be restarted in the background with <command>bg %<replaceable>job-number</replaceable></command> (for <foreignphrase>background</foreignphrase>).
pt_br: O interpretador de comando também pode rodar programas em segundo plano se o comando terminar com “&amp;”. Ao utilizar o "e comercial", o usuário retorna o controle para o shell imediatamente desde que o comando continue rodando (oculto para o usuário; como um processo em segundo plano). O comando <command>jobs</command> lista os trabalhos rodando em segundo plano; executando <command>fg %<replaceable>número do trabalho</replaceable></command> (para <emphasis>foreground</emphasis> - primeiro plano) restaura o trabalho para o primeiro plano. Quando um comando está rodando em primeiro plano (ou porque ele foi iniciado normalmente, ou trazido de volta para o primeiro plano com <command>fg</command>), a combinação de teclas <keycombo action="simul"><keycap>Control</keycap><keycap>Z</keycap></keycombo> interrompe os processos e retorna o controle para a linha de comando. O processo pode então ser reiniciado em segundo plano com o comando <command>bg %<replaceable>numero do processo</replaceable></command> (para <foreignphrase>background</foreignphrase> - segundo plano).

source: System Information: Memory, Disk Space, Identity
pt_br: Informações do Sistema: Memória, Espaço em Disco, Identidade

source: The <command>free</command> command displays information on memory; <command>df</command> (<emphasis>disk free</emphasis>) reports on the available disk space on each of the disks mounted in the filesystem. Its <literal>-h</literal> option (for <emphasis>human readable</emphasis>) converts the sizes into a more legible unit (usually mebibytes or gibibytes). In a similar fashion, the <command>free</command> command understands the <literal>-m</literal> and <literal>-g</literal> options, and displays its data either in mebibytes or in gibibytes, respectively.
pt_br: O comando <command>free</command> exibe informações sobre a memória; o <command>df</command>(<emphasis>disk free</emphasis>) exibe relatórios sobre o espaço disponível no disco em cada um dos discos montados no sistema de arquivo. A opção <literal>-h</literal> (para <emphasis>leitura humana</emphasis> converte os tamanhos para uma unidade mais legível). De um modo semelhante, o <command>free</command> entende as opções <literal>-m</literal> e <literal>-g</literal>, e mostra estes dados tanto em megabytes ou em gigabytes, respectivamente.

source: The <command>id</command> command displays the identity of the user running the session, along with the list of groups they belong to. Since access to some files or devices may be limited to group members, checking available group membership may be useful.
pt_br: O comando <command>id</command> exibe a identidade do usuário em execução na seção, juntamente com a lista de grupos a que pertencem. Uma vez que o acesso a alguns arquivos ou dispositivos pode ser limitada aos membros do grupo, verificando os membros do grupo disponível pode ser útil.

source: Organization of the Filesystem Hierarchy
pt_br: Organização do Sistema de Arquivos Hierárquico

source: <primary>Filesystem Hierarchy</primary>
pt_br: <primary>Hierarquia do Sistema de Arquivos</primary>

source: The Root Directory
pt_br: O Diretório Raiz

source: A Debian system is organized along the <emphasis>File Hierarchy Standard</emphasis> (FHS). This standard defines the purpose of each directory. For instance, the top-level directories are described as follows:
pt_br: Um sistema Debian é organizado ao longo da <emphasis>File Hierarchy Standard</emphasis> (FHS). Esta norma define a finalidade de cada diretório. Por exemplo, as listas de nível superior são descritos como se segue:

source: <filename>/bin/</filename>: basic programs;
pt_br: <filename>/bin/</filename>: programas básicos;

source: <filename>/boot/</filename>: Linux kernel and other files required for its early boot process;
pt_br: <filename>/boot/</filename>: núcleo Linux e outros arquivos necessários para o seu processo de inicialização prematuro;

source: <filename>/dev/</filename>: device files;
pt_br: <filename>/dev/</filename>: arquivos de dispositivo;

source: <filename>/etc/</filename>: configuration files;
pt_br: <filename>/etc/</filename>: Arquivos de configuração;

source: <filename>/home/</filename>: user's personal files;
pt_br: <filename>/home/</filename>: arquivos pessoais do usuário;

source: <filename>/lib/</filename>: basic libraries;
pt_br: <filename>/lib/</filename>: bibliotecas básicas;

source: <filename>/media/*</filename>: mount points for removable devices (CD-ROM, USB keys and so on);
pt_br: <filename>/media/*</filename>: pontos de montagem para dispositivos removíveis (CD-ROM, pendrivers e assim por diante);

source: <filename>/mnt/</filename>: temporary mount point;
pt_br: <filename>/mnt/</filename>: ponto de montagem temporário;

source: <filename>/opt/</filename>: extra applications provided by third parties;
pt_br: <filename>/opt/</filename>: aplicações extras fornecidas por terceiros;

source: <filename>/root/</filename>: administrator's (root's) personal files;
pt_br: <filename>/root/</filename>: arquivos pessoais do administrador (root);

source: <filename>/sbin/</filename>: system programs;
pt_br: <filename>/sbin/</filename>: programas do sistema;

source: <filename>/srv/</filename>: data used by servers hosted on this system;
pt_br: <filename>/srv/</filename>: dados utilizados por servidores hospedados neste sistema;

source: <filename>/tmp/</filename>: temporary files; this directory is often emptied at boot;
pt_br: <filename>/tmp/</filename>: arquivos temporários, este diretório é comumente limpo na inicialização;

source: <filename>/usr/</filename>: applications; this directory is further subdivided into <filename>bin</filename>, <filename>sbin</filename>, <filename>lib</filename> (according to the same logic as in the root directory). Furthermore, <filename>/usr/share/</filename> contains architecture-independent data. <filename>/usr/local/</filename> is meant to be used by the administrator for installing applications manually without overwriting files handled by the packaging system (<command>dpkg</command>).
pt_br: <filename>/usr/</filename>: aplicações; este diretório é subdividido em <filename>bin</filename>, <filename>sbin</filename>, <filename>lib</filename> (de acordo com a mesma lógica que no diretório raiz). Além disso, <filename>/usr/share/</filename> contém dados independentes de arquitetura. <filename>/usr/local/</filename> é feito para ser usado pelo administrador para instalar aplicativos manualmente, sem sobrescrever arquivos administrados pelo sistema de empacotamento (<command>dpkg</command>).

source: <filename>/var/</filename>: variable data handled by daemons. This includes log files, queues, spools, caches and so on.
pt_br: <filename>/var/</filename>: dados variáveis manipulados por deamons. Isto incluí arquivos de sessão, filas, spools, caches e por aí vai.

source: <filename>/proc/</filename> and <filename>/sys/</filename> are specific to the Linux kernel (and not part of the FHS). They are used by the kernel for exporting data to user-space.
pt_br: <filename>/proc/</filename> e <filename>/sys/</filename> são específicos do núcleo Linux ( e não fazem parte do FHS). Eles são usados pelo núcleo para exportar informação para o espaço de usuário.

source: The User's Home Directory
pt_br: O Diretório Origem do Usuário

source: The contents of a user's home directory is not standardized, but there are still a few noteworthy conventions. One is that a user's home directory is often referred to by a tilde (“~”). That is useful to know because command interpreters automatically replace a tilde with the correct directory (usually <filename>/home/<replaceable>user</replaceable>/</filename>).
pt_br: O conteúdo do diretório home do usuário não é padronizado, mas ainda existem algumas convenções notáveis. Uma delas é que diretório home do usuário é muitas vezes referenciado por um til ("~"). Isso é útil para saber porque os interpretadores de comando substituir automaticamente um til pelo diretório correto (geralmente <filename>/home/<replaceable>user</replaceable>/</filename>).

source: Traditionally, application configuration files are often stored directly under the user's home directory, but their names usually start with a dot (for instance, the <command>mutt</command> email client stores its configuration in <filename>~/.muttrc</filename>). Note that filenames that start with a dot are hidden by default; and <command>ls</command> only lists them when the <literal>-a</literal> option is used, and graphical file managers need to be told to display hidden files.
pt_br: Tradicionalmente, os arquivos de configuração do aplicativo são frequentemente armazenados diretamente sob o diretório home do usuário, mas seus nomes geralmente começam com um ponto (por exemplo, o cliente de email <command>mutt</command> armazena sua configuração em <filename>~/.muttrc</filename>). Note que nomes de arquivos que começam com um ponto são ocultos por padrão; e <command>ls</command> os lista apenas quando a opção <literal>-a</literal> for usada, e gerenciadores de arquivos gráficos precisa ser dito para exibir arquivos ocultos.

source: Some programs also use multiple configuration files organized in one directory (for instance, <filename>~/.ssh/</filename>). Some applications (such as the Iceweasel web browser) also use their directory to store a cache of downloaded data. This means that those directories can end up using a lot of disk space.
pt_br: Alguns programas também utilizam vários arquivos de configuração organizados em um diretório (por exemplo, <filename>~/.ssh/</filename>). Alguns aplicativos (como o navegador web Iceweasel) também usam seu diretório para armazenar um cache de dados baixados. Isto significa que os diretórios podem acabar usando muito espaço em disco.
